Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/ddis.po
Languages: es

source: Number data
es: Datos del número

source: Country
es: País

source: The country of the new created DDI. Used for E164 standardization.
es: El país del nuevo DDI creado. Usado para la estandarización E164.

source: The number, without country code.
es: El número, sin código de país.

source: Display name
es: Nombre en pantalla

source: This value will be shown in the called terminals.
es: Este valor se mostrará en los terminales llamados.

source: Language
es: Idioma

source: Description
es: Descripción

source: Type
es: Tipo

source: Choose 'Inbound & outbound' for a normal DDI that can be used both as outgoing DDI and as incoming DDI from a :ref:`DDI Provider <DDI Providers>`. Choose 'Outbound only' for a DDI that won't reach us from a :ref:`DDI Provider <DDI Providers>` and will only be used as an outgoing DDI.
es: Elija 'Entrante y saliente' para un DDI normal que se puede usar tanto como DDI saliente como DDI entrante desde un :ref:`Proveedor DDI <DDI Providers>`. Elija 'Solo saliente' para un DDI que no nos llegará desde un :ref:`Proveedor DDI <DDI Providers>` y solo se usará como DDI saliente.

source: DDI Provider
es: Proveedor DDI

source: The :ref:`DDI Provider <DDI Providers>` that provides this number. This relation has no functional purpose, it is just for DDI Provider <-> DDI navigation in some brand level sections.
es: El :ref:`Proveedor DDI <DDI Providers>` que proporciona este número. Esta relación no tiene un propósito funcional, es solo para la navegación Proveedor <-> DDI en algunas secciones a nivel de marca.

source: Filters data
es: Datos de filtros

source: External Call Filter
es: Filtro de llamada externa

source: Allows configuration based on Calendars and Schedulers as shown in :ref:`External Call Filters`. Leave empty if you don't need to apply any kind of filter.
es: Permite la configuración basada en Calendarios y Programadores como se muestra en :ref:`Filtros de llamadas externas <External Call Filters>`. Dejar vacío si no necesita aplicar ningún tipo de filtro.

source: Routing configuration
es: Configuración de enrutamiento

source: Route type
es: Tipo de ruta

source: A DDI can have different :ref:`treatments <routing_logics>`. For our current goal, set route to user and select *Alice*.
es: Un DDI puede tener diferentes :ref:`tratamientos <routing_logics>`. Para nuestro objetivo actual, configure la ruta al usuario y seleccione *Alice*.

source: Recording data
es: Datos de grabación

source: Record calls
es: Grabar llamadas

source: Can be used to record external calls (see :ref:`call_recordings`).
es: Se puede usar para grabar llamadas externas (ver :ref:`grabaciones_de_llamadas <call_recordings>`).

source: Tarificate incoming calls
es: Tarificar llamadas entrantes

source: This setting requires the external tarification module and allows tarification on special numbers. This module is not standard so don't hesitate in :ref:`contact us <getting_help>` if you are interested.
es: Esta configuración requiere el módulo de tarificación externa y permite la tarificación en números especiales. Este módulo no es estándar, así que no dude en :ref:`contactarnos <getting_help>` si está interesado.

source: Calls received from a :ref:`DDI Provider <DDI Providers>` to an 'Outbound only' DDI will be rejected.
es: Las llamadas recibidas de un :ref:`Proveedor DDI <DDI Providers>` a un DDI 'Solo saliente' serán rechazadas.

source: Calls from within the platform to 'Inbound & outbound' DDIs won't reach any carrier, they will be routed internally.
es: Las llamadas desde dentro de la plataforma a DDIs 'Entrante y saliente' no llegarán a ningún operador, se enrutarán internamente.

source: DDI external filters
es: Filtros externos de DDI

source: We can assign a **external call filter** configured in :ref:`External Call Filters`.
es: Podemos asignar un **filtro de llamada externa** configurado en :ref:`Filtros de llamadas externas <External Call Filters>`.

source: DDI routes
es: Rutas DDI

source: Once the call has passed all the checks in the filter (schedules and calendars) and after the welcome locution has been played (if there is any configured), we can route the call to the following processes:
es: Una vez que la llamada ha pasado todas las verificaciones en el filtro (horarios y calendarios) y después de que se haya reproducido la locución de bienvenida (si hay alguna configurada), podemos enrutar la llamada a los siguientes procesos:

source: :ref:`users`
es: :ref:`usuarios <users>`

source: :ref:`huntgroups`
es: :ref:`grupos de salto <huntgroups>`

source: :ref:`ivrs`
es: :ref:`ivrs <ivrs>`

source: :ref:`conference_rooms`
es: :ref:`salas de conferencias <conference_rooms>`

source: :ref:`conditional_routes`
es: :ref:`rutas condicionales <conditional_routes>`

source: :ref:`queues`
es: :ref:`colas <queues>`

source: :ref:`friends`
es: :ref:`friends <friends>`

source: We can also route the DDI to a :ref:`Virtual Fax <faxing_system>`, but this is something we will explain in the following block.
es: También podemos enrutar el DDI a un :ref:`Fax Virtual <faxing_system>`, pero esto es algo que explicaremos en el siguiente bloque.
