Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/extensions.po
Languages: es

source: Extensions
es: Extensiones

source: **An extensions is**, by definition, **an internal number with an assigned logic**. Internal users' calls to numbers listed in this section do not traverse call ACL logics: **every user/friend is allowed to call to any number listed here**.
es: **Una extensión es**, por definición, **un número interno con una lógica asignada**. Las llamadas de usuarios internos a los números listados en esta sección no atraviesan las lógicas de permisos de llamada: **todos los usuarios/friends pueden llamar a cualquier número listado aquí**.

source: Create a new extension
es: Crear una nueva extensión

source: Number
es: Número

source: The number that must be dialed by the internal user that will trigger the configured logic. It must have a minimum length of 2 and must be a number.
es: El número que debe marcar el usuario interno que activará la lógica configurada. Debe tener una longitud mínima de 2 y debe ser un número.

source: Route
es: Ruta

source: This select will allow us to choose the logic that will use this extension when is dialed from an internal user. Depending on the selected route, and additional select or input will be shown to select the hunt group, conference room, user, etc.
es: Esta selección nos permitirá elegir la lógica que usará esta extensión cuando sea marcada por un usuario interno. Dependiendo de la ruta seleccionada, se mostrará una selección o entrada adicional para seleccionar el grupo de salto, sala de conferencias, usuario, etc.

source: If an extension has a number that conflicts with an external number, this external number will be masked and, in practice, will be unavailable for the whole client.
es: Si una extensión tiene un número que entra en conflicto con un número externo, este número externo será enmascarado y, en la práctica, estará indisponible para todo el cliente.

source: Route options
es: Opciones de ruta

source: Unassigned
es: No asignado

source: Calls to this extension will be hung up.
es: Las llamadas a esta extensión serán colgadas.

source: User
es: Usuario

source: Selected :ref:`user <Users>` will be called.
es: Se llamará al :ref:`usuario <Users>` seleccionado.

source: Selected :ref:`IVR <IVRs>` logic will be called.
es: Se llamará a la lógica del :ref:`IVR <IVRs>` seleccionado.

source: Hunt Group
es: Grupo de salto

source: Selected :ref:`huntgroup <huntgroups>` will be called.
es: Se llamará al :ref:`grupo de salto <huntgroups>` seleccionado.

source: Calling to this extension will generate an external outbound call to introduced number.
es: Llamar a esta extensión generará una llamada externa saliente al número introducido.

source: Calls to this extension will evaluate :ref:`friends <Friends>` logic.
es: Las llamadas a esta extensión evaluarán la lógica de :ref:`friends <Friends>`.

source: Queue
es: Cola

source: Call will be delivered to selected :ref:`queue <Queues>`.
es: La llamada será entregada a la :ref:`cola <Queues>` seleccionada.

source: Conditional route
es: Ruta condicional

source: Call will be delivered to selected :ref:`conditional route <Conditional Routes>`.
es: La llamada será entregada a la :ref:`ruta condicional <Conditional Routes>` seleccionada.

source: Voicemail
es: Buzón de voz

source: Calls will be delivered to selected :ref:`voicemails <Voicemails>`.
es: Las llamadas serán entregadas al :ref:`buzón de voz <Voicemails>` seleccionado.

source: Any internal user can generate an external outbound call via an **Extension routed to Number** even if its *Call permissions* does not allow to call to that destination directly.
es: Cualquier usuario interno puede generar una llamada externa saliente a través de una **Extensión enrutada a Número** incluso si sus *Permisos de llamada* no permiten llamar a ese destino directamente.

source: Import aliases
es: Importar alias

source: *Extensions to numbers* are useful to call to most dialed numbers easily. As each client usually has a list with frequent numbers, **Import aliases** button allows importing them through a CSV file.
es: *Extensiones a números* son útiles para llamar fácilmente a los números más marcados. Como cada cliente suele tener una lista con números frecuentes, el botón **Importar alias** permite importarlos a través de un archivo CSV.

source: Example import file
es: Archivo de importación de ejemplo

source: Numbers will be imported synchronously following these rules:
es: Los números se importarán de forma sincrónica siguiendo estas reglas:

source: If given extension already exists and points to a number: number is updated.
es: Si la extensión dada ya existe y apunta a un número: el número se actualiza.

source: If given extension already exists and does not point to a number: error.
es: Si la extensión dada ya existe y no apunta a un número: error.

source: If given country prefix does not exist: error.
es: Si el prefijo del país dado no existe: error.

source: If given country code does not exist: error.
es: Si el código del país dado no existe: error.

source: If given country prefix and country code combination does not exist: error.
es: Si la combinación de prefijo y código de país dada no existe: error.

source: CountryCode is optional: if given country prefix is used in multiple countries and country code is not given, first country is selected.
es: El código de país es opcional: si el prefijo del país dado se usa en múltiples países y no se da el código de país, se selecciona el primer país.
