Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/faxes.po
Languages: es

source: IvozProvider includes a simple but efficient *virtual faxing* solution that allows:
es: IvozProvider incluye una solución de *fax virtual* simple pero eficiente que permite:

source: Sending PDF files via Fax.
es: Enviar archivos PDF por fax.

source: Receiving faxes through email or check them through the web portal.
es: Recibir faxes por correo electrónico o revisarlos a través del portal web.

source: IvozProvider uses `T.38 <http://www.voip-info.org/wiki/view/T.38>`_ for both sending and receiving faxes. Brand Operator must use *peering contracts* that have support for it.
es: IvozProvider utiliza `T.38 <http://www.voip-info.org/wiki/view/T.38>`_ tanto para enviar como para recibir faxes. El Operador de Marca debe usar *contratos de peering* que lo soporten.

source: Creating a virtual fax
es: Crear un fax virtual

source: These are the fields that turn up when we create a new fax:
es: Estos son los campos que aparecen cuando creamos un nuevo fax:

source: Name
es: Nombre

source: Used by remaining section to reference a fax
es: Usado por la sección restante para referenciar un fax

source: Email address when we want to receive incoming faxes (if we check 'Send by email')
es: Dirección de correo electrónico cuando queremos recibir faxes entrantes (si marcamos 'Enviar por correo electrónico')

source: Outbound DDI
es: DDI de salida

source: DDI used as source number for outgoing faxes
es: DDI usado como número de origen para faxes salientes

source: To receive faxes in this DDI, we need to point it to our new fax in the section **DDIs**.
es: Para recibir faxes en este DDI, necesitamos apuntarlo a nuestro nuevo fax en la sección **DDIs**.

source: Brand Operator can choose one or more :ref:`Outgoing Routings` for sending faxes.
es: El Operador de Marca puede elegir uno o más :ref:`Enrutamientos Salientes <Outgoing Routings>` para enviar faxes.

source: *load-balancing* y *failover* logics described in :ref:`Outgoing Routings` apply to faxes too.
es: Las lógicas de *balanceo de carga* y *conmutación por error* descritas en :ref:`Enrutamientos Salientes <Outgoing Routings>` también se aplican a los faxes.

source: If no fax-specific route is defined, faxes will be routed using standard call routes.
es: Si no se define una ruta específica para faxes, los faxes se enrutarán utilizando las rutas de llamadas estándar.

source: Sending a fax
es: Enviar un fax

source: Sending a fax is an easy task that is done through **List of outgoing faxfiles** subsection.
es: Enviar un fax es una tarea fácil que se realiza a través de la subsección **Lista de archivos de fax salientes**.

source: First, we upload de PDF file and set the destination. When we save the entry, the list shows the fax and its status.
es: Primero, subimos el archivo PDF y configuramos el destino. Cuando guardamos la entrada, la lista muestra el fax y su estado.

source: Incoming faxes display
es: Visualización de faxes entrantes

source: Apart from being received by mail, faxes can be watched and downloaded within the web portal too in **List of incoming faxfiles** subsection.
es: Aparte de ser recibidos por correo, los faxes también se pueden ver y descargar dentro del portal web en la subsección **Lista de archivos de fax entrantes**.
