Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/terminals.po
Languages: es

source: Terminals
es: Terminales

source: The section **Client configuration** > **Terminals** allows creating new SIP credentials that can be used by multiple SIP devices to place and receive calls from IvozProvider.
es: La sección **Configuración del cliente** > **Terminales** permite crear nuevas credenciales SIP que pueden ser utilizadas por múltiples dispositivos SIP para realizar y recibir llamadas desde IvozProvider.

source: The best way to understand this section is creating a new item and see the fields that must be filled.
es: La mejor manera de entender esta sección es creando un nuevo elemento y viendo los campos que deben ser completados.

source: Login information
es: Información de inicio de sesión

source: Name
es: Nombre

source: Username that will use the terminal during the SIP authentication phase with IvozProvider.
es: Nombre de usuario que utilizará el terminal durante la fase de autenticación SIP con IvozProvider.

source: Password
es: Contraseña

source: Password that will use the terminal to answer the SIP authentication challenge. You can use the automatic password generator to fulfill the secure password requirements.
es: Contraseña que utilizará el terminal para responder al desafío de autenticación SIP. Puede usar el generador automático de contraseñas para cumplir con los requisitos de contraseña segura.

source: Connection configuration
es: Configuración de conexión

source: Allowed/Disallowed codecs
es: Codecs permitidos/rechazados

source: Determines what audio and video codecs will be used with the terminal.
es: Determina qué codecs de audio y video se utilizarán con el terminal.

source: CallerID update method
es: Modo actualización

source: Choose the SIP method the terminal prefers to received the session update information: INVITE or UPDATE. The help hint can be used as guide to configure different terminal manufacturers. Use *INVITE* in case of doubt.
es: Elija el método SIP que el terminal prefiere para recibir la información de actualización de la sesión: INVITE o UPDATE. La pista de ayuda puede usarse como guía para configurar diferentes fabricantes de terminales. Use *INVITE* en caso de duda.

source: Enable T.38 passthrough
es: Habilitar pasarela T.38

source: If set to 'yes', this SIP endpoint must be a **T.38 capable fax sender/receiver**. IvozProvider will act as a T.38 gateway, bridging fax-calls of a T.38 capable carrier and a T.38 capable device.
es: Si se establece en 'sí', este punto final SIP debe ser un **fax capaz de T.38 emisor/receptor**. IvozProvider actuará como una pasarela T.38, conectando llamadas de fax de un operador compatible con T.38 y un dispositivo compatible con T.38.

source: RTP Encryption
es: Cifrar RTP

source: If set to 'yes', call won't be established unless it's possible to encryption its audio. If set to 'no', audio won't be encrypted.
es: Si se establece en 'sí', la llamada no se establecerá a menos que sea posible cifrar su audio. Si se establece en 'no', el audio no se cifrará.

source: Terminal model
es: Modelo de Terminales

source: Determines the provisioning type that will receive this terminal. The section :ref:`terminal provisioning <provisioning>` will explain in depth the different models for automatic provision. If your device does not require provisioning, just select *Generic*.
es: Determina el tipo de aprovisionamiento que recibirá este terminal. La sección :ref:`provisionamiento de terminales <provisioning>` explicará en profundidad los diferentes modelos para el aprovisionamiento automático. Si su dispositivo no requiere aprovisionamiento, simplemente seleccione *Genérico*.

source: Optional field that is only required if you plan to use IvozProvider :ref:`terminal provisioning <provisioning>`. This is the `physical address <https://wikipedia.org/wiki/MAC_Address>`_ of the network adapter of the SIP device.
es: Campo opcional que solo es necesario si planea usar el :ref:`provisionamiento de terminales <provisioning>` de IvozProvider. Esta es la `dirección física <https://wikipedia.org/wiki/MAC_Address>`_ del adaptador de red del dispositivo SIP.

source: For **most of devices** that doesn't require provisioning just filling **username** and **password** will be enough.
es: Para **la mayoría de los dispositivos** que no requieren aprovisionamiento, solo completar **nombre de usuario** y **contraseña** será suficiente.

source: Once the terminal has been created, most devices will only require the name, password and :ref:`Client SIP domain <domain_per_client>` in order to place calls.
es: Una vez que se haya creado el terminal, la mayoría de los dispositivos solo requerirán el nombre, la contraseña y el :ref:`dominio SIP del cliente <domain_per_client>` para realizar llamadas.
