Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/users.po
Languages: es

source: Users
es: Usuarios

source: The installation process creates *Alice* and *Bob* users, allowing us to test internals calls between them without too much effort.
es: El proceso de instalación crea usuarios *Alice* y *Bob*, lo que nos permite probar llamadas internas entre ellos sin mucho esfuerzo.

source: We skipped most of the settings in **Users** configuration that we will described in this section.
es: Omitimos la mayoría de las configuraciones en la configuración de **Usuarios** que describiremos en esta sección.

source: Personal data
es: Datos personales

source: Name
es: Nombre

source: Used to identify this user in most of the screens. This is also the name that will be displayed in internal calls made from this user.
es: Se utiliza para identificar a este usuario en la mayoría de las pantallas. Este también es el nombre que se mostrará en las llamadas internas realizadas desde este usuario.

source: Lastname
es: Apellido

source: Most of the times this is used to complete the previous field.
es: La mayoría de las veces se usa para completar el campo anterior.

source: Email
es: Correo electrónico

source: Email used to send the user's received voicemails. This is also used to identify the user in their portal.
es: Correo electrónico utilizado para enviar los buzones de voz recibidos del usuario. Esto también se usa para identificar al usuario en su portal.

source: Geographic Configuration
es: Configuración geográfica

source: Language
es: Idioma

source: When a locution is played to this user, this language is used.
es: Cuando se reproduce una locución a este usuario, se utiliza este idioma.

source: Timezone
es: Zona horaria

source: User portal call list times will use this timezone.
es: Los tiempos de la lista de llamadas del portal del usuario utilizarán esta zona horaria.

source: Numeric transformation
es: Transformación numérica

source: Defines how numbers are converted from user format to E.164 and the other way around.
es: Define cómo se convierten los números del formato de usuario a E.164 y viceversa.

source: Location
es: Ubicación

source: User geographical location where the user is working at.
es: Ubicación geográfica del usuario donde el usuario está trabajando.

source: Login Info
es: Información de inicio de sesión

source: Active
es: Activo

source: Allows administrators to grant or disable user's acces to the :ref:`user's portal <userportal>`.
es: Permite a los administradores otorgar o deshabilitar el acceso del usuario al :ref:`portal del usuario <userportal>`.

source: Password
es: Contraseña

source: Password used to access the :ref:`user's portal <userportal>`.
es: Contraseña utilizada para acceder al :ref:`portal del usuario <userportal>`.

source: QR Code
es: Código QR

source: If enabled, a QR code for Grandstream Wave softphone configuration will be shown.
es: Si está habilitado, se mostrará un código QR para la configuración del softphone Grandstream Wave.

source: Boss-Assistant
es: Jefe-Asistente

source: This feature will turn the user into a boss that can only be directly call by:
es: Esta función convertirá al usuario en un jefe que solo puede ser llamado directamente por:

source: The selected assistant.
es: El asistente seleccionado.

source: Any origin that matches the white list.
es: Cualquier origen que coincida con la lista blanca.

source: The rest of the calls to *a boss* will be redirected to the assistant.
es: El resto de las llamadas a *un jefe* serán redirigidas al asistente.

source: Is boss
es: Es jefe

source: Determines if this user is a boss.
es: Determina si este usuario es un jefe.

source: Assistant
es: Asistente

source: Who will receive the redirected calls of this boss.
es: Quién recibirá las llamadas redirigidas de este jefe.

source: Whitelist
es: Lista blanca

source: :ref:`match_lists` with origins that are allowed to call directly to the boss.
es: :ref:`listas de coincidencias <match_lists>` con orígenes que están permitidos para llamar directamente al jefe.

source: Basic Configuration
es: Configuración básica

source: The available terminals created in :ref:`terminals` are listed here for assignment.
es: Los terminales disponibles creados en :ref:`terminales <terminals>` se enumeran aquí para su asignación.

source: Screen Extension
es: Extensión de pantalla

source: One of the available :ref:`extensions` that this user will display when placing internal calls. While multiple extensions can be routed to the user, only one of them will be presented when the user calls.
es: Una de las :ref:`extensiones <extensions>` disponibles que este usuario mostrará cuando realice llamadas internas. Aunque se pueden enrutar múltiples extensiones al usuario, solo una de ellas se presentará cuando el usuario llame.

source: Outgoing DDI
es: DDI saliente

source: As described in :ref:`external_ddi`, determines the number that will present when placing external outgoing calls.
es: Como se describe en :ref:`ddi_externo <external_ddi>`, determina el número que se presentará al realizar llamadas salientes externas.

source: Outgoing DDI Rules
es: Reglas de DDI saliente

source: Manages exceptions to previous setting. Read :ref:`outgoingddi_rules` for further reference.
es: Gestiona excepciones a la configuración anterior. Lea :ref:`reglas_ddi_saliente <outgoingddi_rules>` para más información.

source: Call ACL
es: ACL de llamadas

source: One of the created :ref:`Call ACL <call_permissions>` groups, described it the previous sections.
es: Uno de los grupos de :ref:`ACL de llamadas <call_permissions>` creados, descrito en las secciones anteriores.

source: Do not disturb
es: No molestar

source: When this setting is enabled, the user won't receive any call but can still place calls.
es: Cuando esta configuración está habilitada, el usuario no recibirá ninguna llamada pero aún puede realizar llamadas.

source: Call waiting
es: Llamada en espera

source: Limits received calls when already handling this number of calls. Set 0 for unlimited.
es: Limita las llamadas recibidas cuando ya se está manejando este número de llamadas. Establezca 0 para ilimitado.

source: Calls from non-granted IPs
es: Llamadas desde IPs no autorizadas

source: Enable calling from non-granted IP addresses for this user. It limits the number of outgoing calls to avoid toll-fraud. 'None' value makes outgoing calls unlimited as long as client IP policy is fulfilled. Read :ref:`roadwarrior_users` for further reference.
es: Habilitar llamadas desde direcciones IP no autorizadas para este usuario. Limita el número de llamadas salientes para evitar el fraude de peaje. El valor 'Ninguno' hace que las llamadas salientes sean ilimitadas siempre que se cumpla la política de IP del cliente. Lea :ref:`usuarios_roadwarrior <roadwarrior_users>` para más información.

source: Multi Contact
es: Contacto múltiple

source: Same SIP credentials can be configured in multiple SIP devices. In that case, all devices ring simultaneously when receiving a call. Setting this toggle to 'No' limits this behaviour so that only latest registered SIP device rings.
es: Las mismas credenciales SIP se pueden configurar en múltiples dispositivos SIP. En ese caso, todos los dispositivos suenan simultáneamente al recibir una llamada. Configurar este conmutador en 'No' limita este comportamiento para que solo suene el último dispositivo SIP registrado.

source: Call Rejection Method
es: Método de rechazo de llamadas

source: This setting allows configuring a behaviour on call rejection for users with several SIP devices (Multi Contact: yes). In such scenarios, all devices ring simultaneously and call rejection must choose whether rejecting call just in the device that declined or in all ringing devices. Default behaviour is to cancel call in all devices for 600/603 response codes and only in current device for 480/486. Choose whether you want to force one behaviour or another no matter which response code your SIP device sends on call rejection.
es: Esta configuración permite configurar un comportamiento en el rechazo de llamadas para usuarios con varios dispositivos SIP (Contacto múltiple: sí). En tales escenarios, todos los dispositivos suenan simultáneamente y el rechazo de llamadas debe elegir si rechazar la llamada solo en el dispositivo que la rechazó o en todos los dispositivos que están sonando. El comportamiento predeterminado es cancelar la llamada en todos los dispositivos para los códigos de respuesta 600/603 y solo en el dispositivo actual para 480/486. Elija si desea forzar un comportamiento u otro sin importar qué código de respuesta envíe su dispositivo SIP al rechazar la llamada.

source: Group Configuration
es: Configuración de grupo

source: As described in the sections :ref:`huntgroups` and :ref:`capture_groups`, the user can be part of one or more hunt groups and pickup groups.
es: Como se describe en las secciones :ref:`grupos_de_búsqueda <huntgroups>` y :ref:`grupos_de_captura <capture_groups>`, el usuario puede ser parte de uno o más grupos de búsqueda y grupos de captura.

source: Those groups can be configured from the sections :ref:`huntgroups` and :ref:`capture_groups` or the user's screen if the groups already exists.
es: Esos grupos se pueden configurar desde las secciones :ref:`grupos_de_búsqueda <huntgroups>` y :ref:`grupos_de_captura <capture_groups>` o desde la pantalla del usuario si los grupos ya existen.

source: You can also configure the user's **hunt groups** from the icon in each user line of the users list.
es: También puede configurar los **grupos de búsqueda** del usuario desde el icono en cada línea de usuario de la lista de usuarios.

source: User Call Forward
es: Desvío de llamadas del usuario

source: The user's call forward can be configured with the **List of call forward settings** button.
es: El desvío de llamadas del usuario se puede configurar con el botón **Lista de configuraciones de desvío de llamadas**.

source: These are the fields and available values:
es: Estos son los campos y valores disponibles:

source: Allows enabling or disabling this call forward.
es: Permite habilitar o deshabilitar este desvío de llamadas.

source: Call Type
es: Tipo de llamada

source: Determines if the forward must be applied to external, internal or any type of call.
es: Determina si el desvío debe aplicarse a llamadas externas, internas o cualquier tipo de llamada.

source: Forward type
es: Tipo de desvío

source: When this forward must be applied:
es: Cuándo debe aplicarse este desvío:

source: Unconditional: always
es: Incondicional: siempre

source: No answer: when the call is not answered in X seconds
es: Sin respuesta: cuando la llamada no se responde en X segundos

source: Busy: When the user is talking to someone (and call waiting is disabled), when *Do not disturb* is enabled or when the user rejects an incoming call.
es: Ocupado: Cuando el usuario está hablando con alguien (y la llamada en espera está deshabilitada), cuando *No molestar* está habilitado o cuando el usuario rechaza una llamada entrante.

source: Not registered: when the user SIP terminal is not registered against IvozProvider.
es: No registrado: cuando el terminal SIP del usuario no está registrado contra IvozProvider.

source: Target type
es: Tipo de destino

source: What route will use the forwarded call.
es: Qué ruta utilizará la llamada desviada.

source: VoiceMail
es: Buzón de voz

source: Number (external)
es: Número (externo)

source: Extension (internal)
es: Extensión (interna)

source: If we want to forward to other process, we can create an extension routed to that object and use the target type *Extension*.
es: Si queremos desviar a otro proceso, podemos crear una extensión enrutada a ese objeto y usar el tipo de destino *Extensión*.
