Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/voicemails.po
Languages: es

source: Voicemails
es: Buzones de voz

source: Voicemails can be used as leaf routable endpoint in most vPBX logics.
es: Los buzones de voz pueden usarse como punto final enrutado en la mayoría de las lógicas de vPBX.

source: All users start with a pre-configured voicemail with their email address that can be disabled in voicemails section.
es: Todos los usuarios comienzan con un buzón de voz preconfigurado con su dirección de correo electrónico que se puede desactivar en la sección de buzones de voz.

source: It's also possible to create a Voicemail that is not linked to any user, so it can be used in more global routing logics.
es: También es posible crear un buzón de voz que no esté vinculado a ningún usuario, por lo que se puede usar en lógicas de enrutamiento más globales.

source: For these generic voicemails, an extension routed to the voicemail is required to access the check voicemail service (using the service code followed by the extension number).
es: Para estos buzones de voz genéricos, se requiere una extensión enrutada al buzón de voz para acceder al servicio de verificación de buzón de voz (usando el código de servicio seguido del número de extensión).

source: Voicemail most notable fields are:
es: Los campos más notables del buzón de voz son:

source: Enabled
es: Habilitado

source: Enables or disables voicemail. This will hide this voicemail from select listboxes in routes.
es: Habilita o deshabilita el buzón de voz. Esto ocultará este buzón de voz de las listas de selección en las rutas.

source: Name
es: Nombre

source: The name displayed in the selection listboxes. For user voicemails, this value is calculated from Firstname and Lastname of the user.
es: El nombre que se muestra en las listas de selección. Para los buzones de voz de usuario, este valor se calcula a partir del nombre y apellido del usuario.

source: Voicemail send mail
es: Enviar correo de buzón de voz

source: Send or not send an email to the configured user address when a new voicemail is received. For user voicemails this value is configured in User edit screen.
es: Enviar o no enviar un correo electrónico a la dirección de usuario configurada cuando se recibe un nuevo buzón de voz. Para los buzones de voz de usuario, este valor se configura en la pantalla de edición del usuario.

source: Voicemail attach sounds
es: Adjuntar sonidos de buzón de voz

source: Choose whether to attach the audio message to the sent email. Only displayed when *Voicemail send mail* is set to *Yes*
es: Elija si desea adjuntar el mensaje de audio al correo electrónico enviado. Solo se muestra cuando *Enviar correo de buzón de voz* está configurado en *Sí*

source: Locution
es: Locución

source: If set, this locution is played as voicemail welcome message when a voicemail for this voicemail is going to be recorded. This only applies for call forwards to voicemail.
es: Si se establece, esta locución se reproduce como mensaje de bienvenida del buzón de voz cuando se va a grabar un buzón de voz para este buzón de voz. Esto solo se aplica para desvíos de llamadas al buzón de voz.

source: Users
es: Usuarios

source: Allows assigning the voicemail to specific users. Only available for generic mailboxes.
es: Permite asignar el buzón de voz a usuarios específicos. Solo disponible para buzones de voz genéricos.

source: If voicemail locution is not assigned, default locution will be used as long as the owner has not recorded a custom message through the voicemail menu (calling to voicemail service code).
es: Si no se asigna una locución de buzón de voz, se utilizará la locución predeterminada siempre que el propietario no haya grabado un mensaje personalizado a través del menú de buzón de voz (llamando al código de servicio de buzón de voz).
