Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/user_portal/urls.po
Languages: es

source: Prior to accessing to user portal, the URL addresses must be configured (domains in these URLs must point to any of the public IP addresses of the platform).
es: Antes de acceder al portal de usuario, las direcciones URL deben estar configuradas (los dominios en estas URLs deben apuntar a cualquiera de las direcciones IP públicas de la plataforma).

source: 2 roles can perform this task:
es: 2 roles pueden realizar esta tarea:

source: God operator
es: Operador dios

source: In the section **Platform configuration > Brands** you can configure as many user URLs as you wish, using the button **Portal list** of each brand.
es: En la sección **Configuración de la plataforma > Marcas** puedes configurar tantas URLs de usuario como desees, usando el botón **Lista de portales** de cada marca.

source: URLs are linked to brands and god operator may choose where to create one shared user portal URL for all the clients of a brand or creating one per client.
es: Las URLs están vinculadas a las marcas y el operador dios puede elegir si crear una URL de portal de usuario compartida para todos los clientes de una marca o crear una por cliente.

source: URLs MUST be HTTPS.
es: Las URLs DEBEN ser HTTPS.

source: This section also allows setting a logo per URL, a theme and a phrase to use as the title of user portal.
es: Esta sección también permite configurar un logo por URL, un tema y una frase para usar como título del portal de usuario.

source: This allows creating corporate user portals.
es: Esto permite crear portales de usuario corporativos.

source: Brand Operator
es: Operador de marca

source: Brand Operator can also perform this same task in order to configure the user portal URLs of his clients.
es: El operador de marca también puede realizar esta misma tarea para configurar las URLs del portal de usuario de sus clientes.

source: This way, he can choose whether to configure one URL per Client (with custom domains, logos, theme and title) or sharing a global URL for all of them.
es: De esta manera, puede elegir si configurar una URL por cliente (con dominios personalizados, logos, tema y título) o compartir una URL global para todos ellos.

source: The section to do this is **Brand configuration > Portal URLs**.
es: La sección para hacer esto es **Configuración de marca > URLs del portal**.
