Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/friends/index.po
Languages: es

source: **Friends** section in the **Client configuration** allows interconnection of IvozProvider with other SIP PBX systems through a SIP *trunk*. The most typical use case is when a client have multiple PBX systems that want to integrate in a single flow.
es: La sección **Friends** en la **Configuración del cliente** permite la interconexión de IvozProvider con otros sistemas PBX SIP a través de un SIP *trunk*. El caso de uso más típico es cuando un cliente tiene múltiples sistemas PBX que quieren integrarse en un solo flujo.

source: Since 2.10, **Friends** also lets a vPBX client to call to extensions of another vPBX client in the same brand.
es: Desde la versión 2.10, **Friends** también permite a un cliente vPBX llamar a extensiones de otro cliente vPBX en la misma marca.

source: It's important to understand the difference between **Carrier** defined by the **brand operator** to connect with the public network and **Friends**, defined by **client administrators** to connect the system with other PBXs.
es: Es importante entender la diferencia entre **Carrier** definido por el **operador de la marca** para conectarse con la red pública y **Friends**, definido por los **administradores del cliente** para conectar el sistema con otros PBXs.

source: **Friends** are so similar to **Users** that both talk SIP with the :ref:`proxyusers`.
es: **Friends** son tan similares a **Usuarios** que ambos hablan SIP con el :ref:`proxyusers`.

source: Types of friends
es: Tipos de Friends

source: There are 2 main types of Friends:
es: Hay 2 tipos principales de Friends:

source: **Remote friends**: SIP trunks to external SIP PBX system.
es: **Friends remotos**: SIP trunks a sistemas PBX SIP externos.

source: **Internal friends**: connection between extensions of two vPBX client in the same brand.
es: **Friends internos**: conexión entre extensiones de dos clientes vPBX en la misma marca.

source: What kind of calls can be routed through an *internal friend*?
es: ¿Qué tipo de llamadas se pueden enrutar a través de un *friend interno*?

source: IvozProvider will route a call received by a :ref:`user <users>` or a :ref:`friend <friends>` following this logic:
es: IvozProvider enrutar una llamada recibida por un :ref:`usuario <users>` o un :ref:`friend <friends>` siguiendo esta lógica:

source: Destination matches an existing IvozProvider extension?
es: ¿El destino coincide con una extensión existente de IvozProvider?

source: If not: Destination matches any *friend* regular expression (for remote friends) or extensions (for internal ones)? Ordered by priority (lower has precedence).
es: Si no: ¿El destino coincide con alguna expresión regular de *friend* (para friends remotos) o extensiones (para los internos)? Ordenado por prioridad (el menor tiene precedencia).

source: If not: This is an external call.
es: Si no: Esta es una llamada externa.

source: Following sections explain both kind of friends:
es: Las siguientes secciones explican ambos tipos de friends:

source: Friend Call Forward
es: Desvío de llamadas de friends

source: The friend's call forward can be configured with the **List of call forward settings** button.
es: El desvío de llamadas del friend se puede configurar con el botón **Lista de configuraciones de desvío de llamadas**.

source: These are the fields and available values:
es: Estos son los campos y valores disponibles:

source: Call Type
es: Tipo de llamada

source: Determines if the forward must be applied to external, internal or any type of call.
es: Determina si el desvío debe aplicarse a llamadas externas, internas o cualquier tipo de llamada.

source: Forward type
es: Tipo de desvío

source: When this forward must be applied:
es: Cuándo debe aplicarse este desvío:

source: Unconditional: always
es: Incondicional: siempre

source: No answer: when the call is not answered in X seconds
es: Sin respuesta: cuando la llamada no se responde en X segundos

source: Busy: When the friend rejects an incoming call.
es: Ocupado: Cuando el friend rechaza una llamada entrante.

source: Not registered: when the friend is not registered against IvozProvider.
es: No registrado: cuando el friend no está registrado en IvozProvider.

source: Target type
es: Tipo de destino

source: What route will use the forwarded call.
es: Qué ruta usará la llamada desviada.

source: VoiceMail
es: Correo de voz

source: Number (external)
es: Número (externo)

source: Extension (internal)
es: Extensión (interna)

source: If we want to forward to other process, we can create an extension routed to that object and use the target type *Extension*.
es: Si queremos desviar a otro proceso, podemos crear una extensión enrutada a ese objeto y usar el tipo de destino *Extensión*.
