Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/friends/internal_friends.po
Languages: es

source: Internal friends
es: Friends internos

source: Internal friends allows a vPBX client to call to **Extensions** of another vPBX client in the same :ref:`Corporation <corporations>`.
es: Los friends internos permiten a un cliente vPBX llamar a **Extensiones** de otro cliente vPBX en la misma :ref:`Corporación <corporations>`.

source: Only extensions in :ref:`Extensions <extensions>` section.
es: Solo extensiones en la sección :ref:`Extensiones <extensions>`.

source: If calling to an extension in another vPBX causes an external call, it is allowed:
es: Si llamar a una extensión en otro vPBX causa una llamada externa, está permitido:

source: Calling to a user with an external call forwarding settings.
es: Llamar a un usuario con configuraciones de desvío de llamadas externas.

source: Calling to an extension routed to an external number.
es: Llamar a una extensión enrutada a un número externo.

source: Calling to an extension routed to a IVR with an option pointing an external number.
es: Llamar a una extensión enrutada a un IVR con una opción que apunte a un número externo.

source: What kind of calls can be routed through an *internal friend*?
es: ¿Qué tipo de llamadas se pueden enrutar a través de un *friend interno*?

source: IvozProvider will route any call matching an Extension in vpbx client connected by the internal friend.
es: IvozProvider enrutar cualquier llamada que coincida con una Extensión en el cliente vpbx conectado por el friend interno.

source: Configuration of internal friends
es: Configuración de friends internos

source: These are the configurable settings of *internal friends*:
es: Estos son los ajustes configurables de *friends internos*:

source: Description
es: Descripción

source: Optional. Extra information for this **friend**.
es: Opcional. Información adicional para este **friend**.

source: Priority
es: Prioridad

source: Used to solve conflicts while routing calls through **friends**. If a call destination **matches** more than one friend regular expression the call will be routed through the friend with **less priority value**.
es: Se utiliza para resolver conflictos al enrutar llamadas a través de **friends**. Si un destino de llamada **coincide** con más de una expresión regular de friend, la llamada se enruta a través del friend con **menor valor de prioridad**.

source: Connectivity mode
es: Modo de conectividad

source: Choose "IntervPBX" for internal friends.
es: Elija "IntervPBX" para friends internos.

source: Target Client
es: Cliente destino

source: vPBX client inside the same :ref:`corporation <corporations>` you want to connect.
es: Cliente vPBX dentro de la misma :ref:`corporación <corporations>` que desea conectar.

source: Fallback Outgoing DDI
es: DDI de salida alternativo

source: If called extension causes an external call, this DDI will be used as source number.
es: Si la extensión llamada causa una llamada externa, este DDI se utilizará como número de origen.

source: Always apply transformations
es: Aplicar siempre transformaciones

source: Numbers listed in Extensions section of both source and destination client will be considered as internal and won't traverse numeric transformation rules. Enable this setting to force Numeric Transformation rules even on these numbers.
es: Los números listados en la sección de Extensiones tanto del cliente de origen como de destino se considerarán internos y no atravesarán las reglas de transformación numérica. Habilite esta configuración para forzar las reglas de Transformación Numérica incluso en estos números.

source: Calls to *friends* are considered internal. That means that ACLs won't be checked when calling a friend, no matter if the origin of the call is a user or another friend.
es: Las llamadas a *friends* se consideran internas. Eso significa que no se verificarán las ACL al llamar a un friend, sin importar si el origen de la llamada es un usuario u otro friend.

source: Summary of internal friends
es: Resumen de friends internos

source: These are key points to understand *internal friends*:
es: Estos son puntos clave para entender los *friends internos*:

source: They have been designed to allow users from a vPBX to call to extensions (normally users) of another vPBX of the same :ref:`corporation <corporations>`.
es: Han sido diseñados para permitir que los usuarios de un vPBX llamen a extensiones (normalmente usuarios) de otro vPBX de la misma :ref:`corporación <corporations>`.

source: Usually they will allow user-user calls.
es: Normalmente permitirán llamadas de usuario a usuario.

source: You cannot use an internal friend to generate external calls paid by the other client.
es: No puede usar un friend interno para generar llamadas externas pagadas por el otro cliente.

source: But external calls may happen if extensions are pointed to external numbers (controlled external calls).
es: Pero pueden ocurrir llamadas externas si las extensiones están apuntadas a números externos (llamadas externas controladas).
