Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/friends/remote_friends.po
Languages: es

source: Remote friends
es: Friends remotos

source: Remote friends connect a vPBX client with an external SIP entity.
es: Los friends remotos conectan un cliente vPBX con una entidad SIP externa.

source: Types of remote friends
es: Tipos de friends remotos

source: There are 2 main types of SIP PBX that can be integrate with IvozProvider:
es: Hay 2 tipos principales de PBX SIP que se pueden integrar con IvozProvider:

source: **Direct connection PBX** (Connectivity mode: direct): IvozProvider must be able to talk SIP directly with this kind of friends by just redirecting the traffic to the proper port of the public IP address of the PBX.
es: **PBX de conexión directa** (Modo de conectividad: directo): IvozProvider debe poder hablar SIP directamente con este tipo de friends simplemente redirigiendo el tráfico al puerto adecuado de la dirección IP pública del PBX.

source: **PBX behind NAT** (Connectivity mode: register): Not directly accessible. This kind of PBX must register at IvozProvider (just like all the :ref:`Terminals <terminals>` do).
es: **PBX detrás de NAT** (Modo de conectividad: registrar): No accesible directamente. Este tipo de PBX debe registrarse en IvozProvider (al igual que todos los :ref:`Terminales <terminals>`).

source: What do remote friends allow?
es: ¿Qué permiten los friends remotos?

source: This section allows not just communication between users at boths ends of the SIP *trunk*, but also:
es: Esta sección permite no solo la comunicación entre usuarios en ambos extremos del SIP *trunk*, sino también:

source: Users "from the other side" can call to the public network just like native Ivozprovider :ref:`Users <users>`.
es: Los usuarios "del otro lado" pueden llamar a la red pública igual que los :ref:`Usuarios <users>` nativos de Ivozprovider.

source: Public network calls can be routed to the other SIP *trunk* end.
es: Las llamadas a la red pública pueden ser enrutadas al otro extremo del SIP *trunk*.

source: What kind of calls can be routed through a *remote friend*?
es: ¿Qué tipo de llamadas se pueden enrutar a través de un *friend remoto*?

source: IvozProvider must know what calls must be routed to the different defined *remote friends*. For that, **client administrator** will configure regular expressions that describe the numbers that *can be reached* through the **friend**.
es: IvozProvider debe saber qué llamadas deben ser enrutadas a los diferentes *friends remotos* definidos. Para eso, el **administrador del cliente** configurará expresiones regulares que describan los números que *se pueden alcanzar* a través del **friend**.

source: Internal :ref:`extensions <extensions>` have priority over any expression defined in the *friends*.
es: Las :ref:`extensiones <extensions>` internas tienen prioridad sobre cualquier expresión definida en los *friends*.

source: Avoid PCRE regular expressions in friend configuration: use [0-9] instead of \\d.
es: Evite las expresiones regulares PCRE en la configuración de friends: use [0-9] en lugar de \\d.

source: Configuration of remote friends
es: Configuración de friends remotos

source: The **Friend** configuration is a merge between a **User** and a **Terminal**
es: La configuración de **Friend** es una combinación entre un **Usuario** y un **Terminal**

source: These are the configurable settings of *friends*:
es: Estos son los ajustes configurables de los *friends*:

source: Name
es: Nombre

source: Name of the **friend**, like in **Terminals**. This will also be used in SIP messages (sent **From User**).
es: Nombre del **friend**, como en **Terminales**. Esto también se usará en mensajes SIP (enviados **Desde Usuario**).

source: Description
es: Descripción

source: Optional. Extra information for this **friend**.
es: Opcional. Información adicional para este **friend**.

source: Priority
es: Prioridad

source: Used to solve conflicts while routing calls through **friends**. If a call destination **matches** more than one friend regular expression the call will be routed through the friend with **less priority value**.
es: Se usa para resolver conflictos al enrutar llamadas a través de **friends**. Si un destino de llamada **coincide** con más de una expresión regular de friend, la llamada se enrutarán a través del friend con **menor valor de prioridad**.

source: Password
es: Contraseña

source: When the *friend* send requests, IvozProvider will authenticate it using this password. **Using password IS A MUST in "Register" mode**. In "Direct" mode, leaving it blank disables SIP authentication and enables IP source check.
es: Cuando el *friend* envía solicitudes, IvozProvider lo autentificará usando esta contraseña. **Usar contraseña ES OBLIGATORIO en modo "Registrar"**. En modo "Directo", dejarlo en blanco desactiva la autenticación SIP y habilita la verificación de la fuente IP.

source: Connectivity mode
es: Modo de conectividad

source: Choose between "Direct" and "Register" for a remote friend.
es: Elija entre "Directo" y "Registrar" para un friend remoto.

source: Call ACL
es: ACL de llamada

source: Similar to :ref:`internal users <users>`, friends can place internal client calls without restriction (including Extension or other Friends). When calling to external numbers, this ACL will be checked if set.
es: Similar a :ref:`usuarios internos <users>`, los friends pueden realizar llamadas internas del cliente sin restricciones (incluyendo Extensiones u otros Friends). Al llamar a números externos, se verificará esta ACL si está configurada.

source: Fallback Outgoing DDI
es: DDI de salida de respaldo

source: External calls from this *friend* will be presented with this DDI, **unless the source presented by friend is a DDI that exists in DDIs section**.
es: Las llamadas externas de este *friend* se presentarán con este DDI, **a menos que la fuente presentada por el friend sea un DDI que exista en la sección de DDIs**.

source: Country and Area code
es: Código de país y área

source: Used for number transformation from and to this friend.
es: Se usa para la transformación de números desde y hacia este friend.

source: Allowed codecs
es: Codecs permitidos

source: Like a terminal, *friends* will talk the selected codec.
es: Como un terminal, los *friends* hablarán el codec seleccionado.

source: From user
es: Desde usuario

source: Request from IvozProvider to this friend will include this user in the From header.
es: La solicitud de IvozProvider a este friend incluirá este usuario en el encabezado From.

source: From domain
es: Desde dominio

source: Request from IvozProvider to this friend will include this domain in the From header.
es: La solicitud de IvozProvider a este friend incluirá este dominio en el encabezado From.

source: DDI In
es: DDI entrante

source: If set to 'Yes', set destination (R-URI and To) to called DDI/number when calling to this endpoint. If set 'No', username used in Contact header of registration will be used, as specified in SIP RFC (friend name will be used for endpoints with direct connectivity). Defaults to 'Yes'.
es: Si se establece en 'Sí', establezca el destino (R-URI y To) al DDI/número llamado cuando se llame a este punto final. Si se establece en 'No', se usará el nombre de usuario utilizado en el encabezado Contact de registro, como se especifica en el RFC SIP (se usará el nombre del friend para puntos finales con conectividad directa). Por defecto es 'Sí'.

source: Enable T.38 passthrough
es: Habilitar paso a través de T.38

source: If set to 'yes', this SIP endpoint must be a **T.38 capable fax sender/receiver**. IvozProvider will act as a T.38 gateway, bridging fax-calls of a T.38 capable carrier and a T.38 capable device.
es: Si se establece en 'sí', este punto final SIP debe ser un **emisor/receptor de fax compatible con T.38**. IvozProvider actuará como una puerta de enlace T.38, conectando llamadas de fax de un operador compatible con T.38 y un dispositivo compatible con T.38.

source: Always apply transformations
es: Aplicar siempre transformaciones

source: Both numbers listed in Extensions section and numbers matching any friend regexp will be considered as internal and won't traverse numeric transformation rules. Enable this setting to force Numeric Transformation rules even on these numbers.
es: Tanto los números listados en la sección de Extensiones como los números que coincidan con cualquier expresión regular de friend se considerarán internos y no atravesarán las reglas de transformación numérica. Habilite esta configuración para forzar las reglas de Transformación Numérica incluso en estos números.

source: RTP Encryption
es: Encriptación RTP

source: If set to 'yes', call won't be established unless it's possible to encryption its audio. If set to 'no', audio won't be encrypted.
es: Si se establece en 'sí', la llamada no se establecerá a menos que sea posible encriptar su audio. Si se establece en 'no', el audio no se encriptará.

source: Multi Contact
es: Contacto múltiple

source: Same SIP credentials can be configured in multiple SIP devices. In that case, all devices ring simultaneously when receiving a call. Setting this toggle to 'No' limits this behaviour so that only latest registered SIP device rings.
es: Las mismas credenciales SIP se pueden configurar en múltiples dispositivos SIP. En ese caso, todos los dispositivos suenan simultáneamente al recibir una llamada. Configurar este interruptor en 'No' limita este comportamiento para que solo suene el último dispositivo SIP registrado.

source: Calls to *friends* are considered internal. That means that ACLs won't be checked when calling a friend, no matter if the origin of the call is a user or another friend.
es: Las llamadas a *friends* se consideran internas. Eso significa que no se verificarán las ACLs al llamar a un friend, sin importar si el origen de la llamada es un usuario u otro friend.

source: Friend can be contacted due to calls to several extensions/DDIs. *DDI In* setting allows remote SIP endpoint to know which number caused each call, setting that number as destination (R-URI and To headers). This way, friend can handle calls differently.
es: Se puede contactar al friend debido a llamadas a varias extensiones/DDIs. La configuración de *DDI entrante* permite al punto final SIP remoto saber qué número causó cada llamada, estableciendo ese número como destino (encabezados R-URI y To). De esta manera, el friend puede manejar las llamadas de manera diferente.

source: Asterisk as a remote friend
es: Asterisk como un friend remoto

source: At the other end of a friend can be any kind of SIP entity. This section takes as example an Asterisk PBX system using SIP channel driver that wants to connect to IvozProvider.
es: En el otro extremo de un friend puede haber cualquier tipo de entidad SIP. Esta sección toma como ejemplo un sistema PBX Asterisk que usa el controlador de canal SIP que desea conectarse a IvozProvider.

source: register
es: registrar

source: If the system can not be directly access, Asterisk will have to register in the platform (like a terminal will do).
es: Si el sistema no se puede acceder directamente, Asterisk tendrá que registrarse en la plataforma (como lo haría un terminal).

source: Configuration will be something like this:
es: La configuración será algo así:

source: peer
es: par

source: *Friends*, like terminals, MUST NOT challenge IvozProvider. That's why the *insecure* setting is used here.
es: *Los friends*, como los terminales, NO DEBEN desafiar a IvozProvider. Por eso se usa la configuración *insegura* aquí.

source: As From username is used to identify the friend, P-Asserted-Identity (or P-Preferred-Identity or Remote-Party-Id) must be used to specify caller number. Prevalence among these source headers is: PAI > PPI > RPID.
es: Dado que el nombre de usuario From se usa para identificar al friend, se debe usar P-Asserted-Identity (o P-Preferred-Identity o Remote-Party-Id) para especificar el número del llamante. La prevalencia entre estos encabezados de origen es: PAI > PPI > RPID.

source: Summary of remote friends
es: Resumen de friends remotos

source: The key point is understanding that a *remote friend* has a direct relation with the extension-user-terminal trio:
es: El punto clave es entender que un *friend remoto* tiene una relación directa con el trío extensión-usuario-terminal:

source: Can place calls to all internal extensions and other friends.
es: Puede realizar llamadas a todas las extensiones internas y otros friends.

source: Can place external calls that its ACL allows
es: Puede realizar llamadas externas que su ACL permita

source: Display their configured outgoing DDI when calling to external entities
es: Muestra su DDI de salida configurado al llamar a entidades externas

source: Never challenge IvozProvider requests (don't request authentication on received requests)
es: Nunca desafíe las solicitudes de IvozProvider (no solicite autenticación en solicitudes recibidas)

source: Answers IvozProvider authentication challenges (All request from them to IvozProvider must be authenticated for security reasons)
es: Responde a los desafíos de autenticación de IvozProvider (Todas las solicitudes de ellos a IvozProvider deben ser autenticadas por razones de seguridad)

source: Only connects with *Users SIP Proxy*, like terminals. In fact, SIP traffic from friends are identical to any other user terminal traffic in format.
es: Solo se conecta con *Proxy SIP de Usuarios*, como terminales. De hecho, el tráfico SIP de friends es idéntico al tráfico de cualquier otro terminal de usuario en formato.
