Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/infrastructure/application_server_sets.po
Languages: es

source: Application Server Sets
es: Sets de Servidores de Aplicación

source: The Application Server Sets section allows platform administators to manage sets of application servers by adding, deleting, and editing them.
es: La sección de Sets de Servidores de Aplicación permite a los administradores de la plataforma gestionar conjuntos de servidores de aplicación añadiéndolos, eliminándolos y editándolos.

source: Name
es: Nombre

source: The name of the Application Server Set.
es: El nombre del Set de Servidores de Aplicación.

source: Distribute Method
es: Método de Distribución

source: **Hash**: Distributes calls hashing a parameter that is unique per client.
es: **Hash**: Distribuye las llamadas haciendo hash de un parámetro que es único por cliente.

source: **Round robin**: Distributes calls equally between Application Servers.
es: **Round robin**: Distribuye las llamadas equitativamente entre los Servidores de Aplicación.

source: Description:
es: Descripción:

source: A brief description of the Application Server Set.
es: Una breve descripción del Set de Servidores de Aplicación.

source: Application Servers:
es: Servidores de Aplicación:

source: A multi-select list with one or more application servers.
es: Una lista de selección múltiple con uno o más servidores de aplicación.
