Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/infrastructure/proxy_trunks.po
Languages: es

source: Proxy Trunks
es: Proxies de Salida

source: This is the SIP proxy exposed to external world and is in charge of connecting with providers (carriers / DDI providers) brand administrators will configure for *SIP peering*.
es: Este es el proxy SIP expuesto al mundo exterior y se encarga de conectar con proveedores (operadores / proveedores de DDI) que los administradores de marca configurarán para *SIP peering*.

source: Only the IP addresses will be listed, as the port will be always 5060 (5061 for SIP over TLS).
es: Solo se enumerarán las direcciones IP, ya que el puerto siempre será 5060 (5061 para SIP sobre TLS).

source: Main address
es: Dirección principal

source: The value displayed in the entry **proxytrunks** will show the IP address entered during the installation process.
es: El valor mostrado en la entrada **proxytrunks** mostrará la dirección IP ingresada durante el proceso de instalación.

source: This entry cannot be removed.
es: Esta entrada no se puede eliminar.

source: This IP address:
es: Esta dirección IP:

source: Will be used for internal signalling:
es: Se utilizará para la señalización interna:

source: KamTrunks <-> Application Servers
es: KamTrunks <-> Servidores de Aplicación

source: Will be used to reload Kamailio modules when needed (XMLRPC).
es: Se utilizará para recargar los módulos de Kamailio cuando sea necesario (XMLRPC).

source: This value can be changed from the portal, but Kamailio make sure that KamTrunks is binded to given IP.
es: Este valor se puede cambiar desde el portal, pero Kamailio se asegura de que KamTrunks esté vinculado a la dirección IP dada.

source: Additional addresses
es: Direcciones adicionales

source: Apart from unremovable **proxytrunks** entry, additional addresses can be added here. These additional addresses can be removed as long as they are not assigned to any Carrier / DDI Provider.
es: Además de la entrada **proxytrunks** no removible, se pueden agregar direcciones adicionales aquí. Estas direcciones adicionales se pueden eliminar siempre que no estén asignadas a ningún Operador / Proveedor de DDI.

source: Apart from adding here, addresses must be configured in */etc/kamailio/proxytrunks/additional_addresses.cfg* (*additional_addresses.cfg.in* is given as an example). Make sure Kamailio can bind to given addresses, otherwise it won't boot.
es: Además de agregarlas aquí, las direcciones deben configurarse en */etc/kamailio/proxytrunks/additional_addresses.cfg* (*additional_addresses.cfg.in* se proporciona como ejemplo). Asegúrese de que Kamailio pueda vincularse a las direcciones dadas, de lo contrario no se iniciará.

source: The purpose of these additional addresses is to talk to different Providers using different addresses:
es: El propósito de estas direcciones adicionales es comunicarse con diferentes Proveedores utilizando diferentes direcciones:

source: Main operator (*God*) will assign IP addresses listed in this section to Brands (read :ref:`Brands`).
es: El operador principal (*God*) asignará las direcciones IP enumeradas en esta sección a las Marcas (leer :ref:`Marcas <Brands>`).

source: Each brand must have at least one address.
es: Cada marca debe tener al menos una dirección.

source: Each address can be assigned in several brands.
es: Cada dirección se puede asignar en varias marcas.

source: Brand operator will assign these addresses to Carriers (read :ref:`Carriers`) and DDI Providers (read :ref:`DDI Providers`).
es: El operador de marca asignará estas direcciones a los Operadores (leer :ref:`Operadores <Carriers>`) y Proveedores de DDI (leer :ref:`Proveedores de DDI <DDI Providers>`).

source: Each Provider (both Carriers and DDI Providers) must have one address.
es: Cada Proveedor (tanto Operadores como Proveedores de DDI) debe tener una dirección.

source: IvozProvider will use assigned addresses in SIP signalling with those Carriers / DDI Providers.
es: IvozProvider utilizará las direcciones asignadas en la señalización SIP con esos Operadores / Proveedores de DDI.

source: Be aware that it only applies to SIP signalling, no changes are made in RTP media handling.
es: Tenga en cuenta que solo se aplica a la señalización SIP, no se realizan cambios en el manejo de medios RTP.
