Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/active_calls.po
Languages: es

source: Active calls
es: Llamadas activas

source: This section allows main operator and brand operator view **current active external calls**.
es: Esta sección permite al operador principal y al operador de marca ver **llamadas externas activas actuales**.

source: Internal calls won't be listed.
es: Las llamadas internas no se enumerarán.

source: These are columns shown:
es: Estas son las columnas mostradas:

source: Duration
es: Duración

source: Show call establishment duration during establishment and call duration during ongoing call. It also shows direction (inbound/outbound) and call state information, as explained below.
es: Muestra la duración del establecimiento de la llamada durante el establecimiento y la duración de la llamada durante la llamada en curso. También muestra la dirección (entrante/saliente) y la información del estado de la llamada, como se explica a continuación.

source: Brand
es: Marca

source: Brand making a given call (only shown at god level).
es: Marca que realiza una llamada dada (solo se muestra a nivel principal).

source: Client
es: Cliente

source: Client making a given call.
es: Cliente que realiza una llamada dada.

source: Caller
es: Llamante

source: Call source number in E.164.
es: Número de origen de la llamada en E.164.

source: Callee
es: Llamado

source: Call destination number in E.164.
es: Número de destino de la llamada en E.164.

source: Carrier
es: Operador

source: Carrier/DDI Provider used in given call.
es: Operador/Proveedor de DDI utilizado en una llamada dada.

source: Call state
es: Estado de la llamada

source: Call state follows `Dialog State Machine proposed in RFC4235 <https://tools.ietf.org/html/rfc4235#section-3.7.1>`_:
es: El estado de la llamada sigue la `Máquina de Estado de Diálogo propuesta en RFC4235 <https://tools.ietf.org/html/rfc4235#section-3.7.1>`_:

source: **Trying**
es: **Intentando**

source: INVITE sent, someone is trying to make a new call.
es: INVITE enviado, alguien está intentando hacer una nueva llamada.

source: Shown as *Call Setup* in this section.
es: Mostrado como *Configuración de Llamada* en esta sección.

source: **Proceeding**
es: **En proceso**

source: Provisional response from middle proxies received (usually 100 Trying).
es: Respuesta provisional de los proxies intermedios recibida (generalmente 100 Trying).

source: This state is ignored in this section.
es: Este estado se ignora en esta sección.

source: **Early**
es: **Temprano**

source: Provisional response from final party received (usually 180 Ringing).
es: Respuesta provisional de la parte final recibida (generalmente 180 Ringing).

source: Shown as *Ringing* in this section.
es: Mostrado como *Sonando* en esta sección.

source: **Confirmed**
es: **Confirmado**

source: 200 OK received, call confirmed, parties talking.
es: 200 OK recibido, llamada confirmada, partes hablando.

source: Shown as *In call* in this section.
es: Mostrado como *En llamada* en esta sección.

source: **Terminated**
es: **Terminada**

source: BYE/CANCEL/error-response (>300) received, call finished.
es: BYE/CANCEL/respuesta de error (>300) recibida, llamada terminada.

source: Call vanishes to show this status.
es: La llamada desaparece para mostrar este estado.

source: Example 1: Successful call
es: Ejemplo 1: Llamada exitosa

source: A successful call traverses this states:
es: Una llamada exitosa atraviesa estos estados:

source: Trying -> Proceeding (optional) -> Early (optional) -> Confirmed -> Terminated
es: Intentando -> En proceso (opcional) -> Temprano (opcional) -> Confirmado -> Terminada

source: That will be coded in this section as:
es: Eso se codificará en esta sección como:

source: Call Setup -> Ringing (optional) -> In call -> Call vanishes
es: Configuración de Llamada -> Sonando (opcional) -> En llamada -> La llamada desaparece

source: Example 2: Unsuccessful call
es: Ejemplo 2: Llamada no exitosa

source: An unsuccessful call traverses this states:
es: Una llamada no exitosa atraviesa estos estados:

source: Trying -> Proceeding (optional) -> Early (optional) -> Terminated
es: Intentando -> En proceso (opcional) -> Temprano (opcional) -> Terminada

source: That will be show in this section as:
es: Eso se mostrará en esta sección como:

source: Call Setup -> Ringing (optional) -> Call vanishes
es: Configuración de Llamada -> Sonando (opcional) -> La llamada desaparece
