Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/brands.po
Languages: es

source: Brands
es: Marcas

source: *God operator* is responsible for creating and managing platform brands through this section.
es: El *operador principal* es responsable de crear y gestionar las marcas de la plataforma a través de esta sección.

source: This are the fields shown when a new brand is created:
es: Estos son los campos que se muestran cuando se crea una nueva marca:

source: Name
es: Nombre

source: Sets the name for this brand.
es: Establece el nombre para esta marca.

source: TIN
es: NIF

source: Number used in this brand's invoices.
es: Número utilizado en las facturas de esta marca.

source: Used as default logo in invoices and in portals (if they don't specify another logo).
es: Utilizado como logo predeterminado en facturas y en portales (si no especifican otro logo).

source: Invoice data
es: Datos Facturación

source: Data included in invoices created by this brand.
es: Datos incluidos en las facturas creadas por esta marca.

source: SIP domain
es: Dominio SIP

source: Introduced in 1.4. Domain pointing to Users SIP proxy used by all the Retail Accounts and Residential Devices of this brand.
es: Introducido en 1.4. Dominio que apunta al proxy SIP de Usuarios utilizado por todas las Cuentas Retail y Dispositivos Residenciales de esta marca.

source: Recordings
es: Grabaciones

source: Configures a limit for the size of recordings of this brand. A notification is sent to configured address when 80% is reached and older recordings are rotated when configured size is reached.
es: Configura un límite para el tamaño de las grabaciones de esta marca. Se envía una notificación a la dirección configurada cuando se alcanza el 80% y las grabaciones más antiguas se rotan cuando se alcanza el tamaño configurado.

source: Features
es: Funcionalidades

source: Introduced in 1.3, lets god operator choose the features of the created brand. An equivalent configuration is available in Clients, to choose between the ones that god operator gave to your Brand. Related sections are hidden consequently.
es: Introducido en 1.3, permite al operador principal elegir las funcionalidades de la marca creada. Una configuración equivalente está disponible en Clientes, para elegir entre las que el operador principal dio a su Marca. Las secciones relacionadas se ocultan en consecuencia.

source: Max calls
es: Límite llamadas

source: Limits both user generated and **external** received calls to this value (0 for unlimited).
es: Limita tanto las llamadas generadas por el usuario como las recibidas **externas** a este valor (0 para ilimitado).

source: Locales
es: Localización

source: Define default Timezone, Language and Currency for clients of this brand.
es: Define la Zona Horaria, Idioma y Divisa predeterminados para los clientes de esta marca.

source: Notifications
es: Notificaciones

source: Configure the email :ref:`notification templates` to use for this brand. Clients configured to use generic notifications will use configured brand notifications. If brand has no notification configured :ref:`default notification templates` will be used.
es: Configure las :ref:`plantillas de notificación <notification templates>` de correo electrónico para usar en esta marca. Los clientes configurados para usar notificaciones genéricas usarán las notificaciones configuradas de la marca. Si la marca no tiene notificaciones configuradas, se usarán las :ref:`plantillas de notificación por defecto <default notification templates>`.

source: Select which ProxyTrunks addresses can be used by this brand. Read :ref:`Proxy Trunks` for further details. It is not possible to unassign an address used in any :ref:`carrier <Carriers>` or :ref:`DDI provider <DDI Providers>`.
es: Seleccione qué direcciones de ProxyTrunks pueden ser utilizadas por esta marca. Lea :ref:`Proxy Trunks <Proxy Trunks>` para más detalles. No es posible desasignar una dirección utilizada en cualquier :ref:`operador <Carriers>` o :ref:`proveedor de DDI <DDI Providers>`.

source: Some features are related to brand and cannot be assigned to clients. Other ones are also related to clients and lets the brand operator to assign them to its clients.
es: Algunas funcionalidades están relacionadas con la marca y no pueden ser asignadas a los clientes. Otras también están relacionadas con los clientes y permiten al operador de la marca asignarlas a sus clientes.

source: Disabling billing hides all related sections and assumes that an external element will set a price for calls (external tarification module is needed, ask for it!).
es: Deshabilitar la facturación oculta todas las secciones relacionadas y asume que un elemento externo establecerá un precio para las llamadas (se necesita un módulo de tarificación externo, ¡pregunte por él!).

source: Disabling invoices hides related sections, assuming you will use an external tool to generate them.
es: Deshabilitar las facturas oculta las secciones relacionadas, asumiendo que utilizará una herramienta externa para generarlas.

source: SIP domain is only visible for Brands with Retail or Residential features enabled.
es: El dominio SIP solo es visible para las Marcas con funcionalidades Retail o Residenciales habilitadas.

source: Brand operators
es: Operadores de Marca

source: **List of brand operators** subsection allows adding/editing/deleting credentials for brand portal access.
es: La subsección **Listado de operadores de marca** permite añadir/editar/eliminar credenciales para el acceso al portal de la marca.

source: Read :ref:`acls` for further explanation about restricted brand administrators.
es: Lea :ref:`acls <acls>` para más información sobre administradores de marca restringidos.

source: Brand Portals
es: Portales de Marca

source: **List of brand portals** subsection allows managing URLs to access to the different web portals available for a given brand.
es: La subsección **Listado de portales de marca** permite gestionar las URLs para acceder a los diferentes portales web disponibles para una marca dada.

source: See :ref:`Client Portals` for further reference.
es: Vea :ref:`Portales de Clientes <Client Portals>` para más información.

source: URLs are assigned to brands. This means that through a given URL the brand can be guessed, but not the client. As a result, username collision domain will be at brand level (there cannot exist to client administrators with the same username within a brand).
es: Las URLs se asignan a las marcas. Esto significa que a través de una URL dada se puede adivinar la marca, pero no el cliente. Como resultado, el dominio de colisión de nombres de usuario estará a nivel de marca (no pueden existir dos administradores de clientes con el mismo nombre de usuario dentro de una marca).
