Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/currencies.po
Languages: es

source: Currencies
es: Divisas

source: This section allows adding as many currencies as wanted. It is a multilanguage field with a symbol that will be used in invoices, balance movements, etc.
es: Esta sección permite añadir tantas divisas como se desee. Es un campo multilingüe con un símbolo que se utilizará en facturas, movimientos de saldo, etc.

source: These IvozProvider elements have an assigned currency:
es: Estos elementos de IvozProvider tienen una divisa asignada:

source: Brand
es: Marca

source: Used as default currency for all underlying items that have currency.
es: Utilizado como divisa predeterminada para todos los elementos subyacentes que tienen divisa.

source: Client
es: Cliente

source: Chosen currency will be used in price calculation, invoices, invoice's fixed costs, balance movements and remaining money operations of this client.
es: La divisa elegida se utilizará en el cálculo de precios, facturas, costos fijos de la factura, movimientos de saldo y operaciones de dinero restantes de este cliente.

source: Carrier
es: Operador

source: Chosen currency will be used in cost calculation, balance movements and remaining money operations of this carrier.
es: La divisa elegida se utilizará en el cálculo de costos, movimientos de saldo y operaciones de dinero restantes de este operador.

source: Destination rate
es: Tarifa de destino

source: All rates within a destination rate will assume this currency.
es: Todas las tarifas dentro de una tarifa de destino asumirán esta divisa.

source: Rating plan
es: Plan de precios

source: All destination rates grouped in a rating plan **must** use this currency.
es: Todas las tarifas de destino agrupadas en un plan de precios **deben** usar esta divisa.

source: It is important to take into account notes below before using this feature:
es: Es importante tener en cuenta las notas a continuación antes de usar esta función:

source: Rating plans **must** only group destination rates using its currency.
es: Los planes de precios **deben** agrupar solo tarifas de destino que usen su divisa.

source: Clients and carriers **must** only use rating plans using its currency.
es: Los clientes y operadores **deben** usar solo planes de precios que usen su divisa.

source: Some backend checks avoid some of previous misconfigurations, but not all of them: **use this feature carefully**.
es: Algunas verificaciones en el backend evitan algunas de las configuraciones incorrectas anteriores, pero no todas: **use esta función con cuidado**.

source: **There is no currency conversion involved**: call cost will be calculated in carrier's currency, call price will be calculated in client's currency.
es: **No hay conversión de divisas involucrada**: el costo de la llamada se calculará en la divisa del operador, el precio de la llamada se calculará en la divisa del cliente.

source: LCR routes involving carriers with different currencies are not supported.
es: Las rutas LCR que involucran operadores con diferentes divisas no son compatibles.
