Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/external_calls.po
Languages: es

source: External calls
es: Llamadas externas

source: **External calls** section lists **both inbound and outbound external calls**.
es: La sección **Llamadas externas** enumera **tanto las llamadas externas entrantes como las salientes**.

source: This section is shown at different levels:
es: Esta sección se muestra en diferentes niveles:

source: Main level (god level)
es: Nivel principal (nivel principal)

source: Brand level (filtered for emulated/logged brand).
es: Nivel de marca (filtrado para marca emulada/registrada).

source: Client level (filtered for emulated/logged client).
es: Nivel de cliente (filtrado para cliente emulado/registrado).

source: Each entry shows this information:
es: Cada entrada muestra esta información:

source: Start time
es: Tiempo de inicio

source: Date and time of the call establishment.
es: Fecha y hora del establecimiento de la llamada.

source: Brand
es: Marca

source: Only visible for *god*, shows the brand of each call.
es: Solo visible para *principal*, muestra la marca de cada llamada.

source: Client
es: Cliente

source: Visible for *god* and *brand operator*, shows the client of each call.
es: Visible para *principal* y *operador de marca*, muestra el cliente de cada llamada.

source: Caller
es: Llamante

source: DDI presented for the outgoing call.
es: DDI presentado para la llamada saliente.

source: Callee
es: Llamado

source: External number dialed.
es: Número externo marcado.

source: Duration
es: Duración

source: Shows how long the call lasted.
es: Muestra cuánto duró la llamada.

source: Price
es: Precio

source: The money amount for the client. Visible for *god* and *brand operator* and *Client administrator* if *Display billing details to client* is enabled.
es: El monto de dinero para el cliente. Visible para *principal* y *operador de marca* y *administrador del cliente* si *Mostrar detalles de facturación al cliente* está habilitado.

source: Cost
es: Coste

source: Visible for *god* and *brand operator*, the money amount for the brand (the money that the carrier will bill for the call).
es: Visible para *principal* y *operador de marca*, el monto de dinero para la marca (el dinero que el operador facturará por la llamada).

source: Rating Plan
es: Plan de precios

source: Rating plan used to set price for the call. Visible for *god* and *brand operator* and *Client administrator* if *Display billing details to client* is enabled.
es: Plan de precios utilizado para establecer el precio de la llamada. Visible para *principal* y *operador de marca* y *administrador del cliente* si *Mostrar detalles de facturación al cliente* está habilitado.

source: Destination
es: Destino

source: Destination that matched the call for billing. Visible for *god* and *brand operator* and *Client administrator* if *Display billing details to client* is enabled.
es: Destino que coincidió con la llamada para la facturación. Visible para *principal* y *operador de marca* y *administrador del cliente* si *Mostrar detalles de facturación al cliente* está habilitado.

source: Carrier
es: Operador

source: Visible for *god* and *brand operator*, shows which :ref:`Carrier <carriers>` was used for each outbound call.
es: Visible para *principal* y *operador de marca*, muestra qué :ref:`Operador <carriers>` se utilizó para cada llamada saliente.

source: DDI Provider
es: Proveedor DDI

source: Visible for *god* and *brand operator*, shows which :ref:`DDI Provider <DDI Providers>` was used for each inbound call.
es: Visible para *principal* y *operador de marca*, muestra qué :ref:`Proveedor DDI <DDI Providers>` se utilizó para cada llamada entrante.

source: Invoice
es: Factura

source: Visible for *god* and *brand operator*, shows if a call is already included in any :ref:`Invoice <invoices>`.
es: Visible para *principal* y *operador de marca*, muestra si una llamada ya está incluida en alguna :ref:`Factura <invoices>`.

source: Call ID
es: ID de llamada

source: Shows the call ID of the call for troubleshooting and CSV export.
es: Muestra el ID de la llamada para la resolución de problemas y exportación CSV.

source: Endpoint Type
es: Tipo de Endpoint

source: Possible values: RetailAccount, ResidentialDevice, User, Fax, Friend.
es: Valores posibles: RetailAccount, ResidentialDevice, User, Fax, Friend.

source: Endpoint Id
es: ID de Endpoint

source: Internal ID of specific endpoint (only when *endpointType* is non-empty).
es: ID interno del endpoint específico (solo cuando *endpointType* no está vacío).

source: Endpoint Name
es: Nombre de Endpoint

source: User extension, friend name, fax name, retail account name or residential device name (only when *endpointId* is non-empty).
es: Extensión de usuario, nombre de amigo, nombre de fax, nombre de cuenta retail o nombre de dispositivo residencial (solo cuando *endpointId* no está vacío).

source: An asynchronous process parses each external call and adds it to this list a few minutes after call hangup. Billing related fields, such as cost and price, will be empty for external incoming calls.
es: Un proceso asíncrono analiza cada llamada externa y la añade a esta lista unos minutos después de colgar la llamada. Los campos relacionados con la facturación, como el coste y el precio, estarán vacíos para las llamadas entrantes externas.

source: Call rerating
es: Recalificación de llamada

source: At **brand level**, there is an additional available operation for outbound calls: **Rerate call**. This option allows calling rating engine again for a call or a bunch of calls.
es: A nivel de **marca**, hay una operación adicional disponible para llamadas salientes: **Recalificar llamada**. Esta opción permite llamar al motor de calificación nuevamente para una llamada o un grupo de llamadas.

source: Notes about this rerating process:
es: Notas sobre este proceso de recalificación:

source: If a call is in an invoice, it cannot be rerated. Invoice must be deleted first.
es: Si una llamada está en una factura, no se puede recalificar. La factura debe ser eliminada primero.

source: Call will be rerated with the *Start time* of the call (no with current active rating plans, but with active rating plans on the moment of the call).
es: La llamada será recalificada con el *Tiempo de inicio* de la llamada (no con los planes de calificación activos actuales, sino con los planes de calificación activos en el momento de la llamada).

source: Both *Price* and *Cost* will be recalculated. This may imply updating *rating plan* and *destination* too.
es: Tanto el *Precio* como el *Coste* serán recalculados. Esto puede implicar actualizar el *plan de precios* y el *destino* también.

source: When a call is rerated, cost and price are emptied until the next iteration of the asynchronous task.
es: Cuando una llamada es recalificada, el coste y el precio se vacían hasta la siguiente iteración de la tarea asíncrona.
