Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/global_special_numbers.po
Languages: es

source: Global Special Numbers
es: Números Especiales Globales

source: This section allows adding external numbers that will be handled in a different way by IvozProvider when a client calls to those destinations (**only for external outgoing calls**).
es: Esta sección permite añadir números externos que serán manejados de una manera diferente por IvozProvider cuando un cliente llame a esos destinos (**solo para llamadas externas salientes**).

source: Numbers listed here will apply in every brand. Brand operator may add numbers too using :ref:`Special Numbers`.
es: Los números enumerados aquí se aplicarán en cada marca. El operador de marca también puede añadir números utilizando :ref:`Números Especiales <Special Numbers>`.

source: Disable CDR
es: Deshabilitar CDR

source: Currently there is only one special treatment: **Disable CDR**. Setting this to *Yes* for a number will:
es: Actualmente solo hay un tratamiento especial: **Deshabilitar CDR**. Configurar esto en *Sí* para un número:

source: Prevent outgoing external calls from being listed in following sections:
es: Evitar que las llamadas externas salientes se enumeren en las siguientes secciones:

source: *Active Calls*
es: *Llamadas Activas*

source: *External Calls*
es: *Llamadas Externas*

source: *Call Registry* (both client portal and user portal)
es: *Registro de Llamadas* (tanto en el portal del cliente como en el portal del usuario)

source: As a consequence, calls won't be included in any:
es: Como consecuencia, las llamadas no se incluirán en ningún:

source: :ref:`Invoices`
es: :ref:`Facturas <Invoices>`

source: CSV defined by :ref:`Call CSV schedulers`
es: CSV definido por :ref:`Programadores de CSV de Llamadas <Call CSV schedulers>`

source: API response of related endpoints
es: Respuesta de la API de los endpoints relacionados

source: Do not call CGRateS for these calls: call will be allowed no matter if active pricing plan allows it.
es: No llame a CGRateS para estas llamadas: la llamada será permitida sin importar si el plan de precios activo lo permite.

source: As a consequence, no price/cost will be decreased from carrier/client account.
es: Como consecuencia, no se disminuirá el precio/coste de la cuenta del operador/cliente.

source: Prevent recording these calls. As a consequence, *Recordings* section won't list them.
es: Evitar grabar estas llamadas. Como consecuencia, la sección *Grabaciones* no las enumerará.

source: Adding a number will cause this special handling **only for future outgoing external calls**. No change is made in previous calls.
es: Añadir un número causará este manejo especial **solo para futuras llamadas externas salientes**. No se realizan cambios en llamadas anteriores.
