Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/main_operators.po
Languages: es

source: Main operators
es: Operadores de Plataforma

source: This section lists the credentials to log into the god administration portal. You can edit or delete existing credentials, and create new ones.
es: Esta sección enumera las credenciales para iniciar sesión en el portal de administración principal. Puede editar o eliminar credenciales existentes y crear nuevas.

source: These are the required fields of each entry:
es: Estos son los campos requeridos de cada entrada:

source: Username
es: Nombre de usuario

source: User for login process.
es: Usuario para el proceso de inicio de sesión.

source: Password
es: Contraseña

source: Password for login process.
es: Contraseña para el proceso de inicio de sesión.

source: Timezone
es: Zona Horaria

source: Used for showing dates in External Calls and similar sections.
es: Utilizado para mostrar fechas en Llamadas Externas y secciones similares.

source: Restricted
es: Restringido

source: Allows creating limited credentials (read :ref:`acls` for further explanation).
es: Permite crear credenciales limitadas (lea :ref:`acls <acls>` para más información).

source: Remaining fields are not required nor used anywhere, they just allow storing additional information of a given user (name, lastname and email).
es: Los campos restantes no son requeridos ni utilizados en ningún lugar, solo permiten almacenar información adicional de un usuario dado (nombre, apellido y correo electrónico).
