Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/services.po
Languages: es

source: Services
es: Servicios

source: There are **special services** that can be accessed by calling to some codes **from the terminal**.
es: Hay **servicios especiales** a los que se puede acceder llamando a algunos códigos **desde el terminal**.

source: Services defined in this section **are not accessible during a conversation**. They are activated by **calling the codes**, not using DTMF codes while talking.
es: Los servicios definidos en esta sección **no son accesibles durante una conversación**. Se activan **llamando a los códigos**, no usando códigos DTMF mientras se habla.

source: There are the following **special services** available in the section **Global configuration** > **Services**:
es: Hay los siguientes **servicios especiales** disponibles en la sección **Configuración global** > **Servicios**:

source: Direct pickup
es: Captura directa

source: This service allows capturing a ringing call from another terminal by calling the code followed by the extension from the target user.
es: Este servicio permite capturar una llamada entrante desde otro terminal llamando al código seguido de la extensión del usuario objetivo.

source: Group pickup
es: Captura de grupo

source: This service allows capturing a ringing call for any terminal whose user is part of one of the capturer pickup groups.
es: Este servicio permite capturar una llamada entrante para cualquier terminal cuyo usuario sea parte de uno de los grupos de captura.

source: Check voicemail
es: Consultar buzón de voz

source: This service allows checking the user's voicemail using an interactive menu from which new voicemails can be listen, deleted, etc. This is an active alternative to receive voicemails via the email. Since 1.4, this service allows optional extension after the service code to check another users voicemails. Users can protect their voicemail using the internal menu options.
es: Este servicio permite consultar el buzón de voz del usuario utilizando un menú interactivo desde el cual se pueden escuchar, eliminar, etc. los nuevos mensajes de voz. Esta es una alternativa activa para recibir mensajes de voz por correo electrónico. Desde la versión 1.4, este servicio permite una extensión opcional después del código de servicio para consultar los mensajes de voz de otros usuarios. Los usuarios pueden proteger su buzón de voz utilizando las opciones del menú interno.

source: Record locution
es: Grabar locución

source: This service allows any user to record their client's locutions by dialing an special code. Voice instructions will be provided in the user's language.
es: Este servicio permite a cualquier usuario grabar las locuciones de sus clientes marcando un código especial. Se proporcionarán instrucciones de voz en el idioma del usuario.

source: Open Lock
es: Abrir bloqueo

source: Calling this service code will set route lock status to 'Opened' (see :ref:`route_locks`).
es: Llamar a este código de servicio establecerá el estado del bloqueo de ruta en 'Abierto' (ver :ref:`bloqueos de ruta <route_locks>`).

source: Close Lock
es: Cerrar bloqueo

source: Calling this service code will set route lock status to 'Closed' (see :ref:`route_locks`).
es: Llamar a este código de servicio establecerá el estado del bloqueo de ruta en 'Cerrado' (ver :ref:`bloqueos de ruta <route_locks>`).

source: Toggle Lock
es: Alternar bloqueo

source: Calling this service code will change the current status of the lock (see :ref:`route_locks`).
es: Llamar a este código de servicio cambiará el estado actual del bloqueo (ver :ref:`bloqueos de ruta <route_locks>`).

source: Inconditional call forward
es: Desvío incondicional de llamadas

source: Calling this service code will change the current status of inconditional call forward (only available for residential clients, see :ref:`Residential device call forward settings <residential_devices_cfw>`).
es: Llamar a este código de servicio cambiará el estado actual del desvío incondicional de llamadas (solo disponible para clientes residenciales, ver :ref:`Configuración de desvío de llamadas de dispositivos residenciales <residential_devices_cfw>`).

source: Busy call forward
es: Desvío de llamadas por ocupado

source: Calling this service code will change the current status of busy call forward (only available for residential clients, see :ref:`Residential device call forward settings <residential_devices_cfw>`).
es: Llamar a este código de servicio cambiará el estado actual del desvío de llamadas por ocupado (solo disponible para clientes residenciales, ver :ref:`Configuración de desvío de llamadas de dispositivos residenciales <residential_devices_cfw>`).

source: No answer call forward
es: Desvío de llamadas por no respuesta

source: Calling this service code will change the current status of no answer call forward (only available for residential clients, see :ref:`Residential device call forward settings <residential_devices_cfw>`).
es: Llamar a este código de servicio cambiará el estado actual del desvío de llamadas por no respuesta (solo disponible para clientes residenciales, ver :ref:`Configuración de desvío de llamadas de dispositivos residenciales <residential_devices_cfw>`).

source: Unreachable call forward
es: Desvío de llamadas por inalcanzable

source: Calling this service code will change the current status of no answer call forward (only available for residential clients, see :ref:`Residential device call forward settings <residential_devices_cfw>`).it di
es: Llamar a este código de servicio cambiará el estado actual del desvío de llamadas por inalcanzable (solo disponible para clientes residenciales, ver :ref:`Configuración de desvío de llamadas de dispositivos residenciales <residential_devices_cfw>`).

source: As soon as new services are implemented into IvozProvider, they will be listed in this section.
es: Tan pronto como se implementen nuevos servicios en IvozProvider, se enumerarán en esta sección.

source: This section lists the available services and the default codes when a **new brand** is created.
es: Esta sección enumera los servicios disponibles y los códigos predeterminados cuando se crea una **nueva marca**.

source: Changing the default code in this section will only affect new created brands.
es: Cambiar el código predeterminado en esta sección solo afectará a las nuevas marcas creadas.
