Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/sip_domains.po
Languages: es

source: SIP domains
es: Dominios SIP

source: The section **Domains** will display the SIP domains that point to :ref:`ProxyUsers` public address.
es: La sección **Dominios** mostrará los dominios SIP que apuntan a la dirección pública de :ref:`ProxyUsers <ProxyUsers>`.

source: DNS register can be type A (supported by all the hardphones/softphones ) or even NAPTR+SRV.
es: El registro DNS puede ser de tipo A (soportado por todos los teléfonos físicos/softphones) o incluso NAPTR+SRV.

source: There are two type of SIP domains:
es: Hay dos tipos de dominios SIP:

source: vPBX client SIP domain
es: Dominio SIP del cliente vPBX

source: Each vPBX client has a unique SIP domain.
es: Cada cliente vPBX tiene un dominio SIP único.

source: Brand SIP domain
es: Dominio SIP de la marca

source: Shared by all retail and residential clients in the brand.
es: Compartido por todos los clientes retail y residenciales de la marca.

source: All these SIP domains will be displayed in this list so that global administrator can check what domains are registered for each client/brand:
es: Todos estos dominios SIP se mostrarán en esta lista para que el administrador global pueda verificar qué dominios están registrados para cada cliente/marca:

source: Domain
es: Dominio

source: DNS pointing to :ref:`ProxyUsers` public address
es: DNS apuntando a la dirección pública de :ref:`ProxyUsers <ProxyUsers>`

source: Brand
es: Marca

source: Brand of specific brand domain or vPBX client.
es: Marca del dominio de marca específico o cliente vPBX.

source: Client
es: Cliente

source: vPBX client of specific vPBX client domain. Empty for brand domains.
es: Cliente vPBX del dominio vPBX específico. Vacío para dominios de marca.
