Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/platform/terminal_manufacturers.po
Languages: es

source: Terminal manufacturers
es: Fabricantes de Terminales

source: Overview
es: Descripción general

source: IvozProvider supports provisioning of terminals via HTTP/HTTPS that fulfill the following requirements:
es: IvozProvider soporta la provisión de terminales vía HTTP/HTTPS que cumplen con los siguientes requisitos:

source: Assuming a just unboxed terminal, just plugged and connected to the network:
es: Asumiendo un terminal recién desempaquetado, recién conectado y conectado a la red:

source: Ask IP address via DHCP.
es: Solicitar dirección IP vía DHCP.

source: DCHP has enabled the option 66 that points to the platform portal
es: DHCP ha habilitado la opción 66 que apunta al portal de la plataforma

source: The first requested provisioning file is a static file (different for each model) prefixed with the previous step URL.
es: El primer archivo de provisión solicitado es un archivo estático (diferente para cada modelo) con el prefijo de la URL del paso anterior.

source: The served file can redefine the URL for further requests
es: El archivo servido puede redefinir la URL para solicitudes adicionales

source: Any terminal model that can adapt to this provisioning way can be added into the section **Platform Configuration > Terminal manufacturers**.
es: Cualquier modelo de terminal que pueda adaptarse a esta forma de provisión puede añadirse en la sección **Configuración de la Plataforma > Fabricantes de Terminales**.

source: Example Cisco SPA504G
es: Ejemplo Cisco SPA504G

source: Cisco SPA504G is turned on and requests an IP address to DHCP
es: Cisco SPA504G se enciende y solicita una dirección IP a DHCP

source: Receives “http://provision.example.com/provision” as DHCP option 66
es: Recibe “http://provision.example.com/provision” como opción 66 de DHCP

source: Request HTTP configuration from http://provision.example.com/provision/spa504g.cfg
es: Solicitar configuración HTTP desde http://provision.example.com/provision/spa504g.cfg

source: All 504G request the same file (spa504.cfg), prefixed with the given URL
es: Todos los 504G solicitan el mismo archivo (spa504.cfg), con el prefijo de la URL dada

source: This file only contain basic configuration settings for the model and the URL for the next request (p.e. https://provision.example.com/provision/$MAC.cfg)
es: Este archivo solo contiene configuraciones básicas para el modelo y la URL para la siguiente solicitud (p.e. https://provision.example.com/provision/$MAC.cfg)

source: This way, each terminal (MAC should be unique) request a specific file (and different) after the generic one has been served.
es: De esta manera, cada terminal (MAC debe ser único) solicita un archivo específico (y diferente) después de que se haya servido el genérico.

source: This file will contain the specific configuration for the terminal:
es: Este archivo contendrá la configuración específica para el terminal:

source: User
es: Usuario

source: Password
es: Contraseña

source: SIP Domain
es: Dominio SIP

source: IvozProvider provisioning system, right now, only has one goal: provide credentials and language settings for the terminals.
es: El sistema de provisión de IvozProvider, en este momento, solo tiene un objetivo: proporcionar credenciales y configuraciones de idioma para los terminales.

source: Configuration of supported models
es: Configuración de modelos soportados

source: IvozProvider uses a template system that allows global operator (God) to define new models and configure what files will be served.
es: IvozProvider utiliza un sistema de plantillas que permite al operador global (God) definir nuevos modelos y configurar qué archivos se servirán.

source: The help section of **Terminal manufacturers** has examples for some models that work (in the moment of writting this) with IvozProvider provisioning system.
es: La sección de ayuda de **Fabricantes de Terminales** tiene ejemplos para algunos modelos que funcionan (en el momento de escribir esto) con el sistema de provisión de IvozProvider.

source: These models will be available after the initial installation, but you must edit them and load the default configuration before you can use the provisioning system (option **Restore default template**).
es: Estos modelos estarán disponibles después de la instalación inicial, pero debe editarlos y cargar la configuración predeterminada antes de poder usar el sistema de provisión (opción **Restaurar plantilla por defecto**).

source: UACs firmware changes may cause that given examples stop working. We will try to keep templates updated, but we can't guarantee this point.
es: Los cambios en el firmware de los UAC pueden hacer que los ejemplos dados dejen de funcionar. Intentaremos mantener las plantillas actualizadas, pero no podemos garantizar este punto.

source: Analyzing the suggested templates you can have a basic idea of the flexibility of the system to configure any existing terminal model in the market and to adapt them to eventual changes in given examples.
es: Analizando las plantillas sugeridas puede tener una idea básica de la flexibilidad del sistema para configurar cualquier modelo de terminal existente en el mercado y adaptarlos a cambios eventuales en los ejemplos dados.

source: Getting technical
es: Aspectos técnicos

source: Imagine an environment with this configuration:
es: Imagine un entorno con esta configuración:

source: Provisioning URLs:
es: URLs de provisión:

source: Generic file: http://PROV_IP/provision
es: Archivo genérico: http://PROV_IP/provision

source: Specific file: https://PROV_IP:PROV_PORT/provision
es: Archivo específico: https://PROV_IP:PROV_PORT/provision

source: Which requested URLs will be valid?
es: ¿Qué URLs solicitadas serán válidas?

source: For generic file, just one: http://PROV_IP/provision/y000000000044.cfg
es: Para el archivo genérico, solo una: http://PROV_IP/provision/y000000000044.cfg

source: For specific file, requests are right as long as this rules are fulfilled:
es: Para el archivo específico, las solicitudes son correctas siempre que se cumplan estas reglas:

source: All HTTP requests are wrong.
es: Todas las solicitudes HTTP son incorrectas.

source: HTTPS requests to 443 are wrong (PROV_PORT must be used).
es: Las solicitudes HTTPS al 443 son incorrectas (se debe usar PROV_PORT).

source: Subpaths after provisioning URL are ignored, both in request and in specificUrlPattern.
es: Los subrutas después de la URL de provisión se ignoran, tanto en la solicitud como en specificUrlPattern.

source: On specific file request, extension must match as long as extension is used in specificUrlPattern.
es: En la solicitud de archivo específico, la extensión debe coincidir siempre que se use la extensión en specificUrlPattern.

source: On specific file request, the filename must match exactly once {mac} is replaced.
es: En la solicitud de archivo específico, el nombre del archivo debe coincidir exactamente una vez que se reemplace {mac}.

source: MAC address is case insensitive and can contain colons or not (':').
es: La dirección MAC no distingue entre mayúsculas y minúsculas y puede contener dos puntos o no (':').

source: Let's analyze the examples below to understand this rules better:
es: Analicemos los ejemplos a continuación para entender mejor estas reglas:

source: Example 1 - TerminalModels.specificUrlPattern: {mac}.cfg
es: Ejemplo 1 - TerminalModels.specificUrlPattern: {mac}.cfg

source: Working requests:
es: Solicitudes correctas:

source: Wrong requests:
es: Solicitudes incorrectas:

source: This example is identical to 't23/{mac}.cfg', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/{mac}.cfg', ya que se ignoran las subrutas.

source: Example 2 - TerminalModels.specificUrlPattern: {mac}
es: Ejemplo 2 - TerminalModels.specificUrlPattern: {mac}

source: All previous examples are ok, as extension is ignored if no extension is found in specificUrlPattern.
es: Todos los ejemplos anteriores son correctos, ya que se ignora la extensión si no se encuentra ninguna extensión en specificUrlPattern.

source: This example is identical to 't23/{mac}', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/{mac}', ya que se ignoran las subrutas.

source: Example 3 - TerminalModels.specificUrlPattern: yea-{mac}.cfg
es: Ejemplo 3 - TerminalModels.specificUrlPattern: yea-{mac}.cfg

source: All previous examples are wrong, as no 'yea-' is found ('yea' match is case sensitive).
es: Todos los ejemplos anteriores son incorrectos, ya que no se encuentra 'yea-' (la coincidencia de 'yea' distingue entre mayúsculas y minúsculas).

source: This example is identical to 't23/yea-{mac}.cfg', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/yea-{mac}.cfg', ya que se ignoran las subrutas.

source: Example 4 - TerminalModels.specificUrlPattern: yea-{mac}
es: Ejemplo 4 - TerminalModels.specificUrlPattern: yea-{mac}

source: As no extension is given:
es: Como no se da ninguna extensión:

source: This example is identical to 't23/yea-{mac}', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/yea-{mac}', ya que se ignoran las subrutas.
