Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/providers/carriers.po
Languages: es

source: Carriers are used for placing external outgoing calls.
es: Los carriers se utilizan para realizar llamadas salientes externas.

source: This are the fields that define a carrier:
es: Estos son los campos que definen un carrier:

source: Some fields described below may not be visible depending on enabled features.
es: Algunos campos descritos a continuación pueden no ser visibles dependiendo de las funcionalidades habilitadas.

source: Name
es: Nombre

source: Used to reference this Carrier.
es: Usado para referenciar este Carrier.

source: Description
es: Descripción

source: Optional field with any required extra information.
es: Campo opcional con cualquier información adicional requerida.

source: Numeric Transformation
es: Transformación Numérica

source: Transformation that will be applied to the origin and destination of the outgoing numbers that use this Carrier (see :ref:`Numeric transformations`).
es: Transformación que se aplicará al origen y destino de los números salientes que usan este Carrier (ver :ref:`Transformaciones numéricas <Numeric transformations>`).

source: Calculate cost
es: Calcular costo

source: If set, IvozProvider will calculate the cost of the call using the carrier's active rating profile.
es: Si se establece, IvozProvider calculará el costo de la llamada utilizando el perfil de calificación activo del carrier.

source: Currency
es: Moneda

source: Chosen currency will be used in cost calculation, balance movements and remaining money operations of this carrier.
es: La moneda elegida se utilizará en el cálculo de costos, movimientos de saldo y operaciones de dinero restantes de este carrier.

source: Local socket
es: Socket local

source: Selected address will be used as source address for signalling with this carrier. Brand operator can choose among addresses assigned by main operator via :ref:`Brands`. Read :ref:`Proxy Trunks` for further details.
es: La dirección seleccionada se usará como dirección de origen para la señalización con este carrier. El operador de la marca puede elegir entre las direcciones asignadas por el operador principal a través de :ref:`Marcas <Brands>`. Lea :ref:`Troncos Proxy <Proxy Trunks>` para más detalles.

source: Media relay set
es: Conjunto de retransmisión de medios

source: Media-relays can be grouped in sets to reserve capacities or on a geographical purpose. Selected set will be used in calls through this specific carrier. This field in only seen by Global administrator (aka God).
es: Los retransmisores de medios se pueden agrupar en conjuntos para reservar capacidades o con un propósito geográfico. El conjunto seleccionado se usará en llamadas a través de este carrier específico. Este campo solo lo ve el administrador global (también conocido como Dios).

source: Status
es: Estado

source: Non-responding carrier servers are inactivated until they respond to OPTIONS ping request. This icon is green if every carrier server of given carrier is active, red if they are all inactive and yellow if just some of them are inactive.
es: Los servidores de carrier que no responden se desactivan hasta que respondan a la solicitud de ping OPTIONS. Este icono es verde si todos los servidores de carrier de un carrier dado están activos, rojo si todos están inactivos y amarillo si solo algunos de ellos están inactivos.

source: If you want carrier-side media handled by the same mediarelay set than client-side, select "Client's default".
es: Si desea que los medios del lado del carrier sean manejados por el mismo conjunto de retransmisión de medios que el lado del cliente, seleccione "Predeterminado del cliente".

source: Cost calculation
es: Cálculo de costos

source: If *Calculate cost* is enabled, *Rating plans* can be linked to carriers for cost calculation (see :ref:`Assigning rating plans to carriers`) and a balance is attached to each carrier. Whenever a carrier is used for placing a call, this balance will be decreased using carrier's active rating profile.
es: Si *Calcular costo* está habilitado, *Planes de calificación* se pueden vincular a los carriers para el cálculo de costos (ver :ref:`Asignar planes de calificación a carriers <Assigning rating plans to carriers>`) y un saldo está adjunto a cada carrier. Cada vez que se use un carrier para realizar una llamada, este saldo se reducirá utilizando el perfil de calificación activo del carrier.

source: Besides:
es: Además:

source: Carrier balance can be increased/decreased with *Balance operations*.
es: El saldo del carrier se puede aumentar/disminuir con *Operaciones de saldo*.

source: These operations are listed in *List of Balances movements*.
es: Estas operaciones se enumeran en *Lista de movimientos de saldo*.

source: *Balance notifications* can be configured to be notified when balance reaches a given threshold.
es: *Notificaciones de saldo* se pueden configurar para ser notificadas cuando el saldo alcance un umbral dado.

source: Contrary to clients' balances, **carriers' (negative/zero) balances won't disable the carrier**.
es: Contrario a los saldos de los clientes, **los saldos (negativos/cero) de los carriers no deshabilitarán el carrier**.

source: Carrier Servers
es: Servidores de carrier

source: A **Carrier Server** is a SIP server associated to an IP Provider. Carrier servers are used for placing outgoing calls by using :ref:`Outgoing routings`.
es: Un **Servidor de carrier** es un servidor SIP asociado a un proveedor de IP. Los servidores de carrier se utilizan para realizar llamadas salientes utilizando :ref:`Rutas salientes <Outgoing routings>`.

source: SIP Proxy
es: Proxy SIP

source: IP address (or DNS registry) of the Carrier Server. You can also specify a port if it's different from 5060.
es: Dirección IP (o registro DNS) del servidor de carrier. También puede especificar un puerto si es diferente de 5060.

source: Outbound Proxy
es: Proxy de salida

source: Usually this is left empty. It can be filled with the IP address of the **SIP Proxy** domain (to avoid DNS resolution, but keeping the domain in the SIP messages). It works like a web proxy: instead of sending the SIP messages to destination **SIP Proxy**, they will be sent to the IP:PORT of this field.
es: Generalmente esto se deja vacío. Se puede llenar con la dirección IP del dominio del **Proxy SIP** (para evitar la resolución DNS, pero manteniendo el dominio en los mensajes SIP). Funciona como un proxy web: en lugar de enviar los mensajes SIP al **Proxy SIP** de destino, se enviarán a la IP:PUERTO de este campo.

source: URI Scheme
es: Esquema URI

source: Supported schemes are sip and sips. Use 'sip' in case of doubt.
es: Los esquemas compatibles son sip y sips. Use 'sip' en caso de duda.

source: Transport
es: Transporte

source: Supported transport protocols. Use 'udp' in case of doubt.
es: Protocolos de transporte compatibles. Use 'udp' en caso de duda.

source: Requires Authentication
es: Requiere autenticación

source: Some Carriers validate our platform by IP, others require each session that we want to establish. For this last case, this section allows to configure user and password for this authentication.
es: Algunos carriers validan nuestra plataforma por IP, otros requieren cada sesión que queremos establecer. Para este último caso, esta sección permite configurar usuario y contraseña para esta autenticación.

source: Call Origin Header
es: Encabezado de origen de llamada

source: Some Providers get origin from SIP From header. Others use the From header for accounting and need extra headers to identify the origin. In case of doubt leave **PAI** checked.
es: Algunos proveedores obtienen el origen del encabezado SIP From. Otros usan el encabezado From para la contabilidad y necesitan encabezados adicionales para identificar el origen. En caso de duda, deje **PAI** marcado.

source: From header customization
es: Personalización del encabezado From

source: For those providers that show origin in other headers (PAI/RPID), it is possible that request that From User have the account code being used and from domain their SIP domain. In case of doubt, leave empty.
es: Para aquellos proveedores que muestran el origen en otros encabezados (PAI/RPID), es posible que soliciten que el usuario From tenga el código de cuenta que se está utilizando y del dominio su dominio SIP. En caso de duda, deje vacío.

source: Non-responding carrier servers are inactivated until they respond to a OPTIONS ping request. This icon shows if carrier server is active or inactive (and being pinged via OPTIONS message until gets back).
es: Los servidores de carrier que no responden se desactivan hasta que respondan a una solicitud de ping OPTIONS. Este icono muestra si el servidor de carrier está activo o inactivo (y se le envía un ping a través de un mensaje OPTIONS hasta que vuelva).

source: There are many fields to establish *peering* with multiple kind of carriers, but usually with the name and SIP Proxy will be enough (for those that validate our platform by IP) and Authentication (for those that won't).
es: Hay muchos campos para establecer *peering* con múltiples tipos de carriers, pero generalmente con el nombre y el Proxy SIP será suficiente (para aquellos que validan nuestra plataforma por IP) y Autenticación (para aquellos que no lo hacen).

source: In case of defining multiple Carrier Servers for a single Carrier, IvozProvider will balance and failover using all of them. Like with Application Servers, it will disable those who doesn't respond to our requests.
es: En caso de definir múltiples servidores de carrier para un solo carrier, IvozProvider equilibrará y conmutará por error utilizando todos ellos. Al igual que con los servidores de aplicaciones, deshabilitará aquellos que no respondan a nuestras solicitudes.

source: List of external calls
es: Lista de llamadas externas

source: You can see external calls placed through a given carrier using this option. You will see the same fields as in :ref:`External calls` but filtered for the chosen carrier.
es: Puede ver las llamadas externas realizadas a través de un carrier dado utilizando esta opción. Verá los mismos campos que en :ref:`Llamadas externas <External calls>` pero filtrados para el carrier elegido.

source: It is compulsory to have **a valid brand URL** in order to use *Export to CSV* feature in this subsection.
es: Es obligatorio tener **una URL de marca válida** para utilizar la función *Exportar a CSV* en esta subsección.
