Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/providers/ddi_providers.po
Languages: es

source: DDI Providers
es: Proveedores DDI

source: DDI Providers are the SIP entities that will contact the platform when someone calls to one of our client's DDIs.
es: Los proveedores DDI son las entidades SIP que contactarán con la plataforma cuando alguien llame a uno de los DDIs de nuestros clientes.

source: This are the fields that define a carrier:
es: Estos son los campos que definen un carrier:

source: Some fields described below may not be visible depending on enabled features.
es: Algunos campos descritos a continuación pueden no ser visibles dependiendo de las funcionalidades habilitadas.

source: Name
es: Nombre

source: Used to reference this Carrier.
es: Usado para referenciar este Carrier.

source: Description
es: Descripción

source: Optional field with any required extra information.
es: Campo opcional con cualquier información adicional requerida.

source: Numeric Transformation
es: Transformación Numérica

source: Transformation that will be applied to the origin and destination of the outgoing numbers that use this Carrier (see :ref:`Numeric transformations`).
es: Transformación que se aplicará al origen y destino de los números salientes que usan este Carrier (ver :ref:`Transformaciones numéricas <Numeric transformations>`).

source: Local socket
es: Socket local

source: Selected address will be used as source address for signalling with this DDI provider. Brand operator can choose among addresses assigned by main operator via :ref:`Brands`. Read :ref:`Proxy Trunks` for further details.
es: La dirección seleccionada se usará como dirección de origen para la señalización con este proveedor DDI. El operador de la marca puede elegir entre las direcciones asignadas por el operador principal a través de :ref:`Marcas <Brands>`. Lea :ref:`Troncos Proxy <Proxy Trunks>` para más detalles.

source: Media relay set
es: Conjunto de retransmisión de medios

source: Media-relays can be grouped in sets to reserve capacities or on a geographical purpose. Selected set will be used in calls through this specific DDI Provider. This field in only seen by Global administrator (aka God).
es: Los retransmisores de medios se pueden agrupar en conjuntos para reservar capacidades o con un propósito geográfico. El conjunto seleccionado se usará en llamadas a través de este proveedor DDI específico. Este campo solo lo ve el administrador global (también conocido como Dios).

source: If you want carrier-side media handled by the same mediarelay set than client-side, select "Client's default".
es: Si desea que los medios del lado del carrier sean manejados por el mismo conjunto de retransmisión de medios que el lado del cliente, seleccione "Predeterminado del cliente".

source: DDI Provider Addresses
es: Direcciones del proveedor DDI

source: The platform will recognize a DDI provider comparing SIP message's source address with the addresses in this list:
es: La plataforma reconocerá un proveedor DDI comparando la dirección de origen del mensaje SIP con las direcciones en esta lista:

source: IP address
es: Dirección IP

source: Once the DDI provider is recognized, its numeric transformations will be applied and the DDI will be searched.
es: Una vez que se reconozca el proveedor DDI, se aplicarán sus transformaciones numéricas y se buscará el DDI.

source: DDI Provider Registrations
es: Registros del proveedor DDI

source: Some DDI providers require a `SIP Register <https://tools.ietf.org/html/rfc3261#section-10>`_ active in order to receive incoming calls to our DDIs. Some of them, even require this register in order to process our outgoing calls through their services.
es: Algunos proveedores DDI requieren un `Registro SIP <https://tools.ietf.org/html/rfc3261#section-10>`_ activo para recibir llamadas entrantes a nuestros DDIs. Algunos de ellos, incluso requieren este registro para procesar nuestras llamadas salientes a través de sus servicios.

source: IvozProvider supports any kind of *peering*, but we highly recommend *peer to peer peerings*: without authentication, without registry and validated by IP. This will avoid unnecessary traffic (authentication in each session and periodic registers) and simplifies its configuration, leaving this list empty.
es: IvozProvider admite cualquier tipo de *peering*, pero recomendamos encarecidamente *peer to peer peerings*: sin autenticación, sin registro y validado por IP. Esto evitará tráfico innecesario (autenticación en cada sesión y registros periódicos) y simplifica su configuración, dejando esta lista vacía.

source: To define a registration, these fields are shown:
es: Para definir un registro, se muestran estos campos:

source: Username
es: Nombre de usuario

source: Account number or similar provider by the provider that requires SIP register.
es: Número de cuenta o similar proporcionado por el proveedor que requiere registro SIP.

source: Domain
es: Dominio

source: Domain or IP of the registrar server. Usually the same as the SIP proxy of the Peer server.
es: Dominio o IP del servidor de registro. Generalmente el mismo que el proxy SIP del servidor Peer.

source: Password
es: Contraseña

source: Password used in auth process.
es: Contraseña utilizada en el proceso de autenticación.

source: Random contact Username
es: Nombre de usuario de contacto aleatorio

source: If set, no contact username will be needed as a random string will be used. The DDI Provider is supposed to use the called DDI in the R-URI instead of this random string.
es: Si se establece, no se necesitará un nombre de usuario de contacto ya que se usará una cadena aleatoria. Se supone que el proveedor DDI usará el DDI llamado en el R-URI en lugar de esta cadena aleatoria.

source: Contact username
es: Nombre de usuario de contacto

source: This will be used in REGISTER message Contact header, making DDI provider to contact us with this in the R-URI.
es: Esto se usará en el encabezado de contacto del mensaje REGISTER, haciendo que el proveedor DDI nos contacte con esto en el R-URI.

source: Auth username
es: Nombre de usuario de autenticación

source: Authentication user. Most of the time it's the same as username, so it's recommended to leave empty.
es: Usuario de autenticación. La mayoría de las veces es el mismo que el nombre de usuario, por lo que se recomienda dejarlo vacío.

source: Register server URI
es: URI del servidor de registro

source: Usually this can be left empty, as it can be obtained from the Domain. If it is not the case, enter the IP address with the 'sip:' prefix.
es: Generalmente esto se puede dejar vacío, ya que se puede obtener del Dominio. Si no es el caso, ingrese la dirección IP con el prefijo 'sip:'.

source: Realm
es: Reino

source: Leave empty to accept the authentication realm proposed by the provider. Define only if you are familiar to the authentication mechanism used in SIP.
es: Deje vacío para aceptar el reino de autenticación propuesto por el proveedor. Defina solo si está familiarizado con el mecanismo de autenticación utilizado en SIP.

source: Expire
es: Expirar

source: Default suggested register expire time.
es: Tiempo de expiración de registro sugerido por defecto.

source: Similar to the Carrier Servers, there are lots of fields in the screen. You must have into account that most of the providers don't require register, and those who do, will only use user, domain and password.
es: Similar a los servidores Carrier, hay muchos campos en la pantalla. Debe tener en cuenta que la mayoría de los proveedores no requieren registro, y aquellos que lo hacen, solo usarán usuario, dominio y contraseña.
