Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/retail/calls/active_calls.po
Languages: es

source: Active calls
es: Llamadas activas

source: This section allows client administrator view **current active calls**.
es: Esta sección permite al administrador del cliente ver **llamadas activas actuales**.

source: **Calls involving any user, friend, retail account, residential device or wholesale client will be shown**, no matter they are internal or external.
es: **Se mostrarán las llamadas que involucren a cualquier usuario, friend, cuenta retail, dispositivo residencial o cliente wholesale**, sin importar si son internas o externas.

source: These are columns shown:
es: Estas son las columnas mostradas:

source: Duration
es: Duración

source: Show call establishment duration during establishment and call duration during ongoing call. It also shows direction (inbound/outbound) and call state information, as explained :ref:`here <Call state>`.
es: Muestra la duración del establecimiento de la llamada durante el establecimiento y la duración de la llamada durante la llamada en curso. También muestra la dirección (entrante/saliente) y la información del estado de la llamada, como se explica :ref:`aquí <Call state>`.

source: Owner
es: Propietario

source: User, friend, retail account, residential device or wholesale client involved in given call.
es: Usuario, friend, cuenta retail, dispositivo residencial o cliente wholesale involucrado en la llamada dada.

source: Party
es: Parte

source: Remaining participant of given call. It gets updated to show current party (in transfers and diverted calls).
es: Participante restante de la llamada dada. Se actualiza para mostrar la parte actual (en transferencias y llamadas desviadas).

source: There will be one entry per entity involved. This means that a standard internal call will be shown in two different rows: one outbound call for calling user and one inbound call for called user.
es: Habrá una entrada por entidad involucrada. Esto significa que una llamada interna estándar se mostrará en dos filas diferentes: una llamada saliente para el usuario que llama y una llamada entrante para el usuario llamado.
