Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basic_concepts/installation/cd_install.po
Languages: es

source: Automatic ISO CD image
es: Imagen ISO CD automática

source: You can download one of the `IvozProvider Automatic ISO CD images <https://github.com/irontec/ivozprovider>`_ (generated using `simplecdd <https://wiki.debian.org/Simple-CDD>`_) in stable or nightly versions:
es: Puede descargar una de las `imágenes ISO CD automáticas de IvozProvider <https://github.com/irontec/ivozprovider>`_ (generadas usando `simplecdd <https://wiki.debian.org/Simple-CDD>`_) en versiones estables o nocturnas:

source: IMPORTANT: Automatic install CDs will format target machine disk!
es: IMPORTANTE: ¡Los CDs de instalación automática formatearán el disco de la máquina de destino!

source: Configure the target machine to boot from CD. It will display the Debian GNU/Linux installation menu.
es: Configure la máquina de destino para que arranque desde el CD. Mostrará el menú de instalación de Debian GNU/Linux.

source: You can use graphic installation if you prefer, but the following screenshots show the standard installation.
es: Puede usar la instalación gráfica si lo prefiere, pero las siguientes capturas de pantalla muestran la instalación estándar.

source: Choose installation language:
es: Elija el idioma de instalación:

source: Choose location:
es: Elija la ubicación:

source: Set root password
es: Establecer contraseña de root

source: Choose date and time configuration:
es: Elija la configuración de fecha y hora:

source: At this point, a generic network configuration and disk partitioning will be performed, and also a installation of base system.
es: En este punto, se realizará una configuración de red genérica y particionamiento de disco, y también una instalación del sistema base.

source: Setup MySQL Server root password
es: Configurar la contraseña de root del servidor MySQL

source: MySQL password must be set in this screen and again in the following Ivozprovider configuration menu. If you leave this field empty, the default password will be used (see below).
es: La contraseña de MySQL debe establecerse en esta pantalla y nuevamente en el siguiente menú de configuración de Ivozprovider. Si deja este campo vacío, se utilizará la contraseña predeterminada (ver más abajo).

source: Configure IvozProvider:
es: Configurar IvozProvider:

source: As mentioned in :ref:`Minimum requirements` is required at least one public IP address for User and Trunk SIP proxies. Remember that if you use only one, KamTrunks will use different SIP ports to avoid collision.
es: Como se menciona en :ref:`Requisitos mínimos`, se requiere al menos una dirección IP pública para los proxies SIP de Usuario y Trunk. Recuerde que si usa solo una, KamTrunks utilizará diferentes puertos SIP para evitar colisiones.

source: You can set its addresses right now and configure the interfaces properly when the system is fully installed. This menu can be displayed anytime after the installation.
es: Puede establecer sus direcciones ahora y configurar las interfaces correctamente cuando el sistema esté completamente instalado. Este menú puede mostrarse en cualquier momento después de la instalación.

source: You can also configure default root MySQL password right now.
es: También puede configurar la contraseña de root de MySQL predeterminada ahora.

source: If you don't configure MySQL password, default password will be used (changeme). You can still change it later.
es: Si no configura la contraseña de MySQL, se utilizará la contraseña predeterminada (changeme). Aún puede cambiarla más tarde.

source: And default language for portals:
es: Y el idioma predeterminado para los portales:

source: It is not require to configure all settings during initial installation. In case any setting has been left without configuration a warning dialog will be displayed.
es: No es necesario configurar todos los ajustes durante la instalación inicial. En caso de que algún ajuste haya quedado sin configurar, se mostrará un cuadro de diálogo de advertencia.

source: At last, select where the GRUB boot loader will be installed.
es: Por último, seleccione dónde se instalará el cargador de arranque GRUB.

source: After the reboot, you are ready to access using the web portals!
es: ¡Después del reinicio, estará listo para acceder utilizando los portales web!

source: Any of the public IP addresses configured during the installation will work to access the web portal. Default credentials are **admin / changeme**.
es: Cualquiera de las direcciones IP públicas configuradas durante la instalación funcionará para acceder al portal web. Las credenciales predeterminadas son **admin / changeme**.
