Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basic_concepts/installation/debian_install.po
Languages: es

source: Debian packages install
es: Instalación de paquetes Debian

source: IvozProvider is designed to be installed and updated using Debian packages. More exactly, the current release is ready to be installed on `Debian Bookworm 12 <https://www.debian.org/releases/bookworm>`_.
es: IvozProvider está diseñado para ser instalado y actualizado utilizando paquetes Debian. Más exactamente, la versión actual está lista para ser instalada en `Debian Bookworm 12 <https://www.debian.org/releases/bookworm>`_.

source: It's recommended to use one of the `official installation guides <https://www.debian.org/releases/bookworm/installmanual>`_ to install the minimum base system. The rest of required dependencies will be installed automatically with IvozProvider meta packages.
es: Se recomienda utilizar una de las `guías de instalación oficiales <https://www.debian.org/releases/bookworm/installmanual>`_ para instalar el sistema base mínimo. El resto de las dependencias requeridas se instalarán automáticamente con los metapaquetes de IvozProvider.

source: No matter if you are installing a :ref:`StandAlone install` or a :ref:`Distributed install`, it's required to configure Irontec debian repositories.
es: No importa si está instalando una :ref:`instalación StandAlone` o una :ref:`instalación distribuida`, es necesario configurar los repositorios debian de Irontec.

source: APT Repository configuration
es: Configuración del repositorio APT

source: Optionally, we can add the repository key to check signed packages:
es: Opcionalmente, podemos agregar la clave del repositorio para verificar los paquetes firmados:

source: Installing profile package
es: Instalación del paquete de perfil

source: Once the repositories are configured, it will be required to select the proper metapackage depending on the type of installation.
es: Una vez configurados los repositorios, será necesario seleccionar el metapaquete adecuado según el tipo de instalación.

source: For a :ref:`StandAlone install`:
es: Para una :ref:`instalación StandAlone`:

source: For a :ref:`Distributed install`: one of the profile packages depending on the role the machine will perform.
es: Para una :ref:`instalación distribuida`: uno de los paquetes de perfil dependiendo del rol que desempeñará la máquina.

source: Distributed installation require a couple manual configuration based on the roles that are performing. Take into account that distributed installation process is not documented yet. You can refer to `documentation request <https://github.com/irontec/ivozprovider/issues/271>`_ for more information.
es: La instalación distribuida requiere un par de configuraciones manuales basadas en los roles que están desempeñando. Tenga en cuenta que el proceso de instalación distribuida aún no está documentado. Puede consultar la `solicitud de documentación <https://github.com/irontec/ivozprovider/issues/271>`_ para obtener más información.

source: Finish the installation
es: Terminar la instalación

source: Standalone installation have a menu that can be used to configure the basic services used in IvozProvider. Most of the services are automatically configured to work in the same machine with the default values.
es: La instalación StandAlone tiene un menú que se puede usar para configurar los servicios básicos utilizados en IvozProvider. La mayoría de los servicios se configuran automáticamente para funcionar en la misma máquina con los valores predeterminados.

source: This menu allows:
es: Este menú permite:

source: Configure IP address(es) for SIP proxies
es: Configurar dirección(es) IP para proxies SIP

source: Default platform language
es: Idioma predeterminado de la plataforma

source: Administrator MySQL database password
es: Contraseña de la base de datos MySQL del administrador

source: It's possible to change any of this values anytime by running:
es: Es posible cambiar cualquiera de estos valores en cualquier momento ejecutando:

source: Any of the public IP addresses configured during the installation will work to access the web portal. Default credentials are **admin / changeme**.
es: Cualquiera de las direcciones IP públicas configuradas durante la instalación funcionará para acceder al portal web. Las credenciales predeterminadas son **admin / changeme**.

source: You must reboot your machine after a package installation in order to start all required services.
es: Debe reiniciar su máquina después de una instalación de paquetes para iniciar todos los servicios requeridos.
