Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basic_concepts/installation/requirements.po
Languages: es

source: Minimum requirements
es: Requisitos mínimos

source: System requirements
es: Requisitos del sistema

source: IvozProvider is designed to be installed using Debian GNU/Linux APT package system.
es: IvozProvider está diseñado para ser instalado utilizando el sistema de paquetes APT de Debian GNU/Linux.

source: It's recommended to install IvozProvider in a dedicated server for the platform. Many of the installed software may not work properly with other pre-installed services (like MySQL or DNS servers).
es: Se recomienda instalar IvozProvider en un servidor dedicado para la plataforma. Muchos de los programas instalados pueden no funcionar correctamente con otros servicios preinstalados (como servidores MySQL o DNS).

source: For a StandAlone installation, we recommend at least:
es: Para una instalación StandAlone, recomendamos al menos:

source: 4 CPUs (x86_64 or i386)
es: 4 CPUs (x86_64 o i386)

source: 4 Gb memory
es: 4 Gb de memoria

source: 30GB HDD
es: 30GB de HDD

source: 1/2 public IP Addresses (read note behind)
es: 1/2 direcciones IP públicas (leer nota detrás)

source: It is possible to make both KamUsers and KamTrunks share a unique public IP address. If so, **KamTrunks ports will be changed from 5060 (TCP/UDP) to 7060 (TCP/UDP) and from 5061 (TCP) to 7061 (TCP)**.
es: Es posible que tanto KamUsers como KamTrunks compartan una única dirección IP pública. Si es así, **los puertos de KamTrunks se cambiarán de 5060 (TCP/UDP) a 7060 (TCP/UDP) y de 5061 (TCP) a 7061 (TCP)**.

source: If you're not using a :ref:`Automatic ISO CD image` you will also need:
es: Si no está utilizando una :ref:`imagen ISO CD automática<Automatic ISO CD image>`, también necesitará:

source: Debian Bookworm 12.0 base install
es: Instalación base de Debian Bookworm 12.0

source: Internet access
es: Acceso a Internet
