Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basic_concepts/operation_roles/index.po
Languages: es

source: Platform roles
es: Roles de la plataforma

source: IvozProvider is a multilevel role provider solution.
es: IvozProvider es una solución de proveedor de roles multinivel.

source: The following images shows the different available levels and the relation between them:
es: Las siguientes imágenes muestran los diferentes niveles disponibles y la relación entre ellos:

source: This section will explain each of the available roles, describing their responsibilities and more important tasks.
es: Esta sección explicará cada uno de los roles disponibles, describiendo sus responsabilidades y tareas más importantes.

source: Global administrator role
es: Rol de administrador global

source: The global administrator role (operator in the image) is usually done by the installation responsible.
es: El rol de administrador global (operador en la imagen) generalmente lo realiza el responsable de la instalación.

source: All options and platform features are visible to this role and usually is in charge of its maintenance.
es: Todas las opciones y características de la plataforma son visibles para este rol y generalmente está a cargo de su mantenimiento.

source: Their most important task is to **create Brands** and configure them so they have the enough autonomy to properly use the platform:
es: Su tarea más importante es **crear Marcas** y configurarlas para que tengan la suficiente autonomía para usar correctamente la plataforma:

source: Configure their web access.
es: Configurar su acceso web.

source: Configure their brand portal look and feel: themes, colors, etc.
es: Configurar la apariencia del portal de su marca: temas, colores, etc.

source: Apart from their main task, their global visibility and total access makes them responsible of:
es: Aparte de su tarea principal, su visibilidad global y acceso total los hace responsables de:

source: Monitor the platform so it keeps always UP & RUNNING
es: Monitorear la plataforma para que siempre esté en funcionamiento

source: Analyze platform logs to track possible errors.
es: Analizar los registros de la plataforma para rastrear posibles errores.

source: Polish the security mechanisms to avoid external attacks.
es: Pulir los mecanismos de seguridad para evitar ataques externos.

source: Obtain global statistics of calls audio quality.
es: Obtener estadísticas globales de la calidad del audio de las llamadas.

source: Increase the available resources of the platform as long as is needed:
es: Aumentar los recursos disponibles de la plataforma según sea necesario:

source: Increasing resources available in a standalone installation
es: Aumentar los recursos disponibles en una instalación independiente

source: Migrating, whenever required, to a distributed installation with multiple AS, media relays, etc.
es: Migrar, cuando sea necesario, a una instalación distribuida con múltiples AS, relés de medios, etc.

source: To sum up, **this role is the only one that has no limits within the platform**, that's why *God* is a term used in multiple places along this documentation.
es: En resumen, **este rol es el único que no tiene límites dentro de la plataforma**, por eso *Dios* es un término utilizado en múltiples lugares a lo largo de esta documentación.

source: *This role is responsible of maintaining the platform**, configuring it for the correct behaviour. This role **doesn't have any kind of limit** and **grants access** to the **brand operators**.
es: *Este rol es responsable de mantener la plataforma**, configurándola para el comportamiento correcto. Este rol **no tiene ningún tipo de límite** y **otorga acceso** a los **operadores de marca**.

source: Brand administrator role
es: Rol de administrador de marca

source: Brand operator can access a portal with less sections available compared to the previous role. The general (God) administrator is in charge of providing an URL with credentials for its brand portal.
es: El operador de marca puede acceder a un portal con menos secciones disponibles en comparación con el rol anterior. El administrador general (Dios) es el encargado de proporcionar una URL con credenciales para su portal de marca.

source: The most important task for brand operator is to **create and configure clients so they can work properly**.
es: La tarea más importante para el operador de marca es **crear y configurar clientes para que puedan trabajar correctamente**.

source: Due to brand operators are also responsible of billing their clients and make sure the external calls are properly setup, it must also manage:
es: Debido a que los operadores de marca también son responsables de facturar a sus clientes y asegurarse de que las llamadas externas estén correctamente configuradas, también deben gestionar:

source: Peering contracts with other IP providers for PSTN interconnection.
es: Contratos de interconexión con otros proveedores de IP para la interconexión PSTN.

source: Include all required client information for the billing process.
es: Incluir toda la información requerida del cliente para el proceso de facturación.

source: Pricing plans that will offer to their clients, that will determine how match they pay for each call.
es: Planes de precios que ofrecerán a sus clientes, que determinarán cuánto pagarán por cada llamada.

source: Setup the routes for each outgoing call types based on their final destination
es: Configurar las rutas para cada tipo de llamada saliente según su destino final

source: Create the invoices for each billing period and send them to their clients.
es: Crear las facturas para cada período de facturación y enviarlas a sus clientes.

source: As you can see, the task of brand operator has little in common with the global operator, but their importance is vital so the final users can use all the features includes in IvozProvider
es: Como puede ver, la tarea del operador de marca tiene poco en común con el operador global, pero su importancia es vital para que los usuarios finales puedan utilizar todas las características incluidas en IvozProvider.

source: **To sum up**, brand operators **grant access** to their **clients** administrators and **configure the platform to route and rate their calls**.
es: **En resumen**, los operadores de marca **otorgan acceso** a los administradores de sus **clientes** y **configuran la plataforma para enrutar y tarificar sus llamadas**.

source: Client administrator role
es: Rol de administrador de cliente

source: The client administrator has access to the portal supplied by the brand operator.
es: El administrador del cliente tiene acceso al portal proporcionado por el operador de marca.

source: From its point of view, it has a virtual pbx in the cloud that must configure for its users.
es: Desde su punto de vista, tiene una pbx virtual en la nube que debe configurar para sus usuarios.

source: To accomplish that, it's required:
es: Para lograr eso, se requiere:

source: Configure terminals, extensions and users.
es: Configurar terminales, extensiones y usuarios.

source: Configure the DDI incoming process with the proper logic:
es: Configurar el proceso de entrada DDI con la lógica adecuada:

source: Directly to an user
es: Directamente a un usuario

source: Hunt groups
es: Grupos de búsqueda

source: Give access to the final users to their web portal, so they can configure their profile options:
es: Dar acceso a los usuarios finales a su portal web, para que puedan configurar sus opciones de perfil:

source: Call forward
es: Desvío de llamadas

source: Do not disturb
es: No molestar

source: Call waiting
es: Llamada en espera

source: To sum up, the client administrators are responsible for **configuring the telephony system and make use of all the features available in IvozProvider**.
es: En resumen, los administradores de clientes son responsables de **configurar el sistema de telefonía y utilizar todas las características disponibles en IvozProvider**.

source: Final user role
es: Rol de usuario final

source: The final user has two different kinds of credentials, both supplied by its client administrator:
es: El usuario final tiene dos tipos diferentes de credenciales, ambas suministradas por su administrador de cliente:

source: User portal access credentials
es: Credenciales de acceso al portal de usuario

source: SIP credentials used to register terminals to IvozProvider
es: Credenciales SIP utilizadas para registrar terminales en IvozProvider

source: Through the user portal, it can browse their call registry and configure:
es: A través del portal de usuario, puede navegar por su registro de llamadas y configurar:

source: Displayed data when calling
es: Datos mostrados al llamar

source: Geographical configuration
es: Configuración geográfica

source: On the other hand, the SIP credentials allow users to configure their terminals to place and receive calls.
es: Por otro lado, las credenciales SIP permiten a los usuarios configurar sus terminales para realizar y recibir llamadas.

source: The same SIP credentials can be used in multiple devices at the same time,generating what is known as *parallel-forking*: whenever a call is placed to an user, all the active devices will ring so the user can answer the call from any of them.
es: Las mismas credenciales SIP pueden ser utilizadas en múltiples dispositivos al mismo tiempo, generando lo que se conoce como *parallel-forking*: siempre que se realice una llamada a un usuario, todos los dispositivos activos sonarán para que el usuario pueda responder la llamada desde cualquiera de ellos.
