Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/retail/retail_accounts.po
Languages: es

source: Retail Accounts
es: Cuentas Retail

source: Retail Accounts are the main routable option in Retail clients. More or less like :ref:`friends` are to Virtual PBX Clients, devices contain the required configurable options to provide a SIP connectivity service with IvozProvider and an external SIP entity.
es: Las Cuentas Retail son la principal opción enrutable en los clientes Retail. Más o menos como :ref:`friends <friends>` son para los Clientes PBX Virtual, los dispositivos contienen las opciones configurables necesarias para proporcionar un servicio de conectividad SIP con IvozProvider y una entidad SIP externa.

source: Although both **Carriers/DDI Providers** and **Retail Accounts** are defined by the **brand operator**, the former are designed to connect with the public switched telephony network while the latter connects the system with our clients' SIP entities.
es: Aunque tanto **Carriers/Proveedores DDI** como **Cuentas Retail** son definidos por el **operador de la marca**, los primeros están diseñados para conectarse con la red telefónica pública conmutada, mientras que los segundos conectan el sistema con las entidades SIP de nuestros clientes.

source: Types of retail accounts
es: Tipos de cuentas retail

source: There are 2 main types of SIP endpoints that can use retail with IvozProvider:
es: Hay 2 tipos principales de puntos finales SIP que pueden usar retail con IvozProvider:

source: **Direct connection endpoint**: IvozProvider must be able to talk SIP directly with this kind of devices by just forwarding the traffic to the proper port of the public IP address of the PBX.
es: **Punto final de conexión directa**: IvozProvider debe poder hablar SIP directamente con este tipo de dispositivos simplemente reenviando el tráfico al puerto adecuado de la dirección IP pública del PBX.

source: **Endpoint behind NAT**: Not directly reachable. This kind of endpoint must register at IvozProvider (just like all the :ref:`Terminals <terminals>` do).
es: **Punto final detrás de NAT**: No es directamente accesible. Este tipo de punto final debe registrarse en IvozProvider (al igual que todos los :ref:`Terminales <terminals>`).

source: What kind of calls can be routed through a *Retail Account*?
es: ¿Qué tipo de llamadas se pueden enrutar a través de una *Cuenta Retail*?

source: Contrary to Friends, **Retail Accounts** have some simplifications and limitations:
es: Contrariamente a Friends, **Cuentas Retail** tienen algunas simplificaciones y limitaciones:

source: Retail Accounts only route their assigned DDIs
es: Las Cuentas Retail solo enrutan sus DDIs asignados

source: Retail Accounts only place externals calls to Carriers
es: Las Cuentas Retail solo realizan llamadas externas a Carriers

source: Retail Accounts only receive external calls from DDI Providers
es: Las Cuentas Retail solo reciben llamadas externas de Proveedores DDI

source: Retail Accounts Configuration
es: Configuración de Cuentas Retail

source: These are the configurable settings of *Retail accounts*:
es: Estos son los ajustes configurables de las *Cuentas Retail*:

source: Name
es: Nombre

source: Name of the **retail account**. This name must be unique in the whole brand so it's recommended to use some kind of sequential identifier. This will also be used in SIP messages (sent **From User**).
es: Nombre de la **cuenta retail**. Este nombre debe ser único en toda la marca, por lo que se recomienda usar algún tipo de identificador secuencial. Esto también se usará en mensajes SIP (enviados **Desde Usuario**).

source: Description
es: Descripción

source: Optional. Extra information for this *retail account*.
es: Opcional. Información adicional para esta *cuenta retail*.

source: Password
es: Contraseña

source: When the *retail account* send requests, IvozProvider will authenticate it using this password. **Using password IS A MUST in "Register" mode**. In "Direct" mode, leaving it blank disables SIP authentication and enables IP source check.
es: Cuando la *cuenta retail* envía solicitudes, IvozProvider la autenticará usando esta contraseña. **Usar contraseña ES OBLIGATORIO en modo "Registrar"**. En modo "Directo", dejarlo en blanco desactiva la autenticación SIP y habilita la verificación de origen IP.

source: Direct connectivity
es: Conectividad directa

source: If you choose 'Yes' here, you'll have to fill the protocol, address and port where this *retail account* can be contacted.
es: Si eliges 'Sí' aquí, tendrás que completar el protocolo, la dirección y el puerto donde se puede contactar a esta *cuenta retail*.

source: Numeric transformation
es: Transformación numérica

source: Numeric transformation set that will be applied when communicating with this device.
es: Conjunto de transformación numérica que se aplicará al comunicarse con este dispositivo.

source: Fallback Outgoing DDI
es: DDI Saliente de Respaldo

source: External calls from this *retail account* will be presented with this DDI, **unless the source presented matches a DDI belonging to the retail client**.
es: Las llamadas externas desde esta *cuenta retail* se presentarán con este DDI, **a menos que la fuente presentada coincida con un DDI perteneciente al cliente retail**.

source: From domain
es: Desde dominio

source: Request from IvozProvider to this account will include this domain in the From header.
es: La solicitud de IvozProvider a esta cuenta incluirá este dominio en el encabezado From.

source: DDI In
es: DDI Entrante

source: If set to 'Yes', set destination (R-URI and To) to called DDI when calling to this endpoint. If set 'No', username used in Contact header of registration will be used, as specified in SIP RFC (retail account name will be used for endpoints with direct connectivity). Defaults to 'Yes'.
es: Si se establece en 'Sí', establece el destino (R-URI y To) al DDI llamado al llamar a este punto final. Si se establece en 'No', se usará el nombre de usuario utilizado en el encabezado Contacto del registro, como se especifica en el RFC SIP (se usará el nombre de la cuenta retail para puntos finales con conectividad directa). Por defecto es 'Sí'.

source: Enable T.38 passthrough
es: Habilitar paso a través de T.38

source: If set to 'yes', this SIP endpoint must be a **T.38 capable fax sender/receiver**. IvozProvider will act as a T.38 gateway, bridging fax-calls of a T.38 capable carrier and a T.38 capable device.
es: Si se establece en 'sí', este punto final SIP debe ser un **emisor/receptor de fax compatible con T.38**. IvozProvider actuará como una puerta de enlace T.38, conectando llamadas de fax de un carrier compatible con T.38 y un dispositivo compatible con T.38.

source: RTP Encryption
es: Encriptación RTP

source: If set to 'yes', call won't be established unless it's possible to encryption its audio. If set to 'no', audio won't be encrypted.
es: Si se establece en 'sí', la llamada no se establecerá a menos que sea posible encriptar su audio. Si se establece en 'no', el audio no se encriptará.

source: Multi Contact
es: Contacto Múltiple

source: Same SIP credentials can be configured in multiple SIP devices. In that case, all devices ring simultaneously when receiving a call. Setting this toggle to 'No' limits this behaviour so that only latest registered SIP device rings.
es: Las mismas credenciales SIP se pueden configurar en múltiples dispositivos SIP. En ese caso, todos los dispositivos suenan simultáneamente al recibir una llamada. Configurar este interruptor en 'No' limita este comportamiento para que solo suene el último dispositivo SIP registrado.

source: All retail accounts within a retail client will have the transcoding capabilities configured at client level.
es: Todas las cuentas retail dentro de un cliente retail tendrán las capacidades de transcodificación configuradas a nivel de cliente.

source: On retail account edit screen **id** field shows internal identification number assigned to the retail account. This id is transported to *Endpoint Id* field in *External Calls* section for CSV export.
es: En la pantalla de edición de la cuenta retail, el campo **id** muestra el número de identificación interno asignado a la cuenta retail. Este id se transporta al campo *Id del Punto Final* en la sección *Llamadas Externas* para la exportación CSV.

source: Retail account can be contacted due to calls to several DDIs. *DDI In* setting allows remote SIP endpoint to know which number caused each call, setting that number as destination (R-URI and To headers). This way, retail account can handle calls differently.
es: La cuenta retail puede ser contactada debido a llamadas a varios DDIs. La configuración *DDI Entrante* permite que el punto final SIP remoto sepa qué número causó cada llamada, estableciendo ese número como destino (encabezados R-URI y To). De esta manera, la cuenta retail puede manejar las llamadas de manera diferente.

source: Voicemail settings
es: Configuración del buzón de voz

source: There is no voicemail service for retail clients.
es: No hay servicio de buzón de voz para clientes retail.

source: Call forwarding settings
es: Configuración de desvío de llamadas

source: There are 2 types of call forward settings for retail accounts:
es: Hay 2 tipos de configuraciones de desvío de llamadas para cuentas retail:

source: Unconditional call forward.
es: Desvío de llamadas incondicional.

source: Unreachable call forward.
es: Desvío de llamadas inalcanzable.

source: You can point both types to 2 different destination:
es: Puedes dirigir ambos tipos a 2 destinos diferentes:

source: An external number.
es: Un número externo.

source: Another retail account within the same retail client.
es: Otra cuenta retail dentro del mismo cliente retail.

source: Unreachable call forward will be executed whenever the retail account cannot be reached:
es: El desvío de llamadas inalcanzable se ejecutará siempre que no se pueda contactar a la cuenta retail:

source: Direct connectivity accounts: when no answer is received from defined address.
es: Cuentas de conectividad directa: cuando no se recibe respuesta de la dirección definida.

source: Accounts using SIP register: when no answer is received from last contact address or when no active register is found.
es: Cuentas que usan registro SIP: cuando no se recibe respuesta de la última dirección de contacto o cuando no se encuentra un registro activo.

source: You can also add called DDI as call-forward criteria, making it apply only when a certain DDI is called. These call-forward settings have precedence over call-forward with no DDI selected (Any DDI).
es: También puedes agregar el DDI llamado como criterio de desvío de llamadas, haciéndolo aplicar solo cuando se llama a un cierto DDI. Estas configuraciones de desvío de llamadas tienen prioridad sobre el desvío de llamadas sin DDI seleccionado (Cualquier DDI).

source: Unconditional call forward has precedence over unreacheable call forward.
es: El desvío de llamadas incondicional tiene prioridad sobre el desvío de llamadas inalcanzable.

source: Retail accounts marked as T.38 won't have any call forward settings.
es: Las cuentas retail marcadas como T.38 no tendrán ninguna configuración de desvío de llamadas.

source: Asterisk as a retail account
es: Asterisk como una cuenta retail

source: At the other end of a account can be any kind of SIP entity. This section takes as example an Asterisk PBX system using SIP channel driver that wants to connect to IvozProvider.
es: En el otro extremo de una cuenta puede haber cualquier tipo de entidad SIP. Esta sección toma como ejemplo un sistema PBX Asterisk que usa el controlador de canal SIP que quiere conectarse a IvozProvider.

source: Account register
es: Registro de cuenta

source: If the system can not be directly access, Asterisk will have to register in the platform (like a terminal will do).
es: Si el sistema no puede ser accedido directamente, Asterisk tendrá que registrarse en la plataforma (como lo haría un terminal).

source: Configuration will be something like this:
es: La configuración será algo así:

source: Account peer
es: Par de cuenta

source: *Retail accounts* MUST NOT challenge IvozProvider. That's why the *insecure* setting is used here.
es: *Las cuentas retail* NO DEBEN desafiar a IvozProvider. Es por eso que se usa la configuración *insegura* aquí.

source: As From username is used to identify the retail account, P-Asserted-Identity (or P-Preferred-Identity or Remote-Party-Id) must be used to specify caller number. Prevalence among these source headers is: PAI > PPI > RPID.
es: Dado que el nombre de usuario From se usa para identificar la cuenta retail, se debe usar P-Asserted-Identity (o P-Preferred-Identity o Remote-Party-Id) para especificar el número de la persona que llama. La prevalencia entre estos encabezados de origen es: PAI > PPI > RPID.
