Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/clients/retail.po
Languages: es

source: Retail clients are even a more lightweight client type than *Residential clients*.
es: Los clientes Retail son un tipo de cliente aún más ligero que los *clientes residenciales*.

source: They just provide a SIP trunking service that include these features:
es: Solo proporcionan un servicio de troncal SIP que incluye estas características:

source: Configure one or more retail accounts (SIP devices).
es: Configurar una o más cuentas retail (dispositivos SIP).

source: Setup one or more DDIs.
es: Configurar uno o más DDI.

source: **Place external calls** showing one of those DDIs.
es: **Realizar llamadas externas** mostrando uno de esos DDI.

source: **Receive external calls** to their DDIs.
es: **Recibir llamadas externas** a sus DDI.

source: Record calls.
es: Grabar llamadas.

source: No users, no extensions, no internal calls, no hunt groups, no IVRs, no voicemail... just **incoming and outgoing external calls**.
es: Sin usuarios, sin extensiones, sin llamadas internas, sin grupos de búsqueda, sin IVR, sin correo de voz... solo **llamadas externas entrantes y salientes**.

source: Retail clients and their accounts **MUST use Brand's SIP domain in their SIP messages**.
es: Los clientes Retail y sus cuentas **DEBEN usar el dominio SIP de la marca en sus mensajes SIP**.

source: Differences between retail and residential clients
es: Diferencias entre clientes retail y residenciales

source: There is an important key difference between these two clients: **retail client calls do not traverse any application server**.
es: Hay una diferencia clave importante entre estos dos clientes: **las llamadas de clientes retail no atraviesan ningún servidor de aplicaciones**.

source: As a result:
es: Como resultado:

source: No virtual faxing service for retail clients.
es: No hay servicio de fax virtual para clientes retail.

source: No voicemail service for retail clients.
es: No hay servicio de correo de voz para clientes retail.

source: But they also have benefits that make them ideal for some situations:
es: Pero también tienen beneficios que los hacen ideales para algunas situaciones:

source: No application server traverse, much less load for the platform.
es: No hay travesía de servidor de aplicaciones, mucha menos carga para la plataforma.

source: Call transcoding as a feature.
es: Transcodificación de llamadas como una característica.

source: Routing tags for different call routing for same destinations.
es: Etiquetas de enrutamiento para diferentes enrutamientos de llamadas para los mismos destinos.

source: Residential devices are force to talk the codec selected in their configuration (just one). Retail clients, on the other hand, can talk in the codecs they offer in their SDP and in the codecs selected in IvozProvider: IvozProvider will make transcoding when necessary.
es: Los dispositivos residenciales están obligados a usar el códec seleccionado en su configuración (solo uno). Los clientes retail, por otro lado, pueden usar los códecs que ofrecen en su SDP y los códecs seleccionados en IvozProvider: IvozProvider hará la transcodificación cuando sea necesario.

source: Use retail client type unless you need any of the services provided by application servers (fax or voicemails).
es: Usa el tipo de cliente retail a menos que necesites alguno de los servicios proporcionados por servidores de aplicaciones (fax o correos de voz).

source: Adding/Editing retail clients
es: Agregar/Editar clientes retail

source: Some fields described below may not be visible depending on enabled features.
es: Algunos campos descritos a continuación pueden no ser visibles dependiendo de las funcionalidades habilitadas.

source: These are the fields shown when **adding** a new retail client:
es: Estos son los campos mostrados al **agregar** un nuevo cliente retail:

source: Name
es: Nombre

source: Used to reference this particular client.
es: Usado para referenciar a este cliente en particular.

source: Billing method
es: Método de facturación

source: To choose among postpaid, prepaid and pseudo-prepaid. 'none' disables billing.
es: Para elegir entre pospago, prepago y pseudo-prepago. 'ninguno' desactiva la facturación.

source: Language
es: Idioma

source: Used to choose the language of played locutions.
es: Usado para elegir el idioma de las locuciones reproducidas.

source: Country code
es: Código de país

source: Default country code for DDIs.
es: Código de país predeterminado para los DDI.

source: Default timezone
es: Zona horaria predeterminada

source: Used for showing call registries dates.
es: Usado para mostrar las fechas de los registros de llamadas.

source: Currency
es: Moneda

source: Chosen currency will be used in price calculation, invoices, balance movements and remaining money operations of this client.
es: La moneda elegida se usará en el cálculo de precios, facturas, movimientos de saldo y operaciones de dinero restante de este cliente.

source: Numeric transformation
es: Transformación numérica

source: Describes the way the client will "talk" and the way the client wants to be "talked".
es: Describe la forma en que el cliente "hablará" y la forma en que el cliente quiere ser "hablado".

source: Max calls
es: Máximo de llamadas

source: Limits both incoming and outgoing external calls (0 for unlimited).
es: Limita tanto las llamadas externas entrantes como salientes (0 para ilimitado).

source: Filter by IP address
es: Filtrar por dirección IP

source: If set, the platform will only allow calls coming from allowed IP/ranges or countries.
es: Si se establece, la plataforma solo permitirá llamadas provenientes de IP/rangos o países permitidos.

source: GeoIP allowed countries
es: Países permitidos por GeoIP

source: If *Filter by IP address* is enabled, traffic from selected countries will be allowed.
es: Si *Filtrar por dirección IP* está habilitado, se permitirá el tráfico de los países seleccionados.

source: Max daily usage
es: Uso máximo diario

source: Limits external outbound calls when this limit is reached within a day. At midnight counters are reset and accounts are re-enabled.
es: Limita las llamadas externas salientes cuando se alcanza este límite dentro de un día. A medianoche se restablecen los contadores y se reactivan las cuentas.

source: Email
es: Correo electrónico

source: A notification email will be sent to given address when configured max daily usage is reached. Leave empty to avoid notification.
es: Se enviará un correo electrónico de notificación a la dirección dada cuando se alcance el uso máximo diario configurado. Dejar vacío para evitar la notificación.

source: When **editing** a client, these additional fields can be configured:
es: Al **editar** un cliente, se pueden configurar estos campos adicionales:

source: Invoice data
es: Datos de la factura

source: All the fields in this group will be included in invoices generated for this client. This section also allows showing/hiding billing details to client's portal, such as Invoices, Rating Profiles and Price of external calls.
es: Todos los campos de este grupo se incluirán en las facturas generadas para este cliente. Esta sección también permite mostrar/ocultar detalles de facturación en el portal del cliente, como Facturas, Perfiles de Tarifas y Precio de llamadas externas.

source: Outgoing DDI
es: DDI saliente

source: Fallback DDI for external outgoing calls (can be overridden at residential device level).
es: DDI de respaldo para llamadas externas salientes (puede ser anulado a nivel de dispositivo residencial).

source: Routing tags
es: Etiquetas de enrutamiento

source: This field allows enabling routing tags for this specific client. Call preceded with this routing tags will be rated and routed differently.
es: Este campo permite habilitar etiquetas de enrutamiento para este cliente específico. Las llamadas precedidas por estas etiquetas de enrutamiento se valorarán y enrutará de manera diferente.

source: Audio transcoding
es: Transcodificación de audio

source: This field allows enabling codecs for this specific client. This codecs will be added to the ones offered by the client in its SDP.
es: Este campo permite habilitar códecs para este cliente específico. Estos códecs se agregarán a los ofrecidos por el cliente en su SDP.

source: Allow Client to remove recordings
es: Permitir al cliente eliminar grabaciones

source: Shown only if *Recording* feature is enabled for client, shows/hides recording removal button on client *Call Recordings* section.
es: Se muestra solo si la función *Grabación* está habilitada para el cliente, muestra/oculta el botón de eliminación de grabaciones en la sección *Grabaciones de llamadas* del cliente.

source: Selecting codecs in **Audio transcoding** may lead to uneeded transcoding. Selecting ALL codecs is always a horrible idea. Do not select any codec unless this client does not support an specific codec that is compulsory for a needed destination/carrier.
es: Seleccionar códecs en **Transcodificación de audio** puede llevar a una transcodificación innecesaria. Seleccionar TODOS los códecs siempre es una idea horrible. No selecciones ningún códec a menos que este cliente no admita un códec específico que sea obligatorio para un destino/carrier necesario.

source: Apart from these fields, main operator (*aka* God) will also see a **Platform data** group that allows:
es: Aparte de estos campos, el operador principal (*también conocido como* Dios) también verá un grupo de **Datos de la plataforma** que permite:

source: Choosing an specific media relay set for the client.
es: Elegir un conjunto específico de retransmisión de medios para el cliente.

source: For outgoing calls, platform will use the CLID provided by the client as long as it is considered valid, otherwise fallback DDI will be used. The platform will consider as valid any CLID that matches one of the client's DDIs.
es: Para llamadas salientes, la plataforma usará el CLID proporcionado por el cliente siempre que se considere válido, de lo contrario se usará el DDI de respaldo. La plataforma considerará válido cualquier CLID que coincida con uno de los DDI del cliente.

source: Additional subsections
es: Subsecciones adicionales

source: Each entry in this table has these additional options:
es: Cada entrada en esta tabla tiene estas opciones adicionales:

source: **List of authorized sources**: if *Filter by IP address* is enabled, this subsection allows adding addresses or network ranges.
es: **Lista de fuentes autorizadas**: si *Filtrar por dirección IP* está habilitado, esta subsección permite agregar direcciones o rangos de red.

source: No outgoing call will be allowed if *Filter by IP address* is enabled and the corresponding list is empty.
es: No se permitirá ninguna llamada saliente si *Filtrar por dirección IP* está habilitado y la lista correspondiente está vacía.

source: **List of client admins**: this subsection allows managing portal credentials for this specific client. Read :ref:`acls` for further explanation about restricted client administrators.
es: **Lista de administradores de clientes**: esta subsección permite gestionar las credenciales del portal para este cliente específico. Lea :ref:`controles de acceso <acls>` para una mayor explicación sobre administradores de clientes restringidos.

source: **List of Rating profiles**: this subsection allows managing the rating profiles that will be used to bill its outgoing calls.
es: **Lista de perfiles de tarifas**: esta subsección permite gestionar los perfiles de tarifas que se utilizarán para facturar sus llamadas salientes.

source: No outgoing call will be allowed for this client unless an active rating profiles that can bill the specific call.
es: No se permitirá ninguna llamada saliente para este cliente a menos que haya un perfil de tarifas activo que pueda facturar la llamada específica.
