Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started/internal_calls/brand_portal.po
Languages: es

source: Brand Configuration
es: Configuración de Marca

source: We need that the default DemoBrand has a client with at least 2 users. In order to achieve this we will require a little configuration in this section.
es: Necesitamos que la DemoBrand predeterminada tenga un cliente con al menos 2 usuarios. Para lograr esto, necesitaremos un poco de configuración en esta sección.

source: In fact, if we check **Virtual PBXs** in the brand menu, we'll discover that there is already an existing *DemoCompany* that we can use to fulfill our desired goal :)
es: De hecho, si revisamos **PBXs Virtuales** en el menú de la marca, descubriremos que ya existe una *DemoCompany* que podemos usar para cumplir nuestro objetivo deseado :)

source: Only a thing is required to configure for this client, pressing **Edit client** option.
es: Solo se requiere una cosa para configurar este cliente, presionar la opción **Editar cliente**.

source: Client SIP Domain
es: Dominio SIP del Cliente

source: As mentioned in the previous section, is **required** that each of the vPBX clients has a public domain that resolves to the configured IP address for :ref:`proxyusers`.
es: Como se mencionó en la sección anterior, es **requerido** que cada uno de los clientes vPBX tenga un dominio público que resuelva a la dirección IP configurada para :ref:`proxyusers`.

source: DNS register can be type A (supported by all the hardphones/softphones ) or even NAPTR+SRV.
es: El registro DNS puede ser de tipo A (compatible con todos los teléfonos fijos/softphones) o incluso NAPTR+SRV.

source: Once the domain has been configured (by means that are out of scope of this document), it will be enough to write it in our client configuration **SIP Domain** field.
es: Una vez que el dominio ha sido configurado (por medios que están fuera del alcance de este documento), será suficiente escribirlo en nuestra configuración del cliente campo **Dominio SIP**.

source: Once the client has been saved, the domain will be also displayed in the list in the column **SIP domain**.
es: Una vez que el cliente ha sido guardado, el dominio también se mostrará en la lista en la columna **Dominio SIP**.

source: It's important to understand this block. :ref:`Unless we've a single client registered <dnshack>`, without a DNS domain pointing to our users proxy IP address, everything will fail.
es: Es importante entender este bloque. :ref:`A menos que tengamos un solo cliente registrado <dnshack>`, sin un dominio DNS apuntando a nuestra dirección IP del proxy de usuarios, todo fallará.

source: Have we repeated enough that without a properly configured DNS pointing to the Users proxy IP address nothing will work?
es: ¿Hemos repetido lo suficiente que sin un DNS configurado correctamente apuntando a la dirección IP del proxy de Usuarios nada funcionará?

source: I have no time for a DNS registry
es: No tengo tiempo para un registro DNS

source: Everything we have said is true: as we create new brands and brands create new clients, each of them will need a DNS registry.
es: Todo lo que hemos dicho es cierto: a medida que creamos nuevas marcas y las marcas crean nuevos clientes, cada uno de ellos necesitará un registro DNS.

source: But the first client of the platform is quite special and can take over the IP address of the proxy to use it as a domain.
es: Pero el primer cliente de la plataforma es bastante especial y puede tomar la dirección IP del proxy para usarla como un dominio.

source: Although it is not a domain, but being used like it was, it will be displayed in :ref:`SIP Domains` section.
es: Aunque no es un dominio, pero al ser usado como si lo fuera, se mostrará en la sección :ref:`Dominios SIP <SIP Domains>`.

source: It’s important to understand the this trick is only valid for the first client of the platform ;)
es: Es importante entender que este truco solo es válido para el primer cliente de la plataforma ;)

source: Emulate Demo client
es: Emular cliente Demo

source: The client emulation process is the same as the brand emulation, with the difference that it filters the block ‘Client Configuration’ instead of ‘Brand Configuration’.
es: El proceso de emulación del cliente es el mismo que el de la emulación de la marca, con la diferencia de que filtra el bloque ‘Configuración del Cliente’ en lugar de ‘Configuración de Marca’.

source: Once the client has been emulated, the top right corner of the portal will show that we are in the right path :)
es: Una vez que el cliente ha sido emulado, la esquina superior derecha del portal mostrará que estamos en el camino correcto :)
