Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started/internal_calls/god_portal.po
Languages: es

source: Global Configuration
es: Configuración Global

source: Any of the 2 Public IP addresses configured during the installation will work to access the web portal. Default credentials are **admin / changeme**.
es: Cualquiera de las 2 direcciones IP públicas configuradas durante la instalación funcionará para acceder al portal web. Las credenciales predeterminadas son **admin / changeme**.

source: In this section will reference global administrator configuration options, available in the menu (**Main management**) of the web portal (only visible to God Admins):
es: En esta sección se hará referencia a las opciones de configuración del administrador global, disponibles en el menú (**Gestión principal**) del portal web (solo visible para los administradores God):

source: Emulate the Demo brand
es: Emular la marca Demo

source: As mentioned above, the initial installation will have an already created brand called DemoBrand, that will be used for our goal: to have 2 telephones registered that can call each other.
es: Como se mencionó anteriormente, la instalación inicial tendrá una marca ya creada llamada DemoBrand, que se utilizará para nuestro objetivo: tener 2 teléfonos registrados que puedan llamarse entre sí.

source: Before going to the next section, is quite important to understand how the **emulation** works.
es: Antes de pasar a la siguiente sección, es bastante importante entender cómo funciona la **emulación**.

source: As global operator, you have access to the menu **Global Configuration** only visible to *God* administrators.
es: Como operador global, tienes acceso al menú **Configuración Global** solo visible para los administradores *God*.

source: Apart from that menu, you will also have access to the **Brand Configuration** and **Client configuration** blocks.
es: Aparte de ese menú, también tendrás acceso a los bloques de **Configuración de Marca** y **Configuración de Cliente**.

source: Last two blocks have a red button in the right side.
es: Los dos últimos bloques tienen un botón rojo en el lado derecho.

source: When pressed, a popup will be displayed that lists all existing brands / clients.
es: Al presionarlo, se mostrará un popup que lista todas las marcas / clientes existentes.

source: After selecting the DemoBrand brand, the icon will change.
es: Después de seleccionar la marca DemoBrand, el icono cambiará.

source: The upper right corner of the portal will also display the brand that is being emulated.
es: La esquina superior derecha del portal también mostrará la marca que se está emulando.

source: What emulation means
es: Qué significa la emulación

source: Basically, that **everything in the menu 'Brand configuration' will be relative to the chosen brand** and is **exactly** the same menu entries that the brand operator will see using its brand portal.
es: Básicamente, que **todo en el menú 'Configuración de Marca' será relativo a la marca elegida** y es **exactamente** las mismas entradas de menú que el operador de la marca verá usando su portal de marca.

source: Ok, ok, maybe exactly is not totally accurate. The global operator is able to see some fields in some screens that other admins can't (i.e. On Client edit screen, fields like 'Media relays' or 'Application server' are only configurable by the global operator.
es: Ok, ok, tal vez exactamente no sea totalmente preciso. El operador global puede ver algunos campos en algunas pantallas que otros administradores no pueden (por ejemplo, en la pantalla de edición del Cliente, campos como 'Relés de medios' o 'Servidor de aplicaciones' solo son configurables por el operador global.
