Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/api_rest/acls.po
Languages: es

source: Credentials used for web access can be used with their API corresponding level. These administrators (global, brand, client) have full access to all endpoints of their level.
es: Las credenciales utilizadas para el acceso web pueden ser utilizadas con su nivel correspondiente de API. Estos administradores (global, marca, cliente) tienen acceso completo a todos los endpoints de su nivel.

source: Since 2.15, it is possible to create **restricted administrators** too.
es: Desde la versión 2.15, también es posible crear **administradores restringidos**.

source: Restricted global/brand administrators
es: Administradores globales/marca restringidos

source: Enabling global/brand administrator **Restricted** option makes this administrator special:
es: Habilitar la opción **Restringido** para el administrador global/marca hace que este administrador sea especial:

source: Cannot be used anymore to access web portal.
es: No se puede usar más para acceder al portal web.

source: Full API endpoint access is restricted to read-only access to those endpoints.
es: El acceso completo a los endpoints de la API está restringido a acceso de solo lectura a esos endpoints.

source: Privileges can be fine-tuned in *List of Administrator access privileges* subsection, where you can enable/disable for each endpoint:
es: Los privilegios se pueden ajustar en la subsección *Lista de privilegios de acceso del administrador*, donde puedes habilitar/deshabilitar para cada endpoint:

source: Create privilege
es: Privilegio de creación

source: Administrator with this privilege can create new items of given endpoint.
es: El administrador con este privilegio puede crear nuevos elementos del endpoint dado.

source: Read privilege
es: Privilegio de lectura

source: Administrator with this privilege can read existing items of given endpoint. Just watch existing items, no modification is allowed.
es: El administrador con este privilegio puede leer elementos existentes del endpoint dado. Solo puede ver elementos existentes, no se permite la modificación.

source: Update privilege
es: Privilegio de actualización

source: Administrator with this privilege can modify existing items of given endpoint.
es: El administrador con este privilegio puede modificar elementos existentes del endpoint dado.

source: Delete privilege
es: Privilegio de eliminación

source: Administrator with this privilege can delete existing items of given endpoint.
es: El administrador con este privilegio puede eliminar elementos existentes del endpoint dado.

source: Changing a non-rectricted administrator to restricted turns it into a read-only API-capable administrator.
es: Cambiar un administrador no restringido a restringido lo convierte en un administrador capaz de usar la API solo en modo lectura.

source: Changing a restricted administrator to non-restricted turns it into a full access web+API capable administrator.
es: Cambiar un administrador restringido a no restringido lo convierte en un administrador capaz de usar la web y la API con acceso completo.

source: You can easily select multiple endpoints in *List of Administrator access privileges* and revoke/grant them all.
es: Puedes seleccionar fácilmente múltiples endpoints en la *Lista de privilegios de acceso del administrador* y revocar/otorgar todos ellos.

source: Client restricted administrators
es: Administradores restringidos de clientes

source: Opposed to global/brand administrators, **client restricted administrators can login into client web portal**. As a consequence, privileges of a given client administrator apply to:
es: A diferencia de los administradores globales/marca, **los administradores restringidos de clientes pueden iniciar sesión en el portal web del cliente**. Como consecuencia, los privilegios de un administrador de cliente dado se aplican a:

source: Privileges for API integrations.
es: Privilegios para integraciones de API.

source: Web access to sections and available operations in those sections.
es: Acceso web a secciones y operaciones disponibles en esas secciones.

source: Privileges can be fine-tuned in *List of Administrator access privileges* subsection too.
es: Los privilegios también se pueden ajustar en la subsección *Lista de privilegios de acceso del administrador*.

source: Example 1: Recordings-only client administrator
es: Ejemplo 1: Administrador de cliente solo para grabaciones

source: To create a client administrator that only sees Recordings section:
es: Para crear un administrador de cliente que solo vea la sección de Grabaciones:

source: Create a new restricted client administrator or turn a non-rectricted one into restricted.
es: Crea un nuevo administrador de cliente restringido o convierte uno no restringido en restringido.

source: Access to **List of Administrator access privileges**, select all endpoints and press **Revoke access**.
es: Accede a la **Lista de privilegios de acceso del administrador**, selecciona todos los endpoints y presiona **Revocar acceso**.

source: Edit *Recordings* endpoint and enable Read access.
es: Edita el endpoint *Grabaciones* y habilita el acceso de lectura.

source: Example 2: Fax-only client administrator
es: Ejemplo 2: Administrador de cliente solo para faxes

source: To create a client administrator that only sees Fax section and can send/receive faxes:
es: Para crear un administrador de cliente que solo vea la sección de Faxes y pueda enviar/recibir faxes:

source: Create a new restricted client administrator or turn a non-restricted one into restricted.
es: Crea un nuevo administrador de cliente restringido o convierte uno no restringido en restringido.

source: Edit *Faxes* endpoint and enable Read access.
es: Edita el endpoint *Faxes* y habilita el acceso de lectura.

source: Edit *FaxesFiles* endpoint and enable Create/Update access.
es: Edita el endpoint *FaxesFiles* y habilita el acceso de creación/actualización.
