Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/api_rest/introduction.po
Languages: es

source: Introduction to IvozProvider API
es: Introducción a la API de IvozProvider

source: Ivoz Provider offers three `hypermedia <https://en.wikipedia.org/wiki/HATEOAS>`_-driven REST APIs, one for each admin role. The three of them have been built over `OpenAPI Specification <https://www.openapis.org/>`_, a community-driven open specification within the OpenAPI Initiative, a Linux Foundation Collaborative Project. This initiative is supported by some leading tech companies such as Adobe, Google, IBM, Microsoft and `more <https://www.openapis.org/membership/members)>`_.
es: Ivoz Provider ofrece tres APIs REST impulsadas por `hipermedia <https://en.wikipedia.org/wiki/HATEOAS>`_, una para cada rol de administrador. Las tres se han construido sobre la `Especificación OpenAPI <https://www.openapis.org/>`_, una especificación abierta impulsada por la comunidad dentro de la Iniciativa OpenAPI, un Proyecto Colaborativo de la Fundación Linux. Esta iniciativa cuenta con el apoyo de algunas empresas tecnológicas líderes como Adobe, Google, IBM, Microsoft y `más <https://www.openapis.org/membership/members)>`_.

source: We support the features below:
es: Soportamos las siguientes características:

source: Nice human-readable specification, including a sandbox
es: Especificación legible para humanos, incluyendo un entorno de pruebas

source: JSON Web Token (JWT) based authentication
es: Autenticación basada en JSON Web Token (JWT)

source: Request and response content type negotiation
es: Negociación del tipo de contenido de solicitud y respuesta

source: Result pagination
es: Paginación de resultados

source: Response property filters
es: Filtros de propiedades de respuesta

source: Result filters
es: Filtros de resultados

source: Result ordering
es: Ordenación de resultados

source: Security layer: Resource and record access control
es: Capa de seguridad: Control de acceso a recursos y registros
