Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started/external_incoming_calls/configure_ddi.po
Languages: es

source: Once we have an agreement with a DDI provider and we have configured it in the previous section, only two task are pending:
es: Una vez que tenemos un acuerdo con un proveedor de DDI y lo hemos configurado en la sección anterior, solo quedan dos tareas pendientes:

source: Configuring an external DDI
es: Configurando un DDI externo

source: The brand operator, responsible of these *peering* agreements with VoIP providers, has the task to create the DDIs for each client.
es: El operador de la marca, responsable de estos acuerdos de *peering* con proveedores de VoIP, tiene la tarea de crear los DDIs para cada cliente.

source: Notice that in order to access this section, the brand operator (or *god*) must have emulated the proper client and access the menu section **Client Configuration**.
es: Tenga en cuenta que para acceder a esta sección, el operador de la marca (o *dios*) debe haber emulado al cliente adecuado y acceder a la sección del menú **Configuración del Cliente**.

source: Section **Client configuration > DDIs** is different when the client administrator access than the displayed data when a global or brand administrator does. Client administrator are unable to create or delete DDIs, just edit the one created by the brand or god administrator.
es: La sección **Configuración del Cliente > DDIs** es diferente cuando accede el administrador del cliente que los datos mostrados cuando lo hace un administrador global o de marca. Los administradores de clientes no pueden crear o eliminar DDIs, solo editar los creados por el administrador de marca o dios.

source: Taking into account these concepts, we create a new DDI and fill the required fields.
es: Teniendo en cuenta estos conceptos, creamos un nuevo DDI y llenamos los campos requeridos.

source: For detailed information about configuration fields, check :ref:`DDIs <pbx_ddis>` section.
es: Para información detallada sobre los campos de configuración, consulte la sección :ref:`DDIs <pbx_ddis>`.

source: Configure incoming routes
es: Configurar rutas entrantes

source: In the previous section, we have created the DDI and configure it (pointing it to user Alice), but **the most common procedure** is that the brand operator just creates the DDI while the **client administrator**, using the same section, **configures** it choosing the correct route (user, hunt group, etc.), calendars filters and so on.
es: En la sección anterior, hemos creado el DDI y lo configuramos (apuntándolo al usuario Alice), pero **el procedimiento más común** es que el operador de la marca solo cree el DDI mientras que el **administrador del cliente**, usando la misma sección, **lo configura** eligiendo la ruta correcta (usuario, grupo de búsqueda, etc.), filtros de calendarios, etc.

source: At this point, calling the number of the configured DDI will make the *Alice* phone ring.
es: En este punto, llamar al número del DDI configurado hará que suene el teléfono de *Alice*.
