Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/calls/call_recordings.po
Languages: es

source: Call recordings
es: Grabaciones de llamadas

source: Beware that local legislation may enforce to announce that the call is being recorded (sometimes to both parties). You should include a recording disclaimer in your welcome locutions for DDIs with automatic recording enabled.
es: Tenga en cuenta que la legislación local puede exigir anunciar que la llamada está siendo grabada (a veces a ambas partes). Debe incluir un aviso de grabación en sus locuciones de bienvenida para los DDIs con grabación automática habilitada.

source: IvozProvider supports two different ways of recording calls:
es: IvozProvider admite dos formas diferentes de grabar llamadas:

source: **Automatic recordings** for the incoming/outgoing calls that use a :ref:`External DDI <ddis>`.
es: **Grabaciones automáticas** para las llamadas entrantes/salientes que usan un :ref:`DDI externo <ddis>`.

source: **On demand recordings** requested by a user during a call.
es: **Grabaciones bajo demanda** solicitadas por un usuario durante una llamada.

source: Automatic DDI recordings
es: Grabaciones automáticas de DDI

source: In this type of recording, **the whole conversation will be recorded**: from the start until it finishes.
es: En este tipo de grabación, **se grabará toda la conversación**: desde el inicio hasta que termine.

source: Two different scenarios:
es: Dos escenarios diferentes:

source: **Incoming calls to a DDI**: The call will continue until the external dialer hangups (no matter whom is talking to).
es: **Llamadas entrantes a un DDI**: La llamada continuará hasta que el marcador externo cuelgue (sin importar con quién esté hablando).

source: **Outgoing calls using a DDI** as :ref:`Outgoing DDI <ddis>`: the recording will continue as long as the external destination keeps in the conversation.
es: **Llamadas salientes usando un DDI** como :ref:`DDI saliente <ddis>`: la grabación continuará mientras el destino externo permanezca en la conversación.

source: Take into account that the call will be recorded while the external entity is present, even it the call is being transferred between multiple users of the platform.
es: Tenga en cuenta que la llamada se grabará mientras la entidad externa esté presente, incluso si la llamada se transfiere entre varios usuarios de la plataforma.

source: Record all the calls of a DDI
es: Grabar todas las llamadas de un DDI

source: To enable this feature, edit the DDI and configure the field under the section recording data:
es: Para habilitar esta función, edite el DDI y configure el campo en la sección de datos de grabación:

source: There are 4 available options:
es: Hay 4 opciones disponibles:

source: Disable recordings
es: Deshabilitar grabaciones

source: Enable incoming recordings
es: Habilitar grabaciones entrantes

source: Enable outgoing recordings
es: Habilitar grabaciones salientes

source: Enable all call recordings
es: Habilitar todas las grabaciones de llamadas

source: On demand recordings
es: Grabaciones bajo demanda

source: The *on-demand* recordings must be enabled by the *brand administrator* for the clients that request it. This can be done in the client edit screen:
es: Las grabaciones *bajo demanda* deben ser habilitadas por el *administrador de la marca* para los clientes que lo soliciten. Esto se puede hacer en la pantalla de edición del cliente:

source: Contrary to the :ref:`Services <services>` mentioned in the previous section, the on demand record are activated within a conversation.
es: A diferencia de los :ref:`Servicios <services>` mencionados en la sección anterior, la grabación bajo demanda se activa dentro de una conversación.

source: Contrary to automatic ones, on demand recording can be stopped using the same process that started them.
es: A diferencia de las automáticas, la grabación bajo demanda se puede detener utilizando el mismo proceso que las inició.

source: Activated using the *Record* key
es: Activado usando la tecla *Grabar*

source: Some terminals (for example, *Yealink*) support sending a `SIP INFO <https://tools.ietf.org/html/rfc6086>`_ message during the conversation with a special *Record* header (see `reference <http://www.yealink.com/Upload/document/UsingCallRecordingFeatureonYealinkPhones/UsingCallRecordingFeatureonYealinkSIPT2XPphonesRev_610-20561729764.pdf>`_). This is not a standard for the protocol, but being Yealink one of the supported manufacturers of the solution, we include this kind of on-demand recording.
es: Algunos terminales (por ejemplo, *Yealink*) admiten el envío de un mensaje `SIP INFO <https://tools.ietf.org/html/rfc6086>`_ durante la conversación con un encabezado especial *Grabar* (ver `referencia <http://www.yealink.com/Upload/document/UsingCallRecordingFeatureonYealinkPhones/UsingCallRecordingFeatureonYealinkSIPT2XPphonesRev_610-20561729764.pdf>`_). Esto no es un estándar para el protocolo, pero siendo Yealink uno de los fabricantes compatibles con la solución, incluimos este tipo de grabación bajo demanda.

source: For this recording requests, the configured code doesn't matter but the client still must have on demand records enabled.
es: Para estas solicitudes de grabación, el código configurado no importa pero el cliente aún debe tener habilitadas las grabaciones bajo demanda.

source: To start or stop this kind of recordings, just press the Record key in the terminal and the system will handle the sent message.
es: Para iniciar o detener este tipo de grabaciones, simplemente presione la tecla Grabar en el terminal y el sistema manejará el mensaje enviado.

source: Activated using *DTMF* codes
es: Activado usando códigos *DTMF*

source: The more traditional approach for this feature is to press a combination of keys during the call. Some notification will be played and the recording will start or stop. This combination is sent to the system using `DTMF tones <https://es.wikipedia.org/wiki/Marcaci%C3%B3n_por_tonos>`_ using the same audio stream that the conversation (as mentioned in `RFC 4733 <https://tools.ietf.org/html/rfc4733>`_).
es: El enfoque más tradicional para esta función es presionar una combinación de teclas durante la llamada. Se reproducirá una notificación y la grabación comenzará o se detendrá. Esta combinación se envía al sistema utilizando `tonos DTMF <https://es.wikipedia.org/wiki/Marcaci%C3%B3n_por_tonos>`_ utilizando el mismo flujo de audio que la conversación (como se menciona en `RFC 4733 <https://tools.ietf.org/html/rfc4733>`_).

source: IvozProvider supports this kind of on demand record activation but with an important downside. In order to capture this codes, the pbx must process each audio packet to detect the code, avoiding the direct flow of media between the final endpoints.
es: IvozProvider admite este tipo de activación de grabación bajo demanda pero con una desventaja importante. Para capturar estos códigos, la pbx debe procesar cada paquete de audio para detectar el código, evitando el flujo directo de medios entre los puntos finales.

source: Enabling this record mode highly affects the performance of the platform. Use at your own risk.
es: Habilitar este modo de grabación afecta en gran medida el rendimiento de la plataforma. Úselo bajo su propio riesgo.

source: Recordings list
es: Lista de grabaciones

source: The *client administrator* can access to all the recordings in the section **Client configuration** > **Calls** > **Call recordings**:
es: El *administrador del cliente* puede acceder a todas las grabaciones en la sección **Configuración del cliente** > **Llamadas** > **Grabaciones de llamadas**:

source: Recordings can be heard from the *web* or downloaded in MP3 format.
es: Las grabaciones se pueden escuchar desde la *web* o descargar en formato MP3.

source: If the recording has been started on demand, it will also include the user that requested it.
es: Si la grabación se ha iniciado bajo demanda, también incluirá al usuario que la solicitó.

source: Recording removal button is shown only if **Allow Client to remove recordings** is enabled for the client in *Client configuration*.
es: El botón de eliminación de grabaciones se muestra solo si **Permitir al cliente eliminar grabaciones** está habilitado para el cliente en *Configuración del cliente*.
