Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_tools/external_call_filters.po
Languages: es

source: External call filters
es: Filtros de llamadas externas

source: One of the most common task a client's administrator will do is to configure schedules and calendars to apply to existing :ref:`ddis`.
es: Una de las tareas más comunes que realizará el administrador de un cliente es configurar horarios y calendarios para aplicarlos a los :ref:`DDIs <ddis>` existentes.

source: Once we have our new created :ref:`Schedules` and :ref:`Calendars`, it's time to apply them in what we call **External call filter**.
es: Una vez que tengamos nuestros nuevos :ref:`Horarios <Schedules>` y :ref:`Calendarios <Calendars>` creados, es hora de aplicarlos en lo que llamamos **Filtro de llamadas externas**.

source: The client admin can configure them in the following screen:
es: El administrador del cliente puede configurarlos en la siguiente pantalla:

source: Basic info
es: Información básica

source: Name
es: Nombre

source: Descriptive name that will reference this filter in DDIs configuration.
es: Nombre descriptivo que hará referencia a este filtro en la configuración de DDIs.

source: Welcome locution
es: Locución de bienvenida

source: This locution will be played if the call is not going to be forwarded by out of schedule or holiday filtering (in other words if the normal routing of the DDI is going to be applied).
es: Esta locución se reproducirá si la llamada no va a ser desviada por filtros fuera de horario o festivos (en otras palabras, si se va a aplicar el enrutamiento normal del DDI).

source: Filtering info
es: Información de filtrado

source: White list
es: Lista blanca

source: External origin will be checked against the associated :ref:`match_lists`, if a coincidence is found, the call will be directly routed to the DDI destination, skipping the filter process. Take into account that black listed are checked before white lists.
es: El origen externo se verificará contra las :ref:`listas de coincidencia <match_lists>` asociadas, si se encuentra una coincidencia, la llamada se enruta directamente al destino DDI, saltando el proceso de filtrado. Ten en cuenta que las listas negras se verifican antes que las listas blancas.

source: Black list
es: Lista negra

source: External origin will be checked against the associated :ref:`match_lists`, if a coincidence is found, the call will be rejected immediately.
es: El origen externo se verificará contra las :ref:`listas de coincidencia <match_lists>` asociadas, si se encuentra una coincidencia, la llamada será rechazada inmediatamente.

source: Holidays configuration
es: Configuración de festivos

source: Holiday enabled
es: Festivos habilitados

source: Set this to no to totally ignore holidays filtering.
es: Configura esto en no para ignorar completamente el filtrado de festivos.

source: Calendars
es: Calendarios

source: One or more :ref:`calendars` can be associated with the filter. The combination of all the calendars will be applied.
es: Uno o más :ref:`calendarios <calendars>` pueden asociarse con el filtro. Se aplicará la combinación de todos los calendarios.

source: Holiday locution
es: Locución de festivo

source: The locution will be played when the day is marked as holiday in any of the calendars associated with the filter **if the calendar entry has no locution** for that day.
es: La locución se reproducirá cuando el día esté marcado como festivo en cualquiera de los calendarios asociados con el filtro **si la entrada del calendario no tiene locución** para ese día.

source: Holiday target type
es: Tipo de destino festivo

source: After playing the above locution (if configured), call can be forwarded to a voicemail, external number or internal extension. For example, the filter of the image will redirect calls during holidays to the external number 676 676 676.
es: Después de reproducir la locución anterior (si está configurada), la llamada puede ser desviada a un buzón de voz, número externo o extensión interna. Por ejemplo, el filtro de la imagen redirigirá las llamadas durante los festivos al número externo 676 676 676.

source: Out of schedule configuration
es: Configuración fuera de horario

source: Out of schedule enabled
es: Fuera de horario habilitado

source: Set this to no to totally ignore out of schedule filtering.
es: Configura esto en no para ignorar completamente el filtrado fuera de horario.

source: Schedules
es: Horarios

source: One or more :ref:`schedules` can be applied. The combination of all the time gaps defined in the schedules will be applied.
es: Se pueden aplicar uno o más :ref:`horarios <schedules>`. Se aplicará la combinación de todos los intervalos de tiempo definidos en los horarios.

source: Out of schedule locution
es: Locución fuera de horario

source: The locution will be played when, not being holiday, the current time is not in any of the time gaps defined in the schedules assigned to the filter.
es: La locución se reproducirá cuando, no siendo festivo, la hora actual no esté en ninguno de los intervalos de tiempo definidos en los horarios asignados al filtro.

source: Out of schedule target type
es: Tipo de destino fuera de horario

source: Like in the holidays forward, but for out of schedule. The image above won't apply any forward (and the call will be hung up).
es: Como en el desvío de festivos, pero para fuera de horario. La imagen anterior no aplicará ningún desvío (y la llamada se colgará).

source: Holidays are processed **before** out of schedule events.
es: Los festivos se procesan **antes** de los eventos fuera de horario.

source: In the next section we will use this new created filter with :ref:`ddis` so we can configure a welcome locution for normal days, and especial behaviours for holidays and out of schedule events.
es: En la siguiente sección utilizaremos este nuevo filtro creado con :ref:`DDIs <ddis>` para que podamos configurar una locución de bienvenida para los días normales, y comportamientos especiales para los festivos y eventos fuera de horario.
