Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_tools/route_locks.po
Languages: es

source: Route locks
es: Candados de ruta

source: Route locks are a simple but powerful way to fork route logics when delivering calls. This fork is done depending on the state of the lock on a particular moment:
es: Los candados de ruta son una forma simple pero poderosa de bifurcar las lógicas de ruta al entregar llamadas. Esta bifurcación se realiza dependiendo del estado del candado en un momento particular:

source: **Opened**: green light, go ahead.
es: **Abierto**: luz verde, adelante.

source: **Closed**: red light, no trespassing allowed.
es: **Cerrado**: luz roja, no se permite el paso.

source: They are used as conditional route rule criteria (see how in :ref:`conditional_routes`).
es: Se utilizan como criterios de reglas de ruta condicional (ver cómo en :ref:`rutas_condicionales <conditional_routes>`).

source: Route lock creation
es: Creación de candado de ruta

source: When you add a new route lock in **Route Locks** section, you are asked for the following fields:
es: Cuando agregas un nuevo candado de ruta en la sección **Candados de ruta**, se te pedirá que completes los siguientes campos:

source: Name
es: Nombre

source: This name will be used in conditional routes to identify the lock.
es: Este nombre se utilizará en rutas condicionales para identificar el candado.

source: Description
es: Descripción

source: Just a description.
es: Solo una descripción.

source: Status
es: Estado

source: Set the initial status of the lock: opened or closed.
es: Establece el estado inicial del candado: abierto o cerrado.

source: Route locks service codes
es: Códigos de servicio de candados de ruta

source: Although you can set the initial lock status on creation and change it using the admin portal too, the usual way to handle the status changes of a lock is to use the service codes listed in **Route locks** section.
es: Aunque puedes establecer el estado inicial del candado al crearlo y cambiarlo también usando el portal de administración, la forma habitual de manejar los cambios de estado de un candado es usar los códigos de servicio listados en la sección **Candados de ruta**.

source: These services codes have two parts:
es: Estos códigos de servicio tienen dos partes:

source: **Service code**: configured in **Services** section per brand/client.
es: **Código de servicio**: configurado en la sección **Servicios** por marca/cliente.

source: **Lock id**: immutable numeric id assigned to each lock.
es: **ID del candado**: ID numérico inmutable asignado a cada candado.

source: There are 3 service codes available for most common operations on locks:
es: Hay 3 códigos de servicio disponibles para las operaciones más comunes en candados:

source: Open Lock
es: Abrir candado

source: Close Lock
es: Cerrar candado

source: Toggle Lock.
es: Alternar candado.

source: Read :ref:`services` for further details.
es: Lee :ref:`servicios <services>` para más detalles.
