Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/calls/call_csv_schedulers.po
Languages: es

source: Call CSV schedulers
es: Programadores de CSV de llamadas

source: This section allows programming automatic periodical CSV reports to brand operators.
es: Esta sección permite programar informes CSV periódicos automáticos para los operadores de marca.

source: This section is almost identical to :ref:`Invoice schedulers` except to the fields that do not apply to CSVs (Invoice number sequence, Tax rate...)
es: Esta sección es casi idéntica a :ref:`Programadores de facturas <Invoice schedulers>` excepto por los campos que no se aplican a los CSV (secuencia de número de factura, tasa de impuesto...)

source: When adding a new definition, these fields are shown:
es: Al agregar una nueva definición, se muestran estos campos:

source: Name
es: Nombre

source: Name of the scheduled Call CSV
es: Nombre del CSV de llamadas programado

source: Email
es: Correo electrónico

source: Send generated Call CSV via email. Empty if no automatic mail is wanted.
es: Enviar el CSV de llamadas generado por correo electrónico. Vacío si no se desea correo automático.

source: Client type
es: Tipo de cliente

source: Selecting *All* will generate a CSV containing calls of all clients. Selecting one client type will allow selecting one specific client of that type.
es: Seleccionar *Todos* generará un CSV que contiene llamadas de todos los clientes. Seleccionar un tipo de cliente permitirá seleccionar un cliente específico de ese tipo.

source: Notification template
es: Plantilla de notificación

source: Used on email notifications for schedulers containing calls of all clients. In client specific schedulers, the notification template assigned to the specific client will be used.
es: Utilizado en notificaciones por correo electrónico para programadores que contienen llamadas de todos los clientes. En programadores específicos de clientes, se utilizará la plantilla de notificación asignada al cliente específico.

source: Frequency/Unit
es: Frecuencia/Unidad

source: Defines the frequency (once a month, every 7 days, etc.) of the programmed task
es: Define la frecuencia (una vez al mes, cada 7 días, etc.) de la tarea programada

source: Direction
es: Dirección

source: Defines which calls should be included attending to its direction (inbound, outbound, both).
es: Define qué llamadas deben incluirse según su dirección (entrante, saliente, ambas).

source: Only for *Direction: outbound* reports, allows filtering calls of one specific carrier.
es: Solo para informes de *Dirección: saliente*, permite filtrar llamadas de un carrier específico.

source: Client
es: Cliente

source: Only for *Client type* different from *All*, allows selecting one specific client of chosen type.
es: Solo para *Tipo de cliente* diferente de *Todos*, permite seleccionar un cliente específico del tipo elegido.

source: Lists all DDIs of chosen client to get only calls from/to that specific DDI.
es: Lista todos los DDI del cliente elegido para obtener solo llamadas desde/hacia ese DDI específico.

source: Endpoint type
es: Tipo de punto final

source: Allows selecting one specific endpoint type of chosen client. Depending on client type, different values will be listed.
es: Permite seleccionar un tipo de punto final específico del cliente elegido. Dependiendo del tipo de cliente, se listarán diferentes valores.

source: Residential device
es: Dispositivo residencial

source: Only for *Client type: residential* and *Endpoint type: residential device*, allows selecting one specific residential device of chosen client.
es: Solo para *Tipo de cliente: residencial* y *Tipo de punto final: dispositivo residencial*, permite seleccionar un dispositivo residencial específico del cliente elegido.

source: Retail account
es: Cuenta minorista

source: Only for *Client type: retail*, allows selecting one specific retail account of chosen client.
es: Solo para *Tipo de cliente: minorista*, permite seleccionar una cuenta minorista específica del cliente elegido.

source: User
es: Usuario

source: Only for *Client type: vpbx* and *Endpoint type: user*, allows selecting one specific user of chosen client.
es: Solo para *Tipo de cliente: vpbx* y *Tipo de punto final: usuario*, permite seleccionar un usuario específico del cliente elegido.

source: Only for *Client type: vpbx/residential* and *Endpoint type: fax*, allows selecting one specific fax of chosen client.
es: Solo para *Tipo de cliente: vpbx/residencial* y *Tipo de punto final: fax*, permite seleccionar un fax específico del cliente elegido.

source: Friend
es: Amigo

source: Only for *Client type: vpbx* and *Endpoint type: friend*, allows selecting one specific friend of chosen client.
es: Solo para *Tipo de cliente: vpbx* y *Tipo de punto final: amigo*, permite seleccionar un amigo específico del cliente elegido.

source: Once created, some new fields and subsections are accesible:
es: Una vez creado, algunos campos y subsecciones nuevos son accesibles:

source: Next execution
es: Próxima ejecución

source: Shows next execution date
es: Muestra la fecha de la próxima ejecución

source: Last execution
es: Última ejecución

source: Shows last execution and its result.
es: Muestra la última ejecución y su resultado.

source: Modifying *Next execution* value allows forcing specific runs. For example, setting *Next execution* to current month's first day will create again last month's CSV report (for a monthly scheduler).
es: Modificar el valor de *Próxima ejecución* permite forzar ejecuciones específicas. Por ejemplo, configurar *Próxima ejecución* al primer día del mes actual creará nuevamente el informe CSV del mes pasado (para un programador mensual).

source: Generated CSVs of each scheduler can be accessed in **List of Call CSV reports** subsection.
es: Los CSV generados de cada programador se pueden acceder en la subsección **Lista de informes CSV de llamadas**.

source: CSV fields
es: Campos CSV

source: These are the fields of the generated CSV files:
es: Estos son los campos de los archivos CSV generados:

source: Call-ID of the SIP dialog
es: Call-ID del diálogo SIP

source: startTime
es: Hora de inicio

source: Time and date of the call establishment
es: Hora y fecha del establecimiento de la llamada

source: duration
es: duración

source: Call duration in seconds
es: Duración de la llamada en segundos

source: caller
es: llamante

source: Caller number in E.164 format (with '+')
es: Número del llamante en formato E.164 (con '+')

source: callee
es: llamado

source: Callee number in E.164 format (with '+')
es: Número del llamado en formato E.164 (con '+')

source: cost
es: costo

source: Calculated cost for the given call
es: Costo calculado para la llamada dada

source: price
es: precio

source: Calculated price for the given call
es: Precio calculado para la llamada dada

source: endpointType
es: tipo de punto final

source: Possible values: RetailAccount, ResidentialDevice, User, Fax, Friend.
es: Valores posibles: RetailAccount, ResidentialDevice, User, Fax, Friend.

source: endpointId
es: ID del punto final

source: Internal ID of specific endpoint (only when *endpointType* is non-empty).
es: ID interno del punto final específico (solo cuando *endpointType* no está vacío).

source: endpointName
es: Nombre del punto final

source: User extension, friend name, fax name, retail account name or residential device name (only when *endpointId* is non-empty).
es: Extensión de usuario, nombre del amigo, nombre del fax, nombre de la cuenta minorista o nombre del dispositivo residencial (solo cuando *endpointId* no está vacío).

source: direction
es: dirección

source: Possible values: inbound, outbound.
es: Valores posibles: entrante, saliente.

source: companyId
es: ID de la empresa

source: Client ID
es: ID del cliente

source: carrierId
es: ID del carrier

source: Only for outbound calls, internal ID of used carrier
es: Solo para llamadas salientes, ID interno del carrier utilizado

source: ddiProviderId
es: ID del proveedor de DDI

source: Only for inbound calls, internal ID of used DDI Provider
es: Solo para llamadas entrantes, ID interno del proveedor de DDI utilizado

source: ddiId
es: ID del DDI

source: Client DDI to which call will be assigned (callee for inbound calls, caller for outbound calls). Empty for wholesale clients.
es: DDI del cliente al que se asignará la llamada (llamado para llamadas entrantes, llamante para llamadas salientes). Vacío para clientes mayoristas.

source: DDI Provider detection
es: Detección del proveedor de DDI

source: DDI Provider detection deserves a deeper explanation as is not as unambiguous as Carrier (carrier is the one chosen by routing logic, no doubt here).
es: La detección del proveedor de DDI merece una explicación más profunda ya que no es tan inequívoca como el Carrier (el carrier es el elegido por la lógica de enrutamiento, no hay duda aquí).

source: DDI Provider detection logic is directly related to underlying DDI detection logic.
es: La lógica de detección del proveedor de DDI está directamente relacionada con la lógica de detección de DDI subyacente.

source: When IvozProvider receives an INVITE to KamTrunks from an outside entity:
es: Cuando IvozProvider recibe una INVITACIÓN a KamTrunks de una entidad externa:

source: Source IP is compared against all DDI Providers addresses (from all brands).
es: La IP de origen se compara con todas las direcciones de los proveedores de DDI (de todas las marcas).

source: If none matches, call is rejected.
es: Si ninguno coincide, la llamada es rechazada.

source: DDI is transformated in a loop using matching DDI Providers transformation rules (the lower id, the first).
es: El DDI se transforma en un bucle utilizando las reglas de transformación de los proveedores de DDI coincidentes (el id más bajo, el primero).

source: As soon as transformated DDI matches a DDI (in E.164) within the same brand, loop ends and call is accepted.
es: Tan pronto como el DDI transformado coincide con un DDI (en E.164) dentro de la misma marca, el bucle termina y la llamada es aceptada.

source: If loop ends without any match, call is rejected.
es: Si el bucle termina sin ninguna coincidencia, la llamada es rechazada.

source: The DDI Provider that allowed that match is saved as DDI Provider for that inbound all, except:
es: El proveedor de DDI que permitió esa coincidencia se guarda como proveedor de DDI para esa llamada entrante, excepto:

source: Matched DDI is linked to another DDI Provider that also matches source IP address. If this happens, linked DDI Provider is saved instead.
es: El DDI coincidente está vinculado a otro proveedor de DDI que también coincide con la dirección IP de origen. Si esto sucede, el proveedor de DDI vinculado se guarda en su lugar.

source: Using CSV scheduler as a one-shot CSV generator
es: Usar el programador de CSV como un generador de CSV de una sola vez

source: *External Calls* section can filter list and export resulting rows to CSV, but filter criteria are much powerful in *Call CSV schedulers* section.
es: La sección *Llamadas externas* puede filtrar la lista y exportar las filas resultantes a CSV, pero los criterios de filtrado son mucho más poderosos en la sección *Programadores de CSV de llamadas*.

source: That's why **it could be useful to use this section even if we are not interested in scheduling any recurring CSV**.
es: Es por eso que **podría ser útil usar esta sección incluso si no estamos interesados en programar ningún CSV recurrente**.

source: Scheduling a CSV to generate just a CSV could be useful as *Call CSV Schedulers* have more filtering criteria than *External Calls* section.
es: Programar un CSV para generar solo un CSV podría ser útil ya que *Programadores de CSV de llamadas* tienen más criterios de filtrado que la sección *Llamadas externas*.

source: Imagine you need:
es: Imagina que necesitas:

source: Start date: 2020/06/02 (included)
es: Fecha de inicio: 2020/06/02 (incluida)

source: End date: 2020/06/14 (included)
es: Fecha de finalización: 2020/06/14 (incluida)

source: Client: XXX (vpbx)
es: Cliente: XXX (vpbx)

source: Inbound calls to YYY DDI answered by user ZZZ
es: Llamadas entrantes al DDI YYY respondidas por el usuario ZZZ

source: To achieve such a CSV using schedules section we would **create a scheduler** with these inputs:
es: Para lograr un CSV así usando la sección de programadores, **crearíamos un programador** con estos datos:

source: Client Type: vpbx
es: Tipo de cliente: vpbx

source: Client: XXX
es: Cliente: XXX

source: Endpoint Type: user
es: Tipo de punto final: usuario

source: User: ZZZ
es: Usuario: ZZZ

source: Direction: inbound.
es: Dirección: entrante.

source: Unit: days.
es: Unidad: días.

source: Frequency: 13
es: Frecuencia: 13

source: Get sure you set *Unit* to days and *Frequency* to the amount of days wanted in resulting CSV. In the example, from 2nd of June to 14th, both included, we have 13 days.
es: Asegúrate de configurar *Unidad* en días y *Frecuencia* en la cantidad de días deseados en el CSV resultante. En el ejemplo, del 2 de junio al 14, ambos incluidos, tenemos 13 días.

source: Once generated, we would **edit Next execution time** from tomorrow's date to 2020/06/15, leaving time unchanged.
es: Una vez generado, **editaríamos la hora de la próxima ejecución** de la fecha de mañana a 2020/06/15, dejando la hora sin cambios.

source: Get sure you modify *Next execution* to the first day not wanted in resulting CSV.
es: Asegúrate de modificar *Próxima ejecución* al primer día no deseado en el CSV resultante.

source: Then we will **wait a few minutes** until scheduler generates our CSV, **download** it and **delete the row to avoid recurrent CSV generation**.
es: Luego **esperaremos unos minutos** hasta que el programador genere nuestro CSV, **lo descargaremos** y **eliminaremos la fila para evitar la generación recurrente de CSV**.
