Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/invoicing/invoice_schedulers.po
Languages: es

source: Invoice schedulers
es: Programadores de facturas

source: This section allows programming the automatic periodical creation of invoices.
es: Esta sección permite programar la creación automática y periódica de facturas.

source: When adding a new definition, these fields are shown:
es: Al agregar una nueva definición, se muestran estos campos:

source: Name
es: Nombre

source: Name of the scheduled invoice
es: Nombre de la factura programada

source: Client
es: Cliente

source: Which client calls should be included
es: Qué llamadas de clientes deben ser incluidas

source: Email
es: Correo electrónico

source: Send generated invoices via email. Empty if no automatic mail is wanted.
es: Enviar facturas generadas por correo electrónico. Vacío si no se desea correo automático.

source: Frequency/Unit
es: Frecuencia/Unidad

source: Defines the frequency (once a month, every 7 days, etc.) of the programmed task
es: Define la frecuencia (una vez al mes, cada 7 días, etc.) de la tarea programada

source: Invoice number sequence
es: Secuencia de número de factura

source: Scheduled invoices will use the next invoice number available in a given predefined sequence
es: Las facturas programadas usarán el siguiente número de factura disponible en una secuencia predefinida

source: Call discount
es: Descuento de llamadas

source: Percentage to discount calls, prior to tax rate calculation. No effect on fixed concepts.
es: Porcentaje para descontar llamadas, antes del cálculo de la tasa de impuestos. Sin efecto en conceptos fijos.

source: Tax rate
es: Tasa de impuestos

source: Taxes to add to the final cost (e.g. VAT)
es: Impuestos a añadir al costo final (por ejemplo, IVA)

source: Invoices generated due to a schedule can be seen in two ways:
es: Las facturas generadas debido a una programación se pueden ver de dos maneras:

source: In each row of *Invoice schedulers* section, **List of Invoices** option.
es: En cada fila de la sección *Programadores de facturas*, opción **Lista de Facturas**.

source: In *Invoices* section, indistinguishable to manually generated invoices.
es: En la sección *Facturas*, indistinguibles de las facturas generadas manualmente.

source: Fixed costs
es: Costos fijos

source: When defining a scheduled invoice, you can add fixed costs in a static or dynamic way:
es: Al definir una factura programada, puede agregar costos fijos de manera estática o dinámica:

source: Type **'static'** is used for fixed quantities.
es: El tipo **'estático'** se usa para cantidades fijas.

source: Type **'Max calls'** sets the quantity in the moment of the creation of the invoice to "Max calls" value of the client in that specific moment.
es: El tipo **'Máximo de llamadas'** establece la cantidad en el momento de la creación de la factura al valor de "Máximo de llamadas" del cliente en ese momento específico.

source: Type **'DDIs'** sets the quantity in the moment of the creation of the invoice to the number of DDIS matching criteria (all, national, international or belonging to specific country) in the client in that specific moment.
es: El tipo **'DDIs'** establece la cantidad en el momento de la creación de la factura al número de DDIs que cumplen con los criterios (todos, nacionales, internacionales o pertenecientes a un país específico) en el cliente en ese momento específico.

source: Non-static values are retrieved from client configuration in the date specified in "Next execution". Regenerating the invoice later will not modify assigned value, but you can adapt it manually to the desired value editing the fixed cost in Invoice section and regenerating the invoice.
es: Los valores no estáticos se recuperan de la configuración del cliente en la fecha especificada en "Próxima ejecución". Regenerar la factura más tarde no modificará el valor asignado, pero puede adaptarlo manualmente al valor deseado editando el costo fijo en la sección de Facturas y regenerando la factura.

source: Frequency definition
es: Definición de frecuencia

source: It is interesting to understand how *Frequency* and *Unit* fields define the periodical task:
es: Es interesante entender cómo los campos *Frecuencia* y *Unidad* definen la tarea periódica:

source: Invoices are programmed at 08:00:00 by default on mondays, 1st of month or 1st of January (depending on Unit value).
es: Las facturas se programan a las 08:00:00 por defecto los lunes, el 1er día del mes o el 1 de enero (dependiendo del valor de la Unidad).

source: Once created a new schedule, **Next execution** shows when will happen next invoice generation.
es: Una vez creado un nuevo horario, **Próxima ejecución** muestra cuándo ocurrirá la próxima generación de facturas.

source: **Next execution** value can be mangled, but generated invoice always will:
es: El valor de **Próxima ejecución** puede ser manipulado, pero la factura generada siempre:

source: Discard current day (2018/11/01 08:00:00 will set 2018/10/31 23:59:59 as *Out date*).
es: Descartar el día actual (2018/11/01 08:00:00 establecerá 2018/10/31 23:59:59 como *Fecha de salida*).

source: *In date* will be *out date* minus X week(s), X month(s) or X year(s) (X equals to *Frequency* value) + 1 second.
es: *Fecha de entrada* será *fecha de salida* menos X semana(s), X mes(es) o X año(s) (X igual al valor de *Frecuencia*) + 1 segundo.

source: Example 1: Unit: week - Frequency 2
es: Ejemplo 1: Unidad: semana - Frecuencia 2

source: Next execution will be set to next monday at 08:00 and invoices will include calls of last 2 weeks.
es: La próxima ejecución se establecerá para el próximo lunes a las 08:00 y las facturas incluirán llamadas de las últimas 2 semanas.

source: Example 1: Unit: month - Frequency 3
es: Ejemplo 1: Unidad: mes - Frecuencia 3

source: Next execution will be set to next 1st of month at 08:00 and invoices will include calls of last 3 months.
es: La próxima ejecución se establecerá para el próximo 1er día del mes a las 08:00 y las facturas incluirán llamadas de los últimos 3 meses.

source: Example 1: Unit: month - Frequency 1 - Next execution mangling
es: Ejemplo 1: Unidad: mes - Frecuencia 1 - Manipulación de próxima ejecución

source: Next execution will be set to next 1st of month at 08:00 but we mangle it to 3rd of month at 10:00:00.
es: La próxima ejecución se establecerá para el próximo 1er día del mes a las 08:00 pero la manipulamos al 3er día del mes a las 10:00:00.

source: Invoice will include calls from 3nd of previous month at 00:00:00 to 2nd to current month at 23:59:59.
es: La factura incluirá llamadas desde el 3er día del mes anterior a las 00:00:00 hasta el 2do día del mes actual a las 23:59:59.

source: *Last execution* shows the date of last execution and its result (success/error).
es: *Última ejecución* muestra la fecha de la última ejecución y su resultado (éxito/error).

source: Both *next execution* and *last execution* are shown using brand timezone.
es: Tanto *próxima ejecución* como *última ejecución* se muestran usando la zona horaria de la marca.
