Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/invoicing/invoice_number_sequences.po
Languages: es

source: Invoice number sequences
es: Secuencias de números de factura

source: In order to allow programming automatic invoice generation using :ref:`Invoice schedulers` section, invoice numbers must be created using a defined sequence number.
es: Para permitir la programación de la generación automática de facturas usando la sección :ref:`Programadores de facturas <Invoice schedulers>`, los números de factura deben crearse usando una secuencia de números definida.

source: This section allows brand operator to create as many sequences as needed filling these fields:
es: Esta sección permite al operador de la marca crear tantas secuencias como sea necesario llenando estos campos:

source: Name
es: Nombre

source: Used for referencing this sequence in Invoice generation window.
es: Usado para referenciar esta secuencia en la ventana de generación de facturas.

source: Prefix
es: Prefijo

source: Prepended in any number generated by this sequence.
es: Precedido en cualquier número generado por esta secuencia.

source: Sequence length
es: Longitud de la secuencia

source: Zeroes will be prepended to enforce this length.
es: Se añadirán ceros para cumplir con esta longitud.

source: Increment
es: Incremento

source: Units between subsequent invoice numbers.
es: Unidades entre números de factura consecutivos.

source: Invoice number sequences are mandatory for scheduled invoices and optional for manual invoices.
es: Las secuencias de números de factura son obligatorias para las facturas programadas y opcionales para las facturas manuales.

source: Example (prefix: TEST, sequence length: 4, increment: 1)
es: Ejemplo (prefijo: TEST, longitud de secuencia: 4, incremento: 1)

source: Generated sequence numbers will be: TEST0001, TEST0002, TEST0003 and so on.
es: Los números de secuencia generados serán: TEST0001, TEST0002, TEST0003 y así sucesivamente.

source: **Latest value** field shows the value of last invoice number that used a given sequence.
es: El campo **Último valor** muestra el valor del último número de factura que usó una secuencia dada.
