Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/invoicing/invoices.po
Languages: es

source: Invoices
es: Facturas

source: **Invoices** section lets **brand operator** generate invoices to issue to its clients and lists all invoices of all clients, no matter if they were generated automatically or manually.
es: La sección de **Facturas** permite al **operador de la marca** generar facturas para emitir a sus clientes y listar todas las facturas de todos los clientes, sin importar si fueron generadas automáticamente o manualmente.

source: Brand administrators can also enable view mode on this section to their clients. Check Client's Invoice data configuration section for more information.
es: Los administradores de la marca también pueden habilitar el modo de vista en esta sección para sus clientes. Consulte la sección de configuración de datos de facturas del cliente para más información.

source: Generating a new invoice
es: Generando una nueva factura

source: These are the fields shown when *Add Invoice* options is used:
es: Estos son los campos que se muestran cuando se usa la opción *Agregar Factura*:

source: Invoice number sequence
es: Secuencia de número de factura

source: Use next number of a predefined sequence or use custom number
es: Usar el siguiente número de una secuencia predefinida o usar un número personalizado

source: Number
es: Número

source: Only shown if no sequence number is used, lets brand operator to introduce a custom number
es: Solo se muestra si no se usa un número de secuencia, permite al operador de la marca introducir un número personalizado

source: Client
es: Cliente

source: The client whose calls will be invoiced
es: El cliente cuyas llamadas serán facturadas

source: Template
es: Plantilla

source: Invoice template that will be used to generate the PDF invoice file
es: Plantilla de factura que se usará para generar el archivo PDF de la factura

source: In/Out date
es: Fecha de entrada/salida

source: The time period of the calls that will be invoiced
es: El período de tiempo de las llamadas que serán facturadas

source: Call discount
es: Descuento de llamadas

source: Percentage to discount calls, prior to tax rate calculation. No effect on fixed concepts.
es: Porcentaje para descontar llamadas, antes del cálculo de la tasa de impuestos. Sin efecto en conceptos fijos.

source: Tax rate
es: Tasa de impuestos

source: Taxes to add to the final cost (e.g. VAT)
es: Impuestos a añadir al costo final (por ejemplo, IVA)

source: Once saved, some :ref:`fixed costs` can be added before generating the final invoice. This is achieved with **Fixed costs** subsection, that allows adding several positive concepts to the invoice:
es: Una vez guardado, se pueden añadir algunos :ref:`costos fijos <fixed costs>` antes de generar la factura final. Esto se logra con la subsección de **Costos fijos**, que permite añadir varios conceptos positivos a la factura:

source: Fixed cost
es: Costo fijo

source: Choose a predefined cost
es: Elegir un costo predefinido

source: Quantity
es: Cantidad

source: How many of this must be included
es: Cuántos de estos deben ser incluidos

source: The last step is pressing **Generate invoice** suboption to create the final PDF. Afterwards, we can see which calls have been included in a particular invoice with **List of External Calls** option or download the PDF file.
es: El último paso es presionar la subopción **Generar factura** para crear el PDF final. Después, podemos ver qué llamadas se han incluido en una factura particular con la opción **Lista de Llamadas Externas** o descargar el archivo PDF.

source: Only outbound external calls are included into invoices
es: Solo las llamadas externas salientes se incluyen en las facturas

source: **Status** column shows if the PDF generation task is waiting for async worker (*waiting*), in process (*processing*), ended with errors (*failed*) or ended successfully (*created*). On blank, *Generate invoice* needs to be pressed.
es: La columna **Estado** muestra si la tarea de generación de PDF está esperando por el trabajador asíncrono (*esperando*), en proceso (*procesando*), terminó con errores (*fallido*) o terminó exitosamente (*creado*). En blanco, se debe presionar *Generar factura*.

source: Rules
es: Reglas

source: Invoice subsystem enforces several rules before generating a new invoice:
es: El subsistema de facturación aplica varias reglas antes de generar una nueva factura:

source: **Proper date interval**: *out date* must be bigger (after) than *in date*.
es: **Intervalo de fechas adecuado**: la *fecha de salida* debe ser mayor (después) que la *fecha de entrada*.

source: **Out date must be previous than today**: Future dates or today's calls cannot be invoiced.
es: **La fecha de salida debe ser anterior a hoy**: No se pueden facturar fechas futuras o las llamadas de hoy.

source: **One call, one invoice:** All calls in time interval cannot be included in any other invoice.
es: **Una llamada, una factura:** Todas las llamadas en el intervalo de tiempo no pueden ser incluidas en ninguna otra factura.

source: **All calls in interval must be billed**.
es: **Todas las llamadas en el intervalo deben ser facturadas**.

source: If any of these rules is not fulfilled, the invoice won't be created and the system will warn.
es: Si alguna de estas reglas no se cumple, la factura no se creará y el sistema advertirá.

source: Timezones
es: Zonas horarias

source: *In date* and *Out date* will be interpreted using brand timezone. On the other hand, call times in invoices are converted to client timezone, leading to situations like this:
es: La *fecha de entrada* y la *fecha de salida* se interpretarán usando la zona horaria de la marca. Por otro lado, los tiempos de las llamadas en las facturas se convierten a la zona horaria del cliente, llevando a situaciones como esta:

source: *In date*: 01/10/2018 00:00:00
es: *Fecha de entrada*: 01/10/2018 00:00:00

source: *Out date*: 31/10/2018 23:59:59
es: *Fecha de salida*: 31/10/2018 23:59:59

source: Brand timezone: UTC + 1
es: Zona horaria de la marca: UTC + 1

source: Client timezone: UTC - 1
es: Zona horaria del cliente: UTC - 1

source: Time interval in brand timezone: 01/10/2018 00:00 - 31/10/2018 23:59:59
es: Intervalo de tiempo en la zona horaria de la marca: 01/10/2018 00:00 - 31/10/2018 23:59:59

source: Time interval in client timezone: 30/09/2018 22:00 - 31/10/2018 21:59:59
es: Intervalo de tiempo en la zona horaria del cliente: 30/09/2018 22:00 - 31/10/2018 21:59:59

source: Invoice generated for the client will have calls from 30nd of september at 22:00 to 31st of october at 21:59:59, which may seem awkward to the client.
es: La factura generada para el cliente tendrá llamadas desde el 30 de septiembre a las 22:00 hasta el 31 de octubre a las 21:59:59, lo que puede parecer extraño para el cliente.

source: Regenerating an existing invoice
es: Regenerando una factura existente

source: Brand operator can edit any invoice parameter (as long as rules above are fulfilled), add/remove fixed concepts, etc. and press **Generate invoice** again.
es: El operador de la marca puede editar cualquier parámetro de la factura (siempre que se cumplan las reglas anteriores), añadir/eliminar conceptos fijos, etc. y presionar **Generar factura** nuevamente.

source: Whenever a change is made, *Status* column will change to blank to show that *Generate invoice* must be pressed.
es: Cada vez que se realice un cambio, la columna *Estado* cambiará a blanco para mostrar que se debe presionar *Generar factura*.

source: Generate invoice for rerated calls
es: Generar factura para llamadas revaloradas

source: If rating of any call included in an invoice is wrong, :ref:`External Calls` section allows rerating it, as long as the invoice that includes the call is previously deleted.
es: Si la valoración de alguna llamada incluida en una factura es incorrecta, la sección :ref:`Llamadas Externas <External Calls>` permite revalorarla, siempre que la factura que incluye la llamada se elimine previamente.

source: Once deleted and rerated, a new row can be added in *Invoices* section to include rerated calls.
es: Una vez eliminada y revalorada, se puede añadir una nueva fila en la sección *Facturas* para incluir las llamadas revaloradas.

source: List of external calls
es: Lista de llamadas externas

source: You can see calls of a given invoice using this option. You will see the same fields as in :ref:`External calls`.
es: Puede ver las llamadas de una factura dada usando esta opción. Verá los mismos campos que en :ref:`Llamadas Externas <External calls>`.

source: It is compulsory to have **a valid brand URL** in order to use *Export to CSV* feature in this subsection.
es: Es obligatorio tener **una URL de marca válida** para usar la función *Exportar a CSV* en esta subsección.
