Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/routing/outgoing_routings.po
Languages: es

source: Outgoing Routings
es: Enrutamientos Salientes

source: This is the main section in which routing policies are defined.
es: Esta es la sección principal en la que se definen las políticas de enrutamiento.

source: These are the fields that define an outgoing routing:
es: Estos son los campos que definen un enrutamiento saliente:

source: Client
es: Cliente

source: Should this route apply to all clients or just to one specific client?
es: ¿Debe esta ruta aplicarse a todos los clientes o solo a un cliente específico?

source: Routing Tag
es: Etiqueta de Enrutamiento

source: Routing tags allow clients to call to the same destination through different carriers. This field makes the route valid for just one routing tag (or for none).
es: Las etiquetas de enrutamiento permiten a los clientes llamar al mismo destino a través de diferentes transportistas. Este campo hace que la ruta sea válida para una sola etiqueta de enrutamiento (o para ninguna).

source: Call destination
es: Destino de la llamada

source: This groups allows selecting if this route applies for just one destination pattern, a group or faxes.
es: Este grupo permite seleccionar si esta ruta se aplica solo a un patrón de destino, un grupo o faxes.

source: Route type
es: Tipo de ruta

source: There are three kind of routes: static, LCR and block. In *static*, only one carrier is selected. In *LCR*, multiple carriers may be selected. In *block*, no carrier is selected as call will be dropped.
es: Hay tres tipos de rutas: estática, LCR y bloque. En *estática*, solo se selecciona un transportista. En *LCR*, se pueden seleccionar varios transportistas. En *bloque*, no se selecciona ningún transportista ya que la llamada será rechazada.

source: Priority
es: Prioridad

source: If a call matches several routes, it will be placed using the outgoing route with lower priority, as long as it is available.
es: Si una llamada coincide con varias rutas, se realizará utilizando la ruta saliente con menor prioridad, siempre que esté disponible.

source: Weight
es: Peso

source: If a call matches several routes with equal priority, weight will determine the proportion of calls that will use one route or another.
es: Si una llamada coincide con varias rutas con igual prioridad, el peso determinará la proporción de llamadas que utilizarán una ruta u otra.

source: Stopper
es: Detenedor

source: If a call matches a route marked as stopper, matching routes with higher priority will be ignored. **Matching routes with SAME priority route WILL apply**.
es: Si una llamada coincide con una ruta marcada como detenedor, se ignorarán las rutas coincidentes con mayor prioridad. **Las rutas coincidentes con la MISMA prioridad SÍ se aplicarán**.

source: Routing selection logic
es: Lógica de selección de enrutamiento

source: When a client A calls to a destination B:
es: Cuando un cliente A llama a un destino B:

source: *Apply to all clients* routes with B destination pattern are selected.
es: Se seleccionan rutas *Aplicar a todos los clientes* con el patrón de destino B.

source: *Apply to all clients* routes with group containing B destination are selected.
es: Se seleccionan rutas *Aplicar a todos los clientes* con grupo que contiene el destino B.

source: *Client A specific routes* routes with B destination pattern are selected.
es: Se seleccionan rutas *Específicas del cliente A* con el patrón de destino B.

source: *Client A specific routes* routes with group containing B destination are selected.
es: Se seleccionan rutas *Específicas del cliente A* con grupo que contiene el destino B.

source: All these routes are ordered using *Priority* (lower priority apply first).
es: Todas estas rutas se ordenan utilizando *Prioridad* (se aplica primero la menor prioridad).

source: If any Blocking route has been selected, call is dropped.
es: Si se ha seleccionado alguna ruta de bloqueo, la llamada se rechaza.

source: The route with lower priority (e.g. prio Y) marked as *Stopper* (if any), will cause discarding routes with priority greater than Y+1.
es: La ruta con menor prioridad (por ejemplo, prio Y) marcada como *Detenedor* (si la hay), provocará el descarte de rutas con prioridad mayor que Y+1.

source: Call will be routed using routes that remain after this process, priority will determine failover process, with will determine load balance (see below).
es: La llamada se enrutarán utilizando las rutas que queden después de este proceso, la prioridad determinará el proceso de conmutación por error, que determinará el equilibrio de carga (ver abajo).

source: As described above **All clients routes apply to all clients**, even if they have specific matching routes:
es: Como se describe arriba **Todas las rutas de clientes se aplican a todos los clientes**, incluso si tienen rutas coincidentes específicas:

source: Use priority and stopper routes to achieve *Clients with specific routes don't use All clients routes* routing strategy.
es: Utilice rutas de prioridad y detenedores para lograr la estrategia de enrutamiento *Clientes con rutas específicas no usan rutas de todos los clientes*.

source: If you want to achieve *Fallback for all clients* routing strategy, make sure you use high priority values.
es: Si desea lograr la estrategia de enrutamiento *Fallback para todos los clientes*, asegúrese de usar valores de alta prioridad.

source: Fax specific routes will apply first for both faxes sent via virtual faxing (see :ref:`faxes`) or T.38 capable devices. If no fax specific route is found for a given fax, routes will apply as for a normal voice call to that destination.
es: Las rutas específicas de fax se aplicarán primero tanto para los faxes enviados a través de fax virtual (ver :ref:`faxes`) o dispositivos compatibles con T.38. Si no se encuentra una ruta específica de fax para un fax determinado, las rutas se aplicarán como para una llamada de voz normal a ese destino.

source: Load balancing
es: Equilibrio de carga

source: Priority and weight, are key parameters to achieve two interesting features too: **load-balancing** and **failover-routes**.
es: La prioridad y el peso son parámetros clave para lograr dos características interesantes también: **equilibrio de carga** y **rutas de conmutación por error**.

source: *Load-balancing* lets us distribute calls matching the same pattern using several valid outgoing routes.
es: *Equilibrio de carga* nos permite distribuir llamadas que coinciden con el mismo patrón utilizando varias rutas salientes válidas.

source: Example 1
es: Ejemplo 1

source: Route A: priority 1, weight 1
es: Ruta A: prioridad 1, peso 1

source: Route B: priority 1, weight 1
es: Ruta B: prioridad 1, peso 1

source: Call matching these routes will use route A for %50 of the calls and route B for %50 of the calls.
es: Las llamadas que coincidan con estas rutas usarán la ruta A para el %50 de las llamadas y la ruta B para el %50 de las llamadas.

source: Example 2
es: Ejemplo 2

source: Route B: priority 1, weight 2
es: Ruta B: prioridad 1, peso 2

source: Call matching these routes will use route A for %33 of the calls and route B for %66 of the calls.
es: Las llamadas que coincidan con estas rutas usarán la ruta A para el %33 de las llamadas y la ruta B para el %66 de las llamadas.

source: Failover routes
es: Rutas de conmutación por error

source: Failover route lets us use another route whenever the main route fails.
es: La ruta de conmutación por error nos permite usar otra ruta cuando la ruta principal falla.

source: Example
es: Ejemplo

source: Route B: priority 2, weight 1
es: Ruta B: prioridad 2, peso 1

source: All calls matching these routes will try to use route A. In case the call fails, the call will be placed using route B.
es: Todas las llamadas que coincidan con estas rutas intentarán usar la ruta A. En caso de que la llamada falle, la llamada se realizará utilizando la ruta B.

source: Although given examples use two routes, more routes can be chained and failover and load-balancing strategies can be combined.
es: Aunque los ejemplos dados usan dos rutas, se pueden encadenar más rutas y se pueden combinar estrategias de conmutación por error y equilibrio de carga.

source: LCR routes
es: Rutas LCR

source: LCR (*Least Cost Routing*) routes may select more than one carrier. Whenever a LCR route is used, the platform will compute the call cost for that given destination (for a 5 minutes duration) and will order them in increasing order.
es: Las rutas LCR (*Enrutamiento de Menor Costo*) pueden seleccionar más de un transportista. Siempre que se use una ruta LCR, la plataforma calculará el costo de la llamada para ese destino dado (para una duración de 5 minutos) y los ordenará en orden ascendente.

source: Carriers that cannot compute cost for a given destination are silently ignored (they are not used).
es: Los transportistas que no pueden calcular el costo para un destino dado son silenciosamente ignorados (no se utilizan).

source: LCR and static routes combined
es: Rutas LCR y estáticas combinadas

source: Carrier election process can combine static and LCR routes:
es: El proceso de elección de transportista puede combinar rutas estáticas y LCR:

source: Static routes result in one carrier with the priority and the weight of the route.
es: Las rutas estáticas resultan en un transportista con la prioridad y el peso de la ruta.

source: LCR routes result in *n* carriers, ordered by call cost, all of them with the priority and the weight of the route.
es: Las rutas LCR resultan en *n* transportistas, ordenados por costo de llamada, todos ellos con la prioridad y el peso de la ruta.

source: Carriers are ordered using priority (ascending order).
es: Los transportistas se ordenan utilizando la prioridad (orden ascendente).

source: Carrier's weight is used for load-balancing between carriers with same priority.
es: El peso del transportista se utiliza para el equilibrio de carga entre transportistas con la misma prioridad.

source: Blocking routes
es: Rutas de bloqueo

source: Blocking routes are *Stopper* routes as whenever they apply, call is dropped and no further route is evaluated.
es: Las rutas de bloqueo son rutas *Detenedor* ya que siempre que se apliquen, la llamada es rechazada y no se evalúa ninguna otra ruta.

source: Using these routes, it is easy to make a group with unwanted call prefixes and reject all calls to those destinations for every client (or for one particular client).
es: Usando estas rutas, es fácil hacer un grupo con prefijos de llamadas no deseadas y rechazar todas las llamadas a esos destinos para cada cliente (o para un cliente en particular).
