Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/routing/routing_tags.po
Languages: es

source: Routing tags
es: Etiquetas de enrutamiento

source: In most scenarios, Brands administrators are responsible for configuring :ref:`Carriers` and :ref:`Outgoing Routings` to provide connectivity for their clients. But in some cases, clients want to choose the outgoing routing to use per call.
es: En la mayoría de los casos, los administradores de Marcas son responsables de configurar :ref:`Transportistas <Carriers>` y :ref:`Enrutamientos Salientes <Outgoing Routings>` para proporcionar conectividad a sus clientes. Pero en algunos casos, los clientes quieren elegir el enrutamiento saliente a utilizar por llamada.

source: A Routing tag is **a code that will prefix the destination number when placing calls to IvozProvider** and allow clients to choose different routes for same destinations.
es: Una etiqueta de enrutamiento es **un código que antecederá al número de destino al realizar llamadas a IvozProvider** y permitirá a los clientes elegir diferentes rutas para los mismos destinos.

source: Add/Edit/Delete a routing tag
es: Agregar/Editar/Eliminar una etiqueta de enrutamiento

source: Routing tag definition only implies these two fields:
es: La definición de la etiqueta de enrutamiento solo implica estos dos campos:

source: Name
es: Nombre

source: Name used for referencing (e.g. "Premium")
es: Nombre utilizado para referenciar (por ejemplo, "Premium")

source: Tag
es: Etiqueta

source: Prefix itself
es: El prefijo en sí

source: Tag **must** have this format: from 1 to 3 digits ended by # symbol.
es: La etiqueta **debe** tener este formato: de 1 a 3 dígitos terminados con el símbolo #.

source: Using routing tags
es: Usando etiquetas de enrutamiento

source: Once created, routing tags can be used in three different sections:
es: Una vez creadas, las etiquetas de enrutamiento se pueden usar en tres secciones diferentes:

source: In **client edit screen**, to allow a client to use a routing tag.
es: En **pantalla de edición del cliente**, para permitir que un cliente use una etiqueta de enrutamiento.

source: Using a non enabled routing tag will cause the call to be declined.
es: Usar una etiqueta de enrutamiento no habilitada hará que la llamada sea rechazada.

source: In **Outgoing routings** to modify the way those calls are routed.
es: En **Enrutamientos salientes** para modificar la forma en que se enrutan esas llamadas.

source: In **client - rating profiles association**, so that different routes imply different billing.
es: En **asociación de cliente - perfiles de calificación**, para que diferentes rutas impliquen diferentes facturaciones.

source: Route tags are only available to wholesale and retail clients at the moment.
es: Las etiquetas de ruta solo están disponibles para clientes mayoristas y minoristas en este momento.
