Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/residential/external_call_filters.po
Languages: es

source: External call filters
es: Filtros de llamadas externas

source: Residential External Filters can be assigned to DDIs to temporary forward calls to an external number or to avoid call from undesirable sources.
es: Los filtros externos residenciales se pueden asignar a DDIs para reenviar temporalmente las llamadas a un número externo o para evitar llamadas de fuentes indeseables.

source: Filters Configuration
es: Configuración de filtros

source: This are the configurable settings of *Residential external filters*:
es: Estos son los ajustes configurables de los *filtros externos residenciales*:

source: Name
es: Nombre

source: Name of the filter.
es: Nombre del filtro.

source: Black list
es: Lista negra

source: External origin will be checked against the associated :ref:`match_lists`, if a coincidence is found, the call will be rejected immediately.
es: El origen externo se verificará contra las :ref:`listas de coincidencias <match_lists>` asociadas, si se encuentra una coincidencia, la llamada será rechazada inmediatamente.

source: Unconditional Call Forward
es: Reenvío de llamadas incondicional

source: Calls to DDIs using this filter will be forwarded to given external number.
es: Las llamadas a DDIs que usen este filtro se reenviarán al número externo indicado.

source: Blacklisting has precedence over unconditional call forward. Calls from numbers matching associated matchlist won't be forwarded, they will be rejected.
es: La lista negra tiene prioridad sobre el reenvío de llamadas incondicional. Las llamadas de números que coincidan con la lista de coincidencias asociada no serán reenviadas, serán rechazadas.

source: Calls forwarded by a filter will keep the original caller identification, adding the forwarding info in a SIP *Diversion* header.
es: Las llamadas reenviadas por un filtro mantendrán la identificación del llamante original, añadiendo la información de reenvío en un encabezado SIP *Diversion*.
