Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/residential/residential_voicemails.po
Languages: es

source: Residential Voicemails
es: Buzones de Voz Residenciales

source: Voicemail most notable fields are:
es: Los campos más notables del buzón de voz son:

source: Enabled
es: Habilitado

source: Enables or disables voicemail.
es: Habilita o deshabilita el buzón de voz.

source: Name
es: Nombre

source: Residential Device name owner of this voicemail.
es: Nombre del dispositivo residencial propietario de este buzón de voz.

source: Locution
es: Locución

source: If set, this locution is played as voicemail welcome message when a voicemail for this voicemail is going to be recorded. This only applies for call forwards to voicemail.
es: Si se establece, esta locución se reproduce como mensaje de bienvenida del buzón de voz cuando se va a grabar un mensaje de voz para este buzón. Esto solo se aplica para desvíos de llamadas al buzón de voz.

source: Email address
es: Dirección de correo electrónico

source: Send an email to the configured user address when a new voicemail is received.
es: Enviar un correo electrónico a la dirección de usuario configurada cuando se reciba un nuevo mensaje de voz.

source: Attach sounds:
es: Adjuntar sonidos:

source: Attach the audio message to the sent email.
es: Adjuntar el mensaje de audio al correo electrónico enviado.

source: If voicemail locution is not assigned, default locution will be used as long as the owner has not recorded a custom message through the voicemail menu (calling to voicemail service code).
es: Si no se asigna una locución al buzón de voz, se utilizará la locución predeterminada siempre que el propietario no haya grabado un mensaje personalizado a través del menú del buzón de voz (llamando al código de servicio del buzón de voz).
