Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/residential/residential_devices.po
Languages: es

source: Residential devices
es: Dispositivos residenciales

source: Residential Devices are the main routable option in Residential clients. More or less like :ref:`friends` are to Virtual PBX Clients, devices contain the required configurable options to provide a SIP connectivity service with IvozProvider and an external SIP entity.
es: Los dispositivos residenciales son la opción principal enrutables en clientes residenciales. Más o menos como :ref:`friends <friends>` son para los clientes de PBX Virtual, los dispositivos contienen las opciones configurables necesarias para proporcionar un servicio de conectividad SIP con IvozProvider y una entidad SIP externa.

source: Although both **Carriers/DDI Providers** and **Residential Devices** are defined by the **brand operator**, the former are designed to connect with the public switched telephony network while the latter connects the system with our clients' SIP entities.
es: Aunque tanto **Operadores/Proveedores de DDI** como **Dispositivos Residenciales** son definidos por el **operador de la marca**, los primeros están diseñados para conectarse con la red telefónica pública conmutada, mientras que los segundos conectan el sistema con las entidades SIP de nuestros clientes.

source: Types of residential devices
es: Tipos de dispositivos residenciales

source: There are 2 main types of SIP endpoints that can use residential with IvozProvider:
es: Hay 2 tipos principales de puntos finales SIP que pueden usar residencial con IvozProvider:

source: **Direct connection endpoint**: IvozProvider must be able to talk SIP directly with this kind of devices by just forwarding the traffic to the proper port of the public IP address of the PBX.
es: **Punto final de conexión directa**: IvozProvider debe poder hablar SIP directamente con este tipo de dispositivos simplemente reenviando el tráfico al puerto adecuado de la dirección IP pública de la PBX.

source: **Endpoint behind NAT**: Not directly reachable. This kind of endpoint must register at IvozProvider (just like all the :ref:`Terminals <terminals>` do).
es: **Punto final detrás de NAT**: No es directamente accesible. Este tipo de punto final debe registrarse en IvozProvider (al igual que todos los :ref:`Terminales <terminals>`).

source: What kind of calls can be routed through a *Residential Device*?
es: ¿Qué tipo de llamadas se pueden enrutar a través de un *Dispositivo Residencial*?

source: Contrary to Friends, **Residential Devices** have some simplifications and limitations:
es: Contrariamente a los Amigos, **Dispositivos Residenciales** tienen algunas simplificaciones y limitaciones:

source: Residential Devices only route their assigned DDIs
es: Los Dispositivos Residenciales solo enrutan sus DDIs asignados

source: Residential Devices only place externals calls to Carriers
es: Los Dispositivos Residenciales solo realizan llamadas externas a Operadores

source: Residential Devices only receive external calls from DDI Providers
es: Los Dispositivos Residenciales solo reciben llamadas externas de Proveedores de DDI

source: Residential Devices Configuration
es: Configuración de Dispositivos Residenciales

source: These are the configurable settings of *Residential devices*:
es: Estas son las configuraciones configurables de *dispositivos residenciales*:

source: Basic configuration
es: Configuración básica

source: Name
es: Nombre

source: Name of the **residential device**. This name must be unique in the whole brand so it's recommended to use some kind of sequential identifier. This will also be used in SIP messages (sent **From User**).
es: Nombre del **dispositivo residencial**. Este nombre debe ser único en toda la marca, por lo que se recomienda usar algún tipo de identificador secuencial. Esto también se usará en mensajes SIP (enviados **Desde Usuario**).

source: Description
es: Descripción

source: Optional. Extra information for this *residential device*.
es: Opcional. Información adicional para este *dispositivo residencial*.

source: Password
es: Contraseña

source: When the *residential device* send requests, IvozProvider will authenticate it using this password. **Using password IS A MUST in "Register" mode**. In "Direct" mode, leaving it blank disables SIP authentication and enables IP source check.
es: Cuando el *dispositivo residencial* envía solicitudes, IvozProvider lo autentificará usando esta contraseña. **Usar contraseña ES OBLIGATORIO en modo "Registrar"**. En modo "Directo", dejarlo en blanco deshabilita la autenticación SIP y habilita la verificación de origen IP.

source: Direct connectivity
es: Conectividad directa

source: If you choose 'Yes' here, you'll have to fill the protocol, address and port where this *residential device* can be contacted.
es: Si eliges 'Sí' aquí, tendrás que completar el protocolo, la dirección y el puerto donde se puede contactar a este *dispositivo residencial*.

source: Multi Contact
es: Contacto Múltiple

source: Same SIP credentials can be configured in multiple SIP devices. In that case, all devices ring simultaneously when receiving a call. Setting this toggle to 'No' limits this behaviour so that only latest registered SIP device rings.
es: Las mismas credenciales SIP se pueden configurar en múltiples dispositivos SIP. En ese caso, todos los dispositivos suenan simultáneamente al recibir una llamada. Configurar este interruptor en 'No' limita este comportamiento para que solo suene el último dispositivo SIP registrado.

source: Geographic configuration
es: Configuración geográfica

source: Language
es: Idioma

source: Locutions will be played in this language
es: Las locuciones se reproducirán en este idioma

source: Numeric transformation
es: Transformación numérica

source: Numeric transformation set that will be applied when communicating with this device.
es: Conjunto de transformación numérica que se aplicará al comunicarse con este dispositivo.

source: Outgoing configuration
es: Configuración de salida

source: Fallback Outgoing DDI
es: DDI de salida de respaldo

source: External calls from this *residential device* will be presented with this DDI, **unless the source presented matches a DDI belonging to the residential client**.
es: Las llamadas externas desde este *dispositivo residencial* se presentarán con este DDI, **a menos que la fuente presentada coincida con un DDI perteneciente al cliente residencial**.

source: Advanced configuration
es: Configuración avanzada

source: Allowed codec
es: Codec permitido

source: Like vPBX terminals, *residential devices* will talk only the selected codec.
es: Al igual que los terminales vPBX, *dispositivos residenciales* solo hablarán el codec seleccionado.

source: From domain
es: Desde dominio

source: Request from IvozProvider to this device will include this domain in the From header.
es: La solicitud de IvozProvider a este dispositivo incluirá este dominio en el encabezado From.

source: DDI In
es: DDI Entrante

source: If set to 'Yes', set destination (R-URI and To) to called DDI when calling to this endpoint. If set 'No', username used in Contact header of registration will be used, as specified in SIP RFC (residential device name will be used for endpoints with direct connectivity). Defaults to 'No'.
es: Si se establece en 'Sí', establece el destino (R-URI y To) al DDI llamado al llamar a este punto final. Si se establece en 'No', se usará el nombre de usuario utilizado en el encabezado de Contacto del registro, como se especifica en el RFC SIP (se usará el nombre del dispositivo residencial para puntos finales con conectividad directa). Por defecto es 'No'.

source: Enable T.38 passthrough
es: Habilitar paso a través de T.38

source: If set to 'yes', this SIP endpoint must be a **T.38 capable fax sender/receiver**. IvozProvider will act as a T.38 gateway, bridging fax-calls of a T.38 capable carrier and a T.38 capable device.
es: Si se establece en 'sí', este punto final SIP debe ser un **emisor/receptor de fax compatible con T.38**. IvozProvider actuará como una puerta de enlace T.38, conectando llamadas de fax de un operador compatible con T.38 y un dispositivo compatible con T.38.

source: Call waiting
es: Llamada en espera

source: Limits received calls when already handling this number of calls. Set 0 for unlimited.
es: Limita las llamadas recibidas cuando ya se está manejando este número de llamadas. Establecer 0 para ilimitado.

source: RTP Encryption
es: Encriptación RTP

source: If set to 'yes', call won't be established unless it's possible to encryption its audio. If set to 'no', audio won't be encrypted.
es: Si se establece en 'sí', la llamada no se establecerá a menos que sea posible encriptar su audio. Si se establece en 'no', el audio no se encriptará.

source: Residential device can be contacted due to calls to several DDIs. *DDI In* setting allows remote SIP endpoint to know which number caused each call, setting that number as destination (R-URI and To headers). This way, residential device can handle calls differently.
es: El dispositivo residencial puede ser contactado debido a llamadas a varios DDIs. La configuración de *DDI Entrante* permite al punto final SIP remoto saber qué número causó cada llamada, estableciendo ese número como destino (encabezados R-URI y To). De esta manera, el dispositivo residencial puede manejar las llamadas de manera diferente.

source: Voicemail settings
es: Configuraciones de buzón de voz

source: Every residential device has a voicemail that can be accessed using voicemail service code defined at brand level.
es: Cada dispositivo residencial tiene un buzón de voz al que se puede acceder usando el código de servicio de buzón de voz definido a nivel de marca.

source: Additionally, voicemails can be configured to send their messages to an email address in :ref:`Residential Voicemails <residential_voicemails>`.
es: Además, los buzones de voz se pueden configurar para enviar sus mensajes a una dirección de correo electrónico en :ref:`Buzones de Voz Residenciales <residential_voicemails>`.

source: Call forwarding settings
es: Configuraciones de desvío de llamadas

source: Apart from unconditional call forwarding to external number through :ref:`External call filters` applied to DDI, residential devices may have additional call forwarding settings that allow:
es: Aparte del desvío incondicional de llamadas a un número externo a través de :ref:`filtros de llamadas externas <External call filters>` aplicados a DDI, los dispositivos residenciales pueden tener configuraciones adicionales de desvío de llamadas que permiten:

source: Forwarding to another external number.
es: Desvío a otro número externo.

source: Forwarding to voicemail associated to each residential device.
es: Desvío al buzón de voz asociado a cada dispositivo residencial.

source: Supported forwarding types: unconditional, no-answer, non-registered, busy.
es: Tipos de desvío soportados: incondicional, sin respuesta, no registrado, ocupado.

source: :ref:`External call filters` have precedence over residential devices call forwarding settings.
es: :ref:`Los filtros de llamadas externas <External call filters>` tienen precedencia sobre las configuraciones de desvío de llamadas de los dispositivos residenciales.

source: Forwarding to national numbers can be configured using services codes (further information :ref:`here <Call forward services>`).
es: El desvío a números nacionales se puede configurar usando códigos de servicios (más información :ref:`aquí <Call forward services>`).

source: Asterisk as a residential device
es: Asterisk como dispositivo residencial

source: At the other end of a device can be any kind of SIP entity. This section takes as example an Asterisk PBX system using SIP channel driver that wants to connect to IvozProvider.
es: En el otro extremo de un dispositivo puede haber cualquier tipo de entidad SIP. Esta sección toma como ejemplo un sistema PBX Asterisk usando el controlador de canal SIP que quiere conectarse a IvozProvider.

source: Device register
es: Registro de dispositivo

source: If the system can not be directly access, Asterisk will have to register in the platform (like a terminal will do).
es: Si el sistema no puede ser accedido directamente, Asterisk tendrá que registrarse en la plataforma (como lo haría un terminal).

source: Configuration will be something like this:
es: La configuración será algo así:

source: Device peer
es: Peer del dispositivo

source: *Residential devices* MUST NOT challenge IvozProvider. That's why the *insecure* setting is used here.
es: *Los dispositivos residenciales* NO DEBEN desafiar a IvozProvider. Por eso se usa la configuración *insegura* aquí.

source: As From username is used to identify the residential device, P-Asserted-Identity (or P-Preferred-Identity or Remote-Party-Id) must be used to specify caller number. Prevalence among these source headers is: PAI > PPI > RPID.
es: Dado que el nombre de usuario From se usa para identificar el dispositivo residencial, se debe usar P-Asserted-Identity (o P-Preferred-Identity o Remote-Party-Id) para especificar el número de llamada. La prevalencia entre estos encabezados de origen es: PAI > PPI > RPID.
