Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security_and_maintenance/security/antibruteforce.po
Languages: es

source: Anti brute-force attacks
es: Ataques anti fuerza bruta

source: IvozProvider ships a simple anti brute-force attack in KamUsers that bans sources after continuous SIP auth failures from same IP address.
es: IvozProvider incluye un simple ataque anti fuerza bruta en KamUsers que prohíbe fuentes después de fallos continuos de autenticación SIP desde la misma dirección IP.

source: It works like this:
es: Funciona así:

source: On SIP failures (invalid user or invalid password cases only), a counter is increased:
es: En fallos de SIP (solo en casos de usuario inválido o contraseña inválida), se incrementa un contador:

source: Key: fromUsername@fromDomain::source_ip
es: Clave: fromUsername@fromDomain::source_ip

source: e.g. terminal@vpbx.domain.net::1.2.3.4
es: por ejemplo, terminal@vpbx.domain.net::1.2.3.4

source: Counter is increased on every failure.
es: El contador se incrementa en cada fallo.

source: When counter reaches 100, that specific source (user + domain + ip) is banned for 12 hours.
es: Cuando el contador alcanza 100, esa fuente específica (usuario + dominio + ip) es prohibida durante 12 horas.

source: After 12 hours, source is accepted again and:
es: Después de 12 horas, la fuente es aceptada nuevamente y:

source: Counter starts counting again from 80.
es: El contador comienza a contar nuevamente desde 80.

source: If it reaches 100 again, it is banned for another 12 hours.
es: Si alcanza 100 nuevamente, se prohíbe por otras 12 horas.

source: See :ref:`Brute-force attacks` for currently blocked sources.
es: Vea :ref:`Ataques de fuerza bruta <Brute-force attacks>` para fuentes actualmente bloqueadas.
