Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security_and_maintenance/security/antiflooding.po
Languages: es

source: SIP Antiflooding
es: Antiflooding SIP

source: SIP Proxies included in IvozProvider installation for SIP signalling use `PIKE module <http://kamailio.org/docs/modules/5.1.x/modules/pike.html>`_ to avoid DoS attacks.
es: Los proxies SIP incluidos en la instalación de IvozProvider para la señalización SIP usan el `módulo PIKE <http://kamailio.org/docs/modules/5.1.x/modules/pike.html>`_ para evitar ataques DoS.

source: This module keeps trace of incoming request's IP address and blocks the ones that exceed the limit on a given time interval.
es: Este módulo rastrea la dirección IP de las solicitudes entrantes y bloquea las que exceden el límite en un intervalo de tiempo dado.

source: **IPs are not blocked permanently**, they are blocked for 5 minutes. After this time, they are allowed again as long as their incoming request rate don't exceed the limit.
es: **Las IPs no se bloquean permanentemente**, se bloquean durante 5 minutos. Después de este tiempo, se permiten nuevamente siempre que su tasa de solicitudes entrantes no exceda el límite.

source: :ref:`Antiflood banned IPs` shows a list of addresses that have been banned at some point.
es: :ref:`IPs prohibidas por antiflood <Antiflood banned IPs>` muestra una lista de direcciones que han sido prohibidas en algún momento.

source: Current configuration parameters are:
es: Los parámetros de configuración actuales son:

source: **Sampling time interval**: 2 seconds.
es: **Intervalo de tiempo de muestreo**: 2 segundos.

source: **Threshold per time unit**: 100 requests.
es: **Umbral por unidad de tiempo**: 100 solicitudes.

source: This means that *any IP address that sends more than 100 requests in a 2-second-time-interval will be blocked (ignored) for 5 minutes. After this time, it will be unblocked and its request rate will be evaluated again*.
es: Esto significa que *cualquier dirección IP que envíe más de 100 solicitudes en un intervalo de tiempo de 2 segundos será bloqueada (ignorada) durante 5 minutos. Después de este tiempo, será desbloqueada y su tasa de solicitudes será evaluada nuevamente*.

source: Be aware that some requests are not taken into account by antiflood, continue reading please.
es: Tenga en cuenta que algunas solicitudes no son tenidas en cuenta por antiflood, por favor continúe leyendo.

source: Which requests are taken into account in KamUsers?
es: ¿Qué solicitudes se tienen en cuenta en KamUsers?

source: Client side requests usually traverse 2 different phases:
es: Las solicitudes del lado del cliente generalmente atraviesan 2 fases diferentes:

source: Step 0: initial checks, endpoint identification and authentication.
es: Paso 0: verificaciones iniciales, identificación del punto final y autenticación.

source: Step 1: remaining logic.
es: Paso 1: lógica restante.

source: Antiflood will take into account:
es: Antiflood tendrá en cuenta:

source: Requests failing during step 0:
es: Solicitudes fallidas durante el paso 0:

source: Requests not using SIP domain in KamUsers (except wholesale).
es: Solicitudes que no usan el dominio SIP en KamUsers (excepto mayoristas).

source: Requests from non-existing AoRs in KamUsers.
es: Solicitudes de AoRs no existentes en KamUsers.

source: Requests failing SIP authentication with wrong passwords in KamUsers.
es: Solicitudes que fallan la autenticación SIP con contraseñas incorrectas en KamUsers.

source: Initial INVITE requests reaching step 1 (aka: new call establishments of legitimate clients).
es: Solicitudes INVITE iniciales que alcanzan el paso 1 (es decir: nuevos establecimientos de llamadas de clientes legítimos).

source: Note that antiflood will not take into account successful REGISTER/SUBSCRIBE cycles.
es: Tenga en cuenta que antiflood no tendrá en cuenta los ciclos exitosos de REGISTER/SUBSCRIBE.

source: Which requests are taken into account in KamTrunks?
es: ¿Qué solicitudes se tienen en cuenta en KamTrunks?

source: SIP OPTIONS from non-DDIproviders.
es: OPCIONES SIP de proveedores no-DDI.

source: Non-DDIproviders talking to KamTrunks.
es: Proveedores no-DDI hablando con KamTrunks.

source: Note that antiflood will not take into account DDI Provider requests to KamTrunks.
es: Tenga en cuenta que antiflood no tendrá en cuenta las solicitudes de proveedores DDI a KamTrunks.
