Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security_and_maintenance/security/authorized_ip_ranges.po
Languages: es

source: Authorized IP ranges
es: Rangos de IP autorizados

source: :ref:`Virtual PBX clients <vPBX clients>`, :ref:`retail clients` and :ref:`residential clients` can add IP addresses or ranges (in CIDR format) with the combination of **Filter by IP address** field and **List of authorized sources** subsection.
es: :ref:`Clientes de PBX Virtual <vPBX clients>`, :ref:`clientes minoristas <retail clients>` y :ref:`clientes residenciales <residential clients>` pueden agregar direcciones IP o rangos (en formato CIDR) con la combinación del campo **Filtrar por dirección IP** y la subsección **Lista de fuentes autorizadas**.

source: On :ref:`wholesale clients` there is no **Filter by IP address** field as this type of clients are authenticated by IP, making filling **List of wholesale addresses** mandatory.
es: En :ref:`clientes mayoristas <wholesale clients>` no hay campo **Filtrar por dirección IP** ya que este tipo de clientes se autentican por IP, haciendo obligatorio completar la **Lista de direcciones mayoristas**.

source: When **Filter by IP address** is enabled, users won't be allowed to connect from another network, even if they have valid SIP credentials.
es: Cuando **Filtrar por dirección IP** está habilitado, los usuarios no podrán conectarse desde otra red, incluso si tienen credenciales SIP válidas.

source: Enabling **Filter by IP address** and leaving blank both **GeoIP countries** and **List of authorized sources** will prevent all calls.
es: Habilitar **Filtrar por dirección IP** y dejar en blanco tanto **Países GeoIP** como **Lista de fuentes autorizadas** evitará todas las llamadas.

source: Addresses listed in :ref:`IP filter blocked addresses` gives a clue of legitimate sources that should be added in **List of authorized sources** subsection.
es: Las direcciones listadas en :ref:`direcciones bloqueadas por el filtro IP <IP filter blocked addresses>` dan una pista de fuentes legítimas que deberían agregarse en la subsección **Lista de fuentes autorizadas**.

source: Roadwarrior users
es: Usuarios itinerantes

source: Some vPBX clients have roadwarrior users that travel often and connect from external networks, forcing Clients to disable the IP filter security mechanism.
es: Algunos clientes de vPBX tienen usuarios itinerantes que viajan con frecuencia y se conectan desde redes externas, obligando a los Clientes a deshabilitar el mecanismo de seguridad del filtro IP.

source: To solve this issue, there is a user option called **Calls from non-granted IPs** that enables these users to call from non-granted IPs while remaining users' credentials are still protected with IP filter mechanism.
es: Para resolver este problema, hay una opción de usuario llamada **Llamadas desde IPs no autorizadas** que permite a estos usuarios llamar desde IPs no autorizadas mientras las credenciales de los demás usuarios siguen protegidas con el mecanismo de filtro IP.

source: When users like these call from non-granted IPs, their amount of concurrent outgoing calls are limited to 1, 2 or 3 to avoid being a security breach.
es: Cuando usuarios como estos llaman desde IPs no autorizadas, su cantidad de llamadas salientes concurrentes se limita a 1, 2 o 3 para evitar ser una brecha de seguridad.

source: Only **generated calls** (both internals and externals) are limited, received calls are not affected by this setting.
es: Solo las **llamadas generadas** (tanto internas como externas) están limitadas, las llamadas recibidas no se ven afectadas por esta configuración.

source: To sum up, with this feature:
es: En resumen, con esta característica:

source: There are users that are allowed to make a fixed amount of calls from non-granted IPs.
es: Hay usuarios que tienen permitido hacer una cantidad fija de llamadas desde IPs no autorizadas.

source: These calls from non-granted IPs are counted and limited.
es: Estas llamadas desde IPs no autorizadas son contadas y limitadas.

source: Example 1 - Client without IP check
es: Ejemplo 1 - Cliente sin verificación de IP

source: It doesn't matter if the user is allowed to make calls from non-granted IPs, as there are no non-granted IPs.
es: No importa si el usuario tiene permitido hacer llamadas desde IPs no autorizadas, ya que no hay IPs no autorizadas.

source: Example 2 - Client with IP check
es: Ejemplo 2 - Cliente con verificación de IP

source: If the user is calling from one of the allowed IPs, it doesn't matter if the user is allowed to make calls from non-granted IPs: this calls are not counted nor limited.
es: Si el usuario está llamando desde una de las IPs permitidas, no importa si el usuario tiene permitido hacer llamadas desde IPs no autorizadas: estas llamadas no se cuentan ni se limitan.

source: If the user is NOT calling from one of the allowed IPs, it is verified the amount of calls that this user is allowed to make. If the user is allowed to make calls from non-granted IPs and has not exceeded his limit, the call is granted and counted.
es: Si el usuario NO está llamando desde una de las IPs permitidas, se verifica la cantidad de llamadas que este usuario tiene permitido hacer. Si el usuario tiene permitido hacer llamadas desde IPs no autorizadas y no ha excedido su límite, la llamada es concedida y contada.

source: To sum up, if **Calls from non-granted IPs** is set to *None* the user must fulfill the IP policy of the client.
es: En resumen, si **Llamadas desde IPs no autorizadas** está configurado en *Ninguna*, el usuario debe cumplir con la política de IP del cliente.
