Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security_and_maintenance/security/firewall.po
Languages: es

source: Firewall
es: Cortafuegos

source: **IvozProvider does not currently include a firewall** but...
es: **IvozProvider no incluye actualmente un cortafuegos** pero...

source: We **strongly encourage any production installation to implement a firewall** to protect the platform from the wild Internet.
es: **Recomendamos encarecidamente que cualquier instalación de producción implemente un cortafuegos** para proteger la plataforma de Internet.

source: The protection method could be:
es: El método de protección podría ser:

source: Local firewall based on `iptables <https://www.netfilter.org/>`_
es: Cortafuegos local basado en `iptables <https://www.netfilter.org/>`_

source: External firewall
es: Cortafuegos externo

source: Both
es: Ambos

source: Exposed ports/services
es: Puertos/servicios expuestos

source: These are the **ports IvozProvider needs to expose** to work properly:
es: Estos son los **puertos que IvozProvider necesita exponer** para funcionar correctamente:

source: **Client side SIP signalling**:
es: **Señalización SIP del lado del cliente**:

source: Port 5060 (TCP/UDP)
es: Puerto 5060 (TCP/UDP)

source: Port 5061 (TCP)
es: Puerto 5061 (TCP)

source: Port 10080 (TCP) for Websocket connections (WS).
es: Puerto 10080 (TCP) para conexiones Websocket (WS).

source: Port 10081 (TCP) for Websocket secure connections (WSS).
es: Puerto 10081 (TCP) para conexiones Websocket seguras (WSS).

source: **Provider side SIP signalling**:
es: **Señalización SIP del lado del proveedor**:

source: Port 7060 (TCP/UDP) y 7061 TCP in case both proxies share a unique IP address.
es: Puerto 7060 (TCP/UDP) y 7061 TCP en caso de que ambos proxies compartan una única dirección IP.

source: **RTP audioflow**:
es: **Flujo de audio RTP**:

source: Port range 13000-19000 UDP
es: Rango de puertos 13000-19000 UDP

source: **Web portal and provisioning**:
es: **Portal web y aprovisionamiento**:

source: Ports TCP 80, 443, 1443, 2443 and 3443
es: Puertos TCP 80, 443, 1443, 2443 y 3443

source: We recommend using any **geoIP blocking** mechanism to drop connections from countries without clients.
es: Recomendamos usar cualquier mecanismo de **bloqueo geoIP** para bloquear conexiones de países sin clientes.
