Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started/external_outgoing_calls/call_routing.po
Languages: es

source: Outgoing Routing configuration
es: Configuración de enrutamiento saliente

source: We already have our test call categorized as a call within the **Routing pattern** 'Spain'. In addition, we also have a **Routing pattern group** including 'Spain', called 'Europe'.
es: Ya tenemos nuestra llamada de prueba categorizada como una llamada dentro del **patrón de enrutamiento** 'España'. Además, también tenemos un **grupo de patrones de enrutamiento** que incluye 'España', llamado 'Europa'.

source: Now we have to tell IvozProvider that calls to 'Spain' or 'Europe' should be established through our new **Carrier**.
es: Ahora tenemos que decirle a IvozProvider que las llamadas a 'España' o 'Europa' deben establecerse a través de nuestro nuevo **Carrier**.

source: To make this assignment, we use the section **Brand Configuration > Routing > Outgoing routings**:
es: Para hacer esta asignación, usamos la sección **Configuración de Marca > Enrutamiento > Enrutamientos salientes**:

source: Client: "Apply to all clients" (or just *democompany*).
es: Cliente: "Aplicar a todos los clientes" (o solo *democompany*).

source: Type: pattern.
es: Tipo: patrón.

source: Destination pattern: Spain.
es: Patrón de destino: España.

source: Route type: static.
es: Tipo de ruta: estática.

source: Carriers: our new carrier.
es: Carriers: nuestro nuevo carrier.

source: Priority: 1
es: Prioridad: 1

source: For more information about routing and load balancing check :ref:`Outgoing Routings` section.
es: Para más información sobre enrutamiento y balanceo de carga, consulte la sección :ref:`Enrutamientos salientes <Outgoing Routings>`.
