Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started/external_outgoing_calls/noplan_nocall.po
Languages: es

source: At this point, we are looking forward to make our first outgoing call with our new IvozProvider, we may have even tried to call with current configuration but...
es: En este punto, estamos deseando hacer nuestra primera llamada saliente con nuestro nuevo IvozProvider, puede que incluso hayamos intentado llamar con la configuración actual pero...

source: No rating plan, no call
es: Sin plan de tarifas, no hay llamada

source: Just the way we warned :ref:`when we described the duties of the brand operator <brand_responsibilities>`, the brand operator is **responsible for making all the needed setup so that IvozProvider is able to bill all external calls**.
es: Tal como advertimos :ref:`cuando describimos las responsabilidades del operador de marca <brand_responsibilities>`, el operador de marca es **responsable de hacer toda la configuración necesaria para que IvozProvider pueda facturar todas las llamadas externas**.

source: **Billing a call** is the action of **assigning price** to a call that implies cost.
es: **Facturar una llamada** es la acción de **asignar un precio** a una llamada que implica un costo.

source: **IvozProvider checks live that a call can be billed when it is established** to avoid placing calls that imply cost but won't be billed because Brand Operator, due to a mistake, hasn't assigned a price.
es: **IvozProvider verifica en vivo que una llamada pueda ser facturada cuando se establece** para evitar realizar llamadas que impliquen un costo pero que no serán facturadas porque el Operador de Marca, debido a un error, no ha asignado un precio.

source: If a call can't be billed, IvozProvider won't allow its establishment.
es: Si una llamada no puede ser facturada, IvozProvider no permitirá su establecimiento.

source: Creating a rating plan
es: Creando un plan de tarifas

source: **Brand Configuration > Billing > Destination** section is empty by default, as opposed to routing patterns section, that has all the 254 countries of the world. The reason is that one destination rate will usually imply lots of pattern per country (GSM networks, especial numbers, mobile numbers, fixed lines, etc.).
es: La sección **Configuración de Marca > Facturación > Destino** está vacía por defecto, a diferencia de la sección de patrones de enrutamiento, que tiene los 254 países del mundo. La razón es que una tarifa de destino generalmente implicará muchos patrones por país (redes GSM, números especiales, números móviles, líneas fijas, etc.).

source: In most of the cases, this section data will be imported from CSV provided by your VoIP provider, but for our test we will create it manually:
es: En la mayoría de los casos, los datos de esta sección se importarán desde un CSV proporcionado por su proveedor de VoIP, pero para nuestra prueba lo crearemos manualmente:

source: Create a **destination** with '+34' for Spain.
es: Cree un **destino** con '+34' para España.

source: Create a **destination rate** and insert a price for Spain destination.
es: Cree una **tarifa de destino** e inserte un precio para el destino España.

source: Create a **rating plan** that includes that destination rate.
es: Cree un **plan de tarifas** que incluya esa tarifa de destino.

source: Assign rating plan to client
es: Asignar plan de tarifas al cliente

source: The last step is **assigning that rating plan** to *democompany* following the indication :ref:`here <Assigning rating plans to clients>`.
es: El último paso es **asignar ese plan de tarifas** a *democompany* siguiendo la indicación :ref:`aquí <Assigning rating plans to clients>`.
