Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/user_configuration/outgoing_ddi_rules.po
Languages: es

source: Outgoing DDI Rules
es: Reglas DDI de salida

source: Most calling entities in IvozProvider require an outgoing DDI when placing calls to external numbers. This includes: Users, Friends, Faxes, Retail Accounts, and so on..
es: La mayoría de las entidades que llaman en IvozProvider requieren un DDI de salida cuando realizan llamadas a números externos. Esto incluye: Usuarios, Friends, Faxes, Cuentas Retail, etc.

source: But there are some cases when a single outgoing DDI is not enough, and the presented DDI depends on the called number or a given prefix. To archive this dynamic outgoing DDI selection you can use Outgoing DDI rules.
es: Pero hay algunos casos en los que un solo DDI de salida no es suficiente, y el DDI presentado depende del número llamado o de un prefijo dado. Para archivar esta selección dinámica de DDI de salida, puedes usar las reglas de DDI de salida.

source: Outgoing DDI based on destination
es: DDI de salida basado en destino

source: For destination based rules, you would require first group the destination numbers in :ref:`match_lists`.
es: Para las reglas basadas en destino, primero necesitarías agrupar los números de destino en :ref:`listas de coincidencia <match_lists>`.

source: For this example, we will create a match list of corporate mobiles with all the mobile numbers of our client workers. When we call to those numbers, we will keep the original outgoing DDI assigned to the user, and for the rest of the cases we will force the DDI to the main client outgoing DDI.
es: Para este ejemplo, crearemos una lista de coincidencia de móviles corporativos con todos los números móviles de los trabajadores de nuestro cliente. Cuando llamemos a esos números, mantendremos el DDI de salida original asignado al usuario, y para el resto de los casos, forzaremos el DDI al DDI de salida principal del cliente.

source: Create a new Outgoing DDI Rule
es: Crear una nueva regla DDI de salida

source: The main creation screen defines the action that will take place when no rule matches the dialed destination, so we define to force the main client DDI here.
es: La pantalla principal de creación define la acción que se llevará a cabo cuando ninguna regla coincida con el destino marcado, por lo que aquí definimos forzar el DDI principal del cliente.

source: Assign rule lists actions
es: Asignar acciones de listas de reglas

source: Now we add a new rule that will match our mobiles to make the user's outgoing DDI be kept untouched.
es: Ahora agregamos una nueva regla que coincidirá con nuestros móviles para que el DDI de salida del usuario se mantenga sin cambios.

source: Assign rule to callers
es: Asignar regla a los llamantes

source: At last, we have to configure who will use this rule to dynamically change it's presentation number. We can do this in the **Client's edit screen** or the **Users's edit screen**.
es: Por último, tenemos que configurar quién usará esta regla para cambiar dinámicamente su número de presentación. Podemos hacer esto en la **pantalla de edición del cliente** o en la **pantalla de edición de usuarios**.

source: In this case, the User will present 777777777 DDI when calling corporate mobiles and 666666666 when calling the rest of the external numbers.
es: En este caso, el Usuario presentará el DDI 777777777 al llamar a móviles corporativos y 666666666 al llamar al resto de los números externos.

source: Outgoing DDI based on prefix
es: DDI de salida basado en prefijo

source: Outgoing DDI Rules can be also used to change the default Outgoing DDI based on a call prefix.
es: Las reglas de DDI de salida también se pueden usar para cambiar el DDI de salida predeterminado basado en un prefijo de llamada.

source: The main creation screen defines the action that will take place when no rule matches the dialed destination, we will keep original DDI if no prefix is used.
es: La pantalla principal de creación define la acción que se llevará a cabo cuando ninguna regla coincida con el destino marcado, mantendremos el DDI original si no se usa ningún prefijo.

source: Assign a prefix pattern
es: Asignar un patrón de prefijo

source: Now we add a new rule that with prefix (let's say 111) and action to force the DDI to 666666666.
es: Ahora agregamos una nueva regla con prefijo (digamos 111) y acción para forzar el DDI a 666666666.

source: In this case, the User will present 666666666 DDI when calling any destination with 111 prefix and 777777777 when not using any prefix.
es: En este caso, el Usuario presentará el DDI 666666666 al llamar a cualquier destino con el prefijo 111 y 777777777 cuando no use ningún prefijo.

source: Prefix **must** have this format: from 1 to 3 digits ended by * symbol.
es: El prefijo **debe** tener este formato: de 1 a 3 dígitos terminados con el símbolo *.
