Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/user_configuration/pick_up_groups.po
Languages: es

source: Pick up groups
es: Grupos de captura

source: Call pickup is the process where a user can answer a call that is being ringing in another terminal. No need to say that, somehow (sound, flashing lights, notification, etc) the users must know that the call is ringing elsewhere.
es: La captura de llamadas es el proceso mediante el cual un usuario puede contestar una llamada que está sonando en otro terminal. Es necesario que, de alguna manera (sonido, luces intermitentes, notificación, etc.), los usuarios sepan que la llamada está sonando en otro lugar.

source: IvozProvider supports two kind of call pickups:
es: IvozProvider soporta dos tipos de capturas de llamadas:

source: Direct pickup
es: Captura directa

source: In this type of pickup, the user that is trying to capture the ringing call must include the extension of the target phone after the service code. For example, if the direct pickup code is \*95, the user must dial \*95101 to capture a call that is ringing in the extension 101.
es: En este tipo de captura, el usuario que intenta capturar la llamada entrante debe incluir la extensión del teléfono objetivo después del código de servicio. Por ejemplo, si el código de captura directa es \*95, el usuario debe marcar \*95101 para capturar una llamada que está sonando en la extensión 101.

source: Group pickup
es: Captura de grupo

source: In this type of pickup, the user that is trying to capture the ringing call will just dial the service code. If anyone in any of the pickup groups of the user has a ringing call, it will be answered by the capturer.
es: En este tipo de captura, el usuario que intenta capturar la llamada entrante solo marcará el código de servicio. Si alguien en cualquiera de los grupos de captura del usuario tiene una llamada entrante, será contestada por el capturador.

source: Call pickup groups
es: Grupos de captura de llamadas

source: In order to make **call group pickups**, the capturer user must be part of the same group that the target user that wants to capture.
es: Para realizar **capturas de grupo**, el usuario capturador debe ser parte del mismo grupo que el usuario objetivo que desea capturar.

source: The section **Pickup groups** allows the client administrator to configure what users will be in each group:
es: La sección **Grupos de captura** permite al administrador del cliente configurar qué usuarios estarán en cada grupo:

source: As shown in the section :ref:`users`, we can add or edit the groups of a user in the user's edit screen.
es: Como se muestra en la sección :ref:`usuarios <users>`, podemos agregar o editar los grupos de un usuario en la pantalla de edición del usuario.

source: A user can be part of multiple pickup groups. The system will take all of them into account when using the group pickup service.
es: Un usuario puede ser parte de múltiples grupos de captura. El sistema tomará todos ellos en cuenta al usar el servicio de captura de grupo.

source: Group pickup service code
es: Código de servicio de captura de grupo

source: IvozProvider supports 2 different configuration levels for defining the service codes for pickup:
es: IvozProvider soporta 2 niveles de configuración diferentes para definir los códigos de servicio para la captura:

source: At brand level: **Brand configuration** > **Services**.
es: A nivel de marca: **Configuración de marca** > **Servicios**.

source: At client level: **Client configuration** > **Services**.
es: A nivel de cliente: **Configuración de cliente** > **Servicios**.

source: The brand administrator can configure generic codes that all the clients will use. Clients can customize this codes if they are used to another ones.
es: El administrador de la marca puede configurar códigos genéricos que todos los clientes usarán. Los clientes pueden personalizar estos códigos si están acostumbrados a otros.

source: The :ref:`following section <services>` explains the services in depth, with all the additional services that can be accessed by dialing codes starting with \*.
es: La :ref:`siguiente sección <services>` explica los servicios en profundidad, con todos los servicios adicionales que se pueden acceder marcando códigos que comienzan con \*.
