Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/billing/current_day_usages.po
Languages: es

source: Current day usages
es: Usos del día actual

source: This section lists current day usage for each client in the brand:
es: Esta sección lista el uso del día actual para cada cliente en la marca:

source: Type
es: Tipo

source: Type of client (vPBX, retail, residential or wholesale).
es: Tipo de cliente (vPBX, minorista, residencial o mayorista).

source: Name
es: Nombre

source: Client name.
es: Nombre del cliente.

source: Today usage
es: Uso de hoy

source: Amount of spent money in today's external calls.
es: Cantidad de dinero gastado en las llamadas externas de hoy.

source: Max daily usage
es: Uso diario máximo

source: When this threshold is reached, account is disabled. At midnight, it will be re-enabled.
es: Cuando se alcanza este umbral, la cuenta se desactiva. A medianoche, se volverá a habilitar.

source: Status
es: Estado

source: Whether account has been disabled or not.
es: Si la cuenta ha sido desactivada o no.

source: Client max daily usage is configured in **Clients configuration** with **Max daily usage** parameter.
es: El uso diario máximo del cliente se configura en **Configuración de clientes** con el parámetro **Uso diario máximo**.

source: If an account is disabled, increasing its counter above current day usages re-enables it. Otherwise, it will be re-enabled at midnight.
es: Si una cuenta está desactivada, aumentar su contador por encima de los usos del día actual la vuelve a habilitar. De lo contrario, se volverá a habilitar a medianoche.

source: This is one of main :ref:`security` mechanisms available in IvozProvider. Use it to avoid toll fraud calls (see :ref:`Current day max usage`).
es: Este es uno de los principales mecanismos de :ref:`seguridad<security>` disponibles en IvozProvider. Úselo para evitar llamadas de fraude de peaje (ver :ref:`Uso máximo del día actual<Current day max usage>`).

source: This section shows runtime value obtained asking to CGRateS (value actually applying) that should be equal to the one set editing the client itself. If data is shown in red, these values differ.
es: Esta sección muestra el valor en tiempo de ejecución obtenido al preguntar a CGRateS (valor que realmente se aplica) que debe ser igual al establecido al editar el propio cliente. Si los datos se muestran en rojo, estos valores difieren.
