Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/billing/index.po
Languages: es

source: Billing
es: Tarificación

source: Billing a call is the **action of setting a price** to a call that implies cost.
es: Tarificar una llamada es la **acción de establecer un precio** a una llamada que implica un costo.

source: Billing calls depends upon an automatic process:
es: La tarificación de llamadas depende de un proceso automático:

source: When a call is about to be established, IvozProvider verifies that it will be able to bill it.
es: Cuando una llamada está a punto de establecerse, IvozProvider verifica que podrá tarificarla.

source: If with the current configuration (active and applicable rating plans for a given client and for the specific destination) it won't be possible to bill the call, IvozProvider will prevent its establishment.
es: Si con la configuración actual (planes de tarifas activos y aplicables para un cliente determinado y para el destino específico) no es posible tarificar la llamada, IvozProvider evitará su establecimiento.

source: Once a call that implies cost is hung up and is parsed by an asynchronous process, it is listed in :ref:`external_calls`.
es: Una vez que una llamada que implica un costo se cuelga y se analiza mediante un proceso asincrónico, se lista en :ref:`llamadas_externas <external_calls>`.

source: Billing methods
es: Métodos de tarificación

source: IvozProvider supports 3 different billing methods. Billing method is configured at client level via *Billing method* parameter.
es: IvozProvider admite 3 métodos de tarificación diferentes. El método de tarificación se configura a nivel de cliente mediante el parámetro *Método de tarificación*.

source: Postpaid billing
es: Tarificación postpago

source: Call rating is done after the call ends.
es: La calificación de la llamada se realiza después de que la llamada termina.

source: No configurable limit or balances involved.
es: No hay límite configurable ni saldos involucrados.

source: Prepaid billing
es: Tarificación prepago

source: Call rating is done during the call.
es: La calificación de la llamada se realiza durante la llamada.

source: Clients with prepaid billing method have a preconfigured balance that will be decrement during the call.
es: Los clientes con el método de tarificación prepago tienen un saldo preconfigurado que se decrementará durante la llamada.

source: When the balance reaches zero, all established calls for the client will hang up.
es: Cuando el saldo llegue a cero, todas las llamadas establecidas para el cliente se colgarán.

source: Clients cannot place new calls with zero or negative balance.
es: Los clientes no pueden realizar nuevas llamadas con saldo cero o negativo.

source: Low balance email notifications can be configured.
es: Se pueden configurar notificaciones por correo electrónico de saldo bajo.

source: Pseudo-prepaid billing
es: Tarificación pseudo-prepago

source: Clients with pseudo-prepaid billing method have a preconfigured balance that will be decrement after the call ends.
es: Los clientes con el método de tarificación pseudo-prepago tienen un saldo preconfigurado que se decrementará después de que la llamada termina.

source: Clients cannot place new calls with zero or below balance.
es: Los clientes no pueden realizar nuevas llamadas con saldo cero o negativo.

source: Call duration is limited to the maximum duration possible with available balance at the moment of call establishment.
es: La duración de la llamada está limitada a la duración máxima posible con el saldo disponible en el momento del establecimiento de la llamada.

source: Price and cost
es: Precio y costo

source: Call **price** is the amount of money the brand operator will charge to its **client** for every call.
es: El **precio** de la llamada es la cantidad de dinero que el operador de la marca cobrará a su **cliente** por cada llamada.

source: Call **cost** is the amount of money the brand operator will be charged by the **carrier** for every call.
es: El **costo** de la llamada es la cantidad de dinero que el operador de la marca será cobrado por el **operador** por cada llamada.

source: **Call cost calculation is optional**, as no every carrier has *Calculate Cost?* setting enabled. On the other hand, **call price calculation is mandatory** for every outgoing call.
es: **El cálculo del costo de la llamada es opcional**, ya que no todos los operadores tienen habilitada la configuración *¿Calcular costo?*. Por otro lado, **el cálculo del precio de la llamada es obligatorio** para cada llamada saliente.

source: Carrier call cost calculation, if enabled, is always done postpaid. Carriers with negative balance are allowed and no call will be hung up when carrier balance reaches 0.
es: El cálculo del costo de la llamada del operador, si está habilitado, siempre se realiza postpago. Se permiten operadores con saldo negativo y no se colgará ninguna llamada cuando el saldo del operador llegue a 0.

source: Concepts
es: Conceptos

source: This topic will cover every topic involved in the billing process:
es: Este tema cubrirá todos los temas involucrados en el proceso de tarificación:
