Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/billing/rating_plans.po
Languages: es

source: Rating plans
es: Planes de tarifas

source: Rating plans describe how calls are rated for different destinations at different times of the day.
es: Los planes de tarifas describen cómo se califican las llamadas para diferentes destinos en diferentes momentos del día.

source: Rating plan definition
es: Definición del plan de tarifas

source: :ref:`Destination rates` are grouped using Rating plans. This offers the possibility to have base pricing data and customize some destinations with different prices at different times of the day.
es: :ref:`Tarifas de destino<Destination rates>` se agrupan utilizando planes de tarifas. Esto ofrece la posibilidad de tener datos de precios base y personalizar algunos destinos con diferentes precios en diferentes momentos del día.

source: This are the fields that define a Rating plan:
es: Estos son los campos que definen un plan de tarifas:

source: Name
es: Nombre

source: Name that will be use to reference this rating plan.
es: Nombre que se utilizará para referenciar este plan de tarifas.

source: Description
es: Descripción

source: A field to enter additional information. Not used anywhere.
es: Un campo para ingresar información adicional. No se usa en ningún lugar.

source: Currency
es: Moneda

source: All destination rates grouped must use this currency.
es: Todas las tarifas de destino agrupadas deben usar esta moneda.

source: Rating plan names appear on final clients' invoices, choose something with commercial sense.
es: Los nombres de los planes de tarifas aparecen en las facturas de los clientes finales, elija algo con sentido comercial.

source: Adding Destination rates to Rating Plan
es: Agregar tarifas de destino al plan de tarifas

source: Rating plans group several :ref:`destination rates` to allow flexible configuration that rate destinations differently at different times of the day (**List of destination rates** subsection).
es: Los planes de tarifas agrupan varias :ref:`tarifas de destino <destination rates>` para permitir una configuración flexible que califique los destinos de manera diferente en diferentes momentos del día (subsección **Lista de tarifas de destino**).

source: Destination rate
es: Tarifa de destino

source: Adds selected destination rate to rating plan
es: Agrega la tarifa de destino seleccionada al plan de tarifas

source: Weight
es: Peso

source: If a given call can be billed with more than one destination rate within the rating plan, it will be billed using the one with highest weight.
es: Si una llamada determinada se puede facturar con más de una tarifa de destino dentro del plan de tarifas, se facturará utilizando la que tenga mayor peso.

source: Timing type
es: Tipo de tiempo

source: Should this association apply always or just at given times of the week?
es: ¿Debe aplicarse esta asociación siempre o solo en determinados momentos de la semana?

source: Weight allows having a general *Destination rate* and concrete the price of a specific destination in another *destination rate* with higher weight (free cell phone calls, for example).
es: El peso permite tener una *tarifa de destino* general y concretar el precio de un destino específico en otra *tarifa de destino* con mayor peso (llamadas a teléfonos móviles gratuitas, por ejemplo).

source: A rating plan MUST be capable of rating calls 24x7. Adding the timings of all destination rates in a rating plan MUST cover every moment of the week.
es: Un plan de tarifas DEBE ser capaz de calificar llamadas 24x7. Agregar los horarios de todas las tarifas de destino en un plan de tarifas DEBE cubrir cada momento de la semana.

source: Checking Rating plans
es: Verificación de planes de tarifas

source: To check the configuration so far we can **Simulate a call** from the rating plans list.
es: Para verificar la configuración hasta ahora, podemos **Simular una llamada** desde la lista de planes de tarifas.

source: We introduce the destination number in :ref:`E.164 format <e164>`, and we can check the price every rating plan on the list will charge for that call.
es: Introducimos el número de destino en :ref:`formato E.164 <e164>`, y podemos verificar el precio que cada plan de tarifas en la lista cobrará por esa llamada.

source: Rating plans can be linked to both Clients (for price calculation) and Carriers (for cost calculation).
es: Los planes de tarifas pueden estar vinculados tanto a Clientes (para el cálculo del precio) como a Operadores (para el cálculo del costo).

source: Assigning rating plans to clients
es: Asignación de planes de tarifas a clientes

source: An specific **rating plan** can be linked to multiple clients.
es: Un **plan de tarifas** específico puede estar vinculado a múltiples clientes.

source: In the section **Brand configuration** > **Virtual PBXs** (**Residential**, **Retail** and **Wholesale**) we select **List of Rating Plans** subsection.
es: En la sección **Configuración de la marca** > **PBX virtuales** (**Residencial**, **Minorista** y **Mayorista**) seleccionamos la subsección **Lista de planes de tarifas**.

source: Every **Rating plan** has an activation time and only one can be active for each client at a specific moment (the one whose activation time is nearer in the past).
es: Cada **plan de tarifas** tiene un tiempo de activación y solo uno puede estar activo para cada cliente en un momento específico (el que tenga el tiempo de activación más cercano en el pasado).

source: Simulating a call of a specific client
es: Simulación de una llamada de un cliente específico

source: In this list we can also simulate a call for a given client like we did previously in the rating plan list and check the price it will imply. This way, we can be sure that the configuration is ok.
es: En esta lista también podemos simular una llamada para un cliente determinado como lo hicimos anteriormente en la lista de planes de tarifas y verificar el precio que implicará. De esta manera, podemos estar seguros de que la configuración es correcta.

source: Active rating plan of a given client will be used to set Price for its calls.
es: El plan de tarifas activo de un cliente determinado se utilizará para establecer el precio de sus llamadas.

source: Assigning rating plans to carriers
es: Asignación de planes de tarifas a operadores

source: An specific **rating plan** can be linked to multiple carriers to calculate cost of calls (see :ref:`Cost calculation`).
es: Un **plan de tarifas** específico puede estar vinculado a múltiples operadores para calcular el costo de las llamadas (ver :ref:`Cálculo de costos <Cost calculation>`).

source: In the section **Brand configuration** > **Providers** > **Carriers** we select **List of Rating Plans** subsection.
es: En la sección **Configuración de la marca** > **Proveedores** > **Operadores** seleccionamos la subsección **Lista de planes de tarifas**.

source: Simulating a call of a specific carrier
es: Simulación de una llamada de un operador específico

source: In this list we can also simulate a call for a given carrier like we did previously in the rating plan list and check the price it will imply. This way, we can be sure that the configuration is ok.
es: En esta lista también podemos simular una llamada para un operador determinado como lo hicimos anteriormente en la lista de planes de tarifas y verificar el precio que implicará. De esta manera, podemos estar seguros de que la configuración es correcta.

source: Active rating plan of a given carrier will be used to set Cost for calls established using it.
es: El plan de tarifas activo de un operador determinado se utilizará para establecer el costo de las llamadas establecidas utilizando dicho operador.
