Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basic_concepts/intro/what_*_ivozprovider.po
Languages: is

source: What is IvozProvider?
is: ¿Qué es IvozProvider?

source: IvozProvider is a :ref:`provider oriented <operator_oriented>` :ref:`multilevel <multilevel>` :ref:`IP telephony <voip>` solution :ref:`exposed to the public network <exposed>`.
is: IvozProvider es una solución de :ref:`telefonía IP <voip>` :ref:`multinivel <multilevel>` :ref:`orientada al proveedor <operator_oriented>` :ref:`expuesta a la red pública <exposed>`.

source: IP Telephony
is: Telefonía IP

source: IvozProvider supports telephony systems that use *Session Initiation Protocol*, **SIP**, described in `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ and any `related RFCs <https://www.packetizer.com/ipmc/sip/standards.html>`_ independent of manufacturers.
is: IvozProvider soporta sistemas de telefonía que utilizan el *Protocolo de Inicio de Sesión*, **SIP**, descrito en el `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ y cualquier `RFC relacionado <https://www.packetizer.com/ipmc/sip/standards.html>`_ independiente de los fabricantes.

source: This allows total freedom to choose *softphones*, *hardphones* and the rest of elements that interact with IvozProvider, without any kind of binding with a manufacturer.
is: Esto permite total libertad para elegir *softphones*, *hardphones* y el resto de elementos que interactúan con IvozProvider, sin ningún tipo de vinculación con un fabricante.

source: Right now, IvozProvider supports the following **transport protocols** for SIP:
is: En este momento, IvozProvider soporta los siguientes **protocolos de transporte** para SIP:

source: This last transport protocol described in `RFC 7118 <https://tools.ietf.org/html/rfc7118>`_ supports web integrated softphones, using the `WebRTC <https://webrtc.org/>`_ standard allowing browsers to establish real-time *peer-to-peer* connections.
is: Este último protocolo de transporte descrito en el `RFC 7118 <https://tools.ietf.org/html/rfc7118>`_ soporta softphones integrados en la web, utilizando el estándar `WebRTC <https://webrtc.org/>`_ que permite a los navegadores establecer conexiones *peer-to-peer* en tiempo real.

source: The **supported audio codec** list is:
is: La lista de **códecs de audio soportados** es:

source: G.729 (manual installation required)
is: G.729 (se requiere instalación manual)

source: Multilevel
is: Multinivel

source: The web portal design of IvozProvider allows **multiple actors within the same infrastructure**:
is: El diseño del portal web de IvozProvider permite **múltiples actores dentro de la misma infraestructura**:

source: In :ref:`operation_roles` section, the different roles are deeply described, but to sum up:
is: En la sección :ref:`operation_roles`, se describen en profundidad los diferentes roles, pero para resumir:

source: **God Admin**: The administrator and maintainer of the solution. Provides access to multiple brand operators.
is: **God Admin**: El administrador y mantenedor de la solución. Proporciona acceso a múltiples operadores de marca.

source: **Brand Operator**: Responsible of configuring carrier routing, billing and invoicing to multiple clients.
is: **Brand Operator**: Responsable de configurar el enrutamiento de operadores, la facturación y la emisión de facturas a múltiples clientes.

source: **Client Operator**: Responsible of its own configuration and to manage the final platform users.
is: **Client Operator**: Responsable de su propia configuración y de gestionar los usuarios finales de la plataforma.

source: **Users**: The last link of the chain, has SIP credentials and can access its own portal for custom configurations. This level is only available for vPBX client types.
is: **Usuarios**: El último eslabón de la cadena, tiene credenciales SIP y puede acceder a su propio portal para configuraciones personalizadas. Este nivel sólo está disponible para tipos de clientes vPBX.

source: **Each one** of this roles **has its own portal** that allows them to fulfill their tasks. Each portal can be customized in the following ways:
is: **Cada uno** de estos roles **tiene su propio portal** que les permite cumplir con sus tareas. Cada portal puede ser personalizado de las siguientes maneras:

source: Themes and *skins* for corporate colours.
is: Temas y *skins* para colores corporativos.

source: Client Logos.
is: Logos de clientes.

source: Customized URLs with the Brand or Client domain.
is: URLs personalizadas con el dominio de la Marca o del Cliente.

source: Provider oriented
is: Orientado al proveedor

source: IvozProvider is a telephony solution **designed with horizontal scaling in mind**. This allows handling a great amount of **traffic and users** only by increasing the machines and resources of them.
is: IvozProvider es una solución de telefonía **diseñada con la escalabilidad horizontal en mente**. Esto permite manejar una gran cantidad de **tráfico y usuarios** simplemente aumentando las máquinas y los recursos de las mismas.

source: This are the main ideas that makes this product provider oriented:
is: Estas son las ideas principales que hacen que este producto esté orientado al proveedor:

source: Despite the fact that all machine profiles can run in the same host, what makes it easier for the initial testing, each profile of IvozProvider can be separated from the rest to make it run in its own machine.
is: A pesar de que todos los perfiles de máquina pueden ejecutarse en el mismo host, lo que facilita las pruebas iniciales, cada perfil de IvozProvider puede separarse del resto para ejecutarse en su propia máquina.

source: A **distributed installation** allows to distribute the correct amount of resources to each task, but also:
is: Una **instalación distribuida** permite distribuir la cantidad correcta de recursos a cada tarea, pero también:

source: Geographic distribution of elements to warranty high availability in case of CPD failure.
is: Distribución geográfica de elementos para garantizar alta disponibilidad en caso de fallo del CPD.

source: Setup of key elements near the final users, to minimize the communication latencies.
is: Configuración de elementos clave cerca de los usuarios finales, para minimizar las latencias de comunicación.

source: Horizontal scaling of key profiles to handle hundred of thousands concurrent calls.
is: Escalabilidad horizontal de perfiles clave para manejar cientos de miles de llamadas concurrentes.

source: The resource consuming elements that limit the service of VoIP solutions use to be:
is: Los elementos que consumen recursos y que limitan el servicio de las soluciones VoIP suelen ser:

source: Already established calls audio management.
is: Gestión de audio de llamadas ya establecidas.

source: Managing configuration for each client administrator (IVRs, conference rooms, external call filters, etc.)
is: Gestión de la configuración para cada administrador de cliente (IVRs, salas de conferencias, filtros de llamadas externas, etc.)

source: Databases of configuration and records.
is: Bases de datos de configuración y registros.

source: IvozProvider was designed always keeping in mind the **horizontal scaling** of each of its elements, so it **can handle thousands concurrent calls** and what is more important, **adapt the platform resources to the expected service quality**:
is: IvozProvider fue diseñado siempre teniendo en cuenta la **escalabilidad horizontal** de cada uno de sus elementos, por lo que **puede manejar miles de llamadas concurrentes** y lo que es más importante, **adaptar los recursos de la plataforma a la calidad de servicio esperada**:

source: **Media-relay** servers handle audio frames for the already established calls:
is: Los servidores de **Media-relay** manejan los marcos de audio para las llamadas ya establecidas:

source: You can use as many media-relays as you need.
is: Puede usar tantos media-relays como necesite.

source: You can join media-relay in groups, and force some clients to use a group if you want.
is: Puede unir media-relays en grupos y obligar a algunos clientes a usar un grupo si lo desea.

source: You can setup media-relays near the final users, to minimize network latencies in the calls.
is: Puede configurar media-relays cerca de los usuarios finales, para minimizar las latencias de red en las llamadas.

source: **Application servers** are in charge of processing the configured logic:
is: Los **servidores de aplicaciones** son los encargados de procesar la lógica configurada:

source: They scale horizontally: new Application Serves can be installed and added to the pool if you feel the need.
is: Escalan horizontalmente: se pueden instalar nuevos servidores de aplicaciones y agregarlos al grupo si lo considera necesario.

source: Every call is handled by the least busy Application Server
is: Cada llamada es manejada por el servidor de aplicaciones menos ocupado

source: By default, there is no static assignment * between Clients and Application Servers. This way failure of any Application Server is not critical: the platform will ignore the faulty Application Server while distributing calls.
is: Por defecto, no hay asignación estática * entre Clientes y Servidores de Aplicaciones. De esta manera, la falla de cualquier Servidor de Aplicaciones no es crítica: la plataforma ignorará el Servidor de Aplicaciones defectuoso mientras distribuye las llamadas.

source: Exposed to the public network
is: Expuesto a la red pública

source: As showed in the installation process, **IvozProvider is designed to serve users directly from Internet**. Although it can be used in local environments, IvozProvider is designed to use public IP addresses for its services, removing the need of VPN or IPSec tunnels that connect the infrastructure with the final users
is: Como se muestra en el proceso de instalación, **IvozProvider está diseñado para servir a los usuarios directamente desde Internet**. Aunque se puede utilizar en entornos locales, IvozProvider está diseñado para utilizar direcciones IP públicas para sus servicios, eliminando la necesidad de túneles VPN o IPSec que conecten la infraestructura con los usuarios finales.

source: Highlights:
is: Aspectos destacados:

source: Only the required services will be exposed to Internet.
is: Solo los servicios requeridos estarán expuestos a Internet.

source: The untrusted origins access can be filtered out by integrated firewall
is: El acceso desde orígenes no confiables puede ser filtrado por el firewall integrado

source: Access from IP addresses or networks can be filtered to avoid any kind of phishing.
is: El acceso desde direcciones IP o redes puede ser filtrado para evitar cualquier tipo de phishing.

source: There is also an anti-flood mechanism to avoid short-life Denial of Service attacks.
is: También hay un mecanismo anti-flood para evitar ataques de Denegación de Servicio de corta duración.

source: Each client concurrent calls can be limited to a fixed amount.
is: Cada cliente puede tener un número limitado de llamadas concurrentes.

source: IvozProvider supports connection from terminals behind `NAT <https://en.wikipedia.org/wiki/Network_address_translation>`_.
is: IvozProvider soporta la conexión desde terminales detrás de `NAT <https://en.wikipedia.org/wiki/Network_address_translation>`_.

source: IvozProvider keep track of those NAT windows and keep them alive with *nat-piercing* mechanisms.
is: IvozProvider realiza un seguimiento de esas ventanas NAT y las mantiene activas con mecanismos de *nat-piercing*.

source: The global administrator can assign Application Servers to some client types but this feature is more designed as a temporal debug and troubleshoot measure.
is: El administrador global puede asignar Servidores de Aplicaciones a algunos tipos de clientes, pero esta característica está más diseñada como una medida temporal de depuración y solución de problemas.
