Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security_and_maintenance/maintenance/other_tools.po
Languages: es

source: Other tools
es: Otras herramientas

source: Although IvozProvider does not include any of the tools mentioned here, we consider them crucial for dealing with production environments.
es: Aunque IvozProvider no incluye ninguna de las herramientas mencionadas aquí, las consideramos cruciales para manejar entornos de producción.

source: We list here tools configured in all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_.
es: Aquí enumeramos las herramientas configuradas en todas las instalaciones de producción de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_.

source: Metrics viewer
es: Visor de métricas

source: `Chronograf web interface <https://www.influxdata.com/time-series-platform/chronograf/>`_ showing information collected by remaining `TICK Stack components <https://www.influxdata.com/time-series-platform/>`_, allow us to show:
es: `Interfaz web de Chronograf <https://www.influxdata.com/time-series-platform/chronograf/>`_ mostrando información recopilada por los demás `componentes del TICK Stack <https://www.influxdata.com/time-series-platform/>`_, nos permite mostrar:

source: Realtime system metrics.
es: Métricas del sistema en tiempo real.

source: Realtime VoIP metrics.
es: Métricas VoIP en tiempo real.

source: Custom dashboard per profile.
es: Panel personalizado por perfil.

source: `Kapacitor component <https://www.influxdata.com/time-series-platform/kapacitor/>`_ allows setting alarms when anomalous metrics happen or certain thresholds are exceeded.
es: El `componente Kapacitor <https://www.influxdata.com/time-series-platform/kapacitor/>`_ permite configurar alarmas cuando ocurren métricas anómalas o se superan ciertos umbrales.

source: Active monitoring
es: Monitoreo activo

source: All IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_ are thoroughly monitored to solve problems as soon as possible and to prevent future problems when possible.
es: Todas las instalaciones de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_ son monitoreadas exhaustivamente para resolver problemas lo antes posible y prevenir problemas futuros cuando sea posible.
