Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basic_concepts/architecture/index.po
Languages: es

source: Platform general architecture
es: Arquitectura general de la plataforma

source: General diagram
es: Diagrama general

source: Following diagram shows the global architecture of IvozProvider solution, with all its components:
es: El siguiente diagrama muestra la arquitectura global de la solución IvozProvider, con todos sus componentes:

source: This is a more conceptual diagram:
es: Este es un diagrama más conceptual:

source: SIP signalling flow
es: Flujo de señalización SIP

source: The first diagram shows the SIP signalling traffic involved in the establishment, modification and termination of sessions following the SIP `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ and any `related RFCs <https://www.packetizer.com/ipmc/sip/standards.html>`_.
es: El primer diagrama muestra el tráfico de señalización SIP involucrado en el establecimiento, modificación y terminación de sesiones siguiendo el SIP `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ y cualquier `RFC relacionado <https://www.packetizer.com/ipmc/sip/standards.html>`_.

source: These are the **external SIP entities** involved:
es: Estas son las **entidades SIP externas** involucradas:

source: UACs: users hardphones, softphones, SIP-capable gadget.
es: UACs: teléfonos fijos de usuarios, softphones, dispositivos compatibles con SIP.

source: SIP carriers/DDI Providers: carriers used to interconnect IvozProvider with external SIP networks (and, probably, with PSTN).
es: Operadores SIP/Proveedores DDI: operadores utilizados para interconectar IvozProvider con redes SIP externas (y, probablemente, con PSTN).

source: All the SIP traffic (in any of the supported transports: TCP, UDP, TLS, WSS) they send/receive is to/from this two **internal SIP entities** of IvozProvider:
es: Todo el tráfico SIP (en cualquiera de los transportes soportados: TCP, UDP, TLS, WSS) que envían/reciben es hacia/desde estas dos **entidades SIP internas** de IvozProvider:

source: Users SIP Proxy (running `Kamailio <https://www.kamailio.org>`_).
es: Proxy SIP de Usuarios (ejecutando `Kamailio <https://www.kamailio.org>`_).

source: Trunks SIP Proxy (running `Kamailio <https://www.kamailio.org>`_).
es: Proxy SIP de Trunks (ejecutando `Kamailio <https://www.kamailio.org>`_).

source: In fact, users UACs only talk to *Users SIP Proxy* and 'SIP carriers' and 'DDI
es: De hecho, los UACs de usuarios solo hablan con el *Proxy SIP de Usuarios* y los 'Operadores SIP' y 'Proveedores DDI'.

source: Providers' only talk to *Trunks SIP Proxy*.
es: Los Proveedores solo hablan con el *Proxy SIP de Trunks*.

source: Inside IvozProvider these two proxies may talk to *Application Servers* running `Asterisk <http://www.asterisk.org/>`_ for some client types but **no external element is allowed to talk to Application Servers directly**.
es: Dentro de IvozProvider, estos dos proxies pueden hablar con *Servidores de Aplicaciones* ejecutando `Asterisk <http://www.asterisk.org/>`_ para algunos tipos de clientes, pero **no se permite que ningún elemento externo hable directamente con los Servidores de Aplicaciones**.

source: RTP audio flow
es: Flujo de audio RTP

source: Sessions initiated by SIP signalling protocol imply media streams shared by involved entities.
es: Las sesiones iniciadas por el protocolo de señalización SIP implican flujos de medios compartidos por las entidades involucradas.

source: This media streams use `RTP <https://tools.ietf.org/html/rfc3550>`_ to send and receive the media itself, usually using UDP as a transport protocol.
es: Estos flujos de medios utilizan `RTP <https://tools.ietf.org/html/rfc3550>`_ para enviar y recibir los medios en sí, generalmente utilizando UDP como protocolo de transporte.

source: **External entities** involved in RTP sessions can be divided in:
es: **Entidades externas** involucradas en sesiones RTP se pueden dividir en:

source: Clients endpoints.
es: Puntos finales de clientes.

source: Carriers/DDI Providers.
es: Operadores/Proveedores DDI.

source: Both entities exchanges RTP with the same IvozProvider entity: *media-relays*.
es: Ambas entidades intercambian RTP con la misma entidad de IvozProvider: *media-relays*.

source: IvozProvider implements *media-relays* using `RTPengine <https://github.com/sipwise/rtpengine>`_.
es: IvozProvider implementa *media-relays* utilizando `RTPengine <https://github.com/sipwise/rtpengine>`_.

source: Similar to SIP, these *media-relays* exchanges RTP when is needed with *Application Servers*, but **external entities never talk directly to them**.
es: Similar al SIP, estos *media-relays* intercambian RTP cuando es necesario con *Servidores de Aplicaciones*, pero **las entidades externas nunca hablan directamente con ellos**.

source: HTTPS traffic
es: Tráfico HTTPS

source: HTTPS is the third traffic type exchanged between IvozProvider and *external world*.
es: HTTPS es el tercer tipo de tráfico intercambiado entre IvozProvider y el *mundo exterior*.

source: HTTPS traffic is used for:
es: El tráfico HTTPS se utiliza para:

source: **Terminal provisioning**: several hardphones ask for their configuration when they wake up and this configuration files can be served through HTTPS.
es: **Provisionamiento de terminales**: varios teléfonos fijos solicitan su configuración cuando se encienden y estos archivos de configuración se pueden servir a través de HTTPS.

source: **Web portals**: IvozProvider has 4-level web portals for all the :ref:`platform roles <operation_roles>`.
es: **Portales web**: IvozProvider tiene portales web de 4 niveles para todos los :ref:`roles de la plataforma <operation_roles>`.

source: Both of these traffics are handled by *Web portals* IvozProvider entity.
es: Ambos tipos de tráfico son manejados por la entidad *Portales web* de IvozProvider.

source: Additional elements
es: Elementos adicionales

source: IvozProvider has multiple elements that are not exposed to the *external world* but play a crucial task.
es: IvozProvider tiene múltiples elementos que no están expuestos al *mundo exterior* pero desempeñan una tarea crucial.

source: The most remarkable profile is **database profile** that gathers all the information of the platform and shares it between the majority of software packaged. IvozProvider uses `MySQL database engine <https://www.mysql.com/>`_ for this task.
es: El perfil más notable es el **perfil de base de datos** que recopila toda la información de la plataforma y la comparte entre la mayoría del software empaquetado. IvozProvider utiliza el `motor de base de datos MySQL <https://www.mysql.com/>`_ para esta tarea.

source: Another remarkable task is **asynchronous tasks handler** in charge of encoding recordings, generating invoices, reloading services, importing data, etc.
es: Otra tarea notable es el **manejador de tareas asincrónicas** encargado de codificar grabaciones, generar facturas, recargar servicios, importar datos, etc.

source: Auxiliary elements
es: Elementos auxiliares

source: **Aux profile** runs software that, even though is not vital for calls placing, makes IvozProvider maintainer's life much easier.
es: El **perfil Aux** ejecuta software que, aunque no es vital para la realización de llamadas, hace la vida del mantenedor de IvozProvider mucho más fácil.

source: In fact, without them, debugging problems would be much harder and the quality of given service would be damaged.
es: De hecho, sin ellos, la depuración de problemas sería mucho más difícil y la calidad del servicio prestado se vería afectada.

source: Although IvozProvider does not include any of the tools mentioned here, we consider them crucial for dealing with production environments.
es: Aunque IvozProvider no incluye ninguna de las herramientas mencionadas aquí, las consideramos cruciales para tratar con entornos de producción.

source: We list here tools configured in all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_:
es: Aquí enumeramos las herramientas configuradas en todas las instalaciones de IvozProvider en producción mantenidas por `Irontec <https://www.irontec.com>`_:

source: **Homer SIP capture**: This amazing software lets us capture all the SIP traffic for later analysis, for obtaining statistics, call quality measuring, etc. Visit `SIP Capture website <http://sipcapture.org/>`_ for more information.
es: **Captura SIP de Homer**: Este increíble software nos permite capturar todo el tráfico SIP para su posterior análisis, para obtener estadísticas, medir la calidad de las llamadas, etc. Visita el `sitio web de SIP Capture <http://sipcapture.org/>`_ para más información.

source: **Kibana log viewer**: Showing logs collected by remaining `ELK stack components <https://www.elastic.co/elk-stack>`_.
es: **Visor de logs de Kibana**: Mostrando logs recopilados por los restantes `componentes de la pila ELK <https://www.elastic.co/elk-stack>`_.

source: **Chronograf metric viewer**: Showing metrics collected by remaining `TICK stack components <https://www.influxdata.com/time-series-platform/>`_.
es: **Visor de métricas de Chronograf**: Mostrando métricas recopiladas por los restantes `componentes de la pila TICK <https://www.influxdata.com/time-series-platform/>`_.
