Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/settings/generic_services.po
Languages: es

source: Generic Services
es: Servicios Genéricos

source: This section allows the brand operator to change the default services and default service codes for new clients.
es: Esta sección permite al operador de la marca cambiar los servicios predeterminados y los códigos de servicio predeterminados para nuevos clientes.

source: By default this list has all the services and codes from the god level **Service** section.
es: Por defecto, esta lista tiene todos los servicios y códigos de la sección **Servicio** del nivel superior.

source: Changing/deleting the default code in this section will only affect new created clients. Existing clients codes won't be modified.
es: Cambiar/eliminar el código predeterminado en esta sección solo afectará a los nuevos clientes creados. Los códigos de los clientes existentes no se modificarán.

source: Call forward services
es: Servicios de desvío de llamadas

source: Call forward services (unconditional, no answer, busy and unreachable) are **only available for residential clients** and allow adding **call forward to national phone numbers and to voicemail**.
es: Los servicios de desvío de llamadas (incondicional, sin respuesta, ocupado e inalcanzable) **solo están disponibles para clientes residenciales** y permiten agregar **desvío de llamadas a números de teléfono nacionales y al buzón de voz**.

source: All residential **clients within a brand use the same codes** to access to this feature, those defined in this section.
es: Todos los **clientes residenciales dentro de una marca usan los mismos códigos** para acceder a esta función, los definidos en esta sección.

source: Call forward to numbers outside company's country is not supported using services codes. Use web portal instead.
es: El desvío de llamadas a números fuera del país de la empresa no es compatible usando códigos de servicios. Use el portal web en su lugar.

source: Enabling a call forward setting
es: Habilitar una configuración de desvío de llamadas

source: To enable a call forward of a given type to forward calls to a national number, residential device must call to defined service code followed by destination number. This will create and enable (or modify if already exists one) a call forward of given type to that national number.
es: Para habilitar un desvío de llamadas de un tipo dado a un número nacional, el dispositivo residencial debe llamar al código de servicio definido seguido del número de destino. Esto creará y habilitará (o modificará si ya existe uno) un desvío de llamadas del tipo dado a ese número nacional.

source: To enable a call forward of a given type to forward calls to voicemail, residential device must call to defined service code followed by '*'. This will create and enable (or modify if already exists one) a call forward of given type to voicemail.
es: Para habilitar un desvío de llamadas de un tipo dado al buzón de voz, el dispositivo residencial debe llamar al código de servicio definido seguido de '*'. Esto creará y habilitará (o modificará si ya existe uno) un desvío de llamadas del tipo dado al buzón de voz.

source: Disabling a call forward setting
es: Deshabilitar una configuración de desvío de llamadas

source: Calling to the code without any additional number will delete all active call forward settings of that type.
es: Llamar al código sin ningún número adicional eliminará todas las configuraciones de desvío de llamadas activas de ese tipo.
