Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/settings/numeric_transformations.po
Languages: es

source: Numeric transformations
es: Transformaciones numéricas

source: **IvozProvider** is designed to provide service **anywhere in the planet**, not only the original country where the platform is installed.
es: **IvozProvider** está diseñado para proporcionar servicio **en cualquier lugar del planeta**, no solo en el país original donde se instaló la plataforma.

source: A very important concept to achieve this goal is the numeric transformation, that **adapts the different number format systems of the countries of the world** defined in `E.164 <https://www.itu.int/rec/T-REC-E.164/es>`_ **to a neutral format**.
es: Un concepto muy importante para lograr este objetivo es la transformación numérica, que **adapta los diferentes sistemas de formato de números de los países del mundo** definidos en `E.164 <https://www.itu.int/rec/T-REC-E.164/es>`_ **a un formato neutral**.

source: Numeric transformation *sets* must be assigned to :ref:`Carriers`, :ref:`DDI Providers`, **Clients** and **User endpoints** (Users, Friends, retail accounts, residential devices, etc.) to define the way every entity talks with IvozProvider.
es: Los *conjuntos* de transformación numérica deben asignarse a :ref:`Operadores <Carriers>`, :ref:`Proveedores DDI <DDI Providers>`, **Clientes** y **Puntos finales de usuario** (Usuarios, Amigos, cuentas minoristas, dispositivos residenciales, etc.) para definir la forma en que cada entidad se comunica con IvozProvider.

source: There are two different transformation scenarios:
es: Hay dos escenarios de transformación diferentes:

source: Incoming transformations
es: Transformaciones entrantes

source: When a new call is received in IvozProvider matching a provider that has been configured for *peering*, we must adapt the numbers that make reference to:
es: Cuando se recibe una nueva llamada en IvozProvider que coincide con un proveedor que ha sido configurado para *peering*, debemos adaptar los números que hacen referencia a:

source: Origin of the call
es: Origen de la llamada

source: Destination of the call
es: Destino de la llamada

source: Depending on the country of the provider, the international numbers will have a format or another. In this case, the spanish provider will use, for example:
es: Dependiendo del país del proveedor, los números internacionales tendrán un formato u otro. En este caso, el proveedor español usará, por ejemplo:

source: 00 + 33 + number belonging to France
es: 00 + 33 + número perteneciente a Francia

source: It's possible that the international numbers came without the 00 code.
es: Es posible que los números internacionales vengan sin el código 00.

source: It's possible that, if the call comes from the same country that the provider, the number comes without the calling code (911234567 instead of 00 + 34 + 911234567 for Spain).
es: Es posible que, si la llamada proviene del mismo país que el proveedor, el número venga sin el código de llamada (911234567 en lugar de 00 + 34 + 911234567 para España).

source: For an Ukranian provider, that doesn't use the 00 as international code:
es: Para un proveedor ucraniano, que no usa el 00 como código internacional:

source: It will use 810 + 33 + number belonging to France.
es: Usará 810 + 33 + número perteneciente a Francia.

source: It's possible that even part of the international code (00 in most of the countries of the world) the provider use specific codes as prefix.
es: Es posible que incluso parte del código internacional (00 en la mayoría de los países del mundo) el proveedor use códigos específicos como prefijo.

source: The goal of the incoming transformation is that, no matter what numeric system the provider uses, the number will end in a general and common format.
es: El objetivo de la transformación entrante es que, sin importar qué sistema numérico use el proveedor, el número termine en un formato general y común.

source: This common format is usually called E.164 and shows the numbers without international code, but with country calling code: i.e. +34911234567
es: Este formato común generalmente se llama E.164 y muestra los números sin código internacional, pero con el código de país: es decir, +34911234567

source: Outgoing transformations
es: Transformaciones salientes

source: In the same way the origin and destination must adapt incoming numbers, it will be required to adapt outgoing dialed numbers to properly work with each of the providers that will route our call.
es: De la misma manera que el origen y el destino deben adaptar los números entrantes, será necesario adaptar los números marcados salientes para que funcionen correctamente con cada uno de los proveedores que enrutarán nuestra llamada.

source: For example, for a number with spanish number system:
es: Por ejemplo, para un número con sistema numérico español:

source: *Spanish provider*: Destination will come in E164 (+34911234567) and for this provider, we can remove the calling code (will understand it belongs to its country), so the number sent to them will be 911234567.
es: *Proveedor español*: El destino vendrá en E164 (+34911234567) y para este proveedor, podemos eliminar el código de llamada (entenderá que pertenece a su país), por lo que el número enviado será 911234567.

source: *French provider*: The destination will come in E164 (+34911234567) and we must add the international code for France, so the number sent to them will be 0034911234567.
es: *Proveedor francés*: El destino vendrá en E164 (+34911234567) y debemos agregar el código internacional para Francia, por lo que el número enviado será 0034911234567.

source: To sum up, we aim to send the origin and destination in the format the provider is expecting.
es: En resumen, nuestro objetivo es enviar el origen y el destino en el formato que el proveedor espera.

source: Numeric transformation uses `simple regular expressions <https://es.wikipedia.org/wiki/Expresi%C3%B3n_regular>`_ to describe the changes done to the numbers. You can find multiple tutorials on net with the basic regular expression format.
es: La transformación numérica utiliza `expresiones regulares simples <https://es.wikipedia.org/wiki/Expresi%C3%B3n_regular>`_ para describir los cambios realizados a los números. Puedes encontrar múltiples tutoriales en la red con el formato básico de expresiones regulares.

source: Add a new transformation set
es: Agregar un nuevo conjunto de transformaciones

source: IvozProvider comes with an automatic transformation rules generator that fits with most of the countries.
es: IvozProvider viene con un generador automático de reglas de transformación que se adapta a la mayoría de los países.

source: In order to create a new set of transformations use **Add Numeric transformations**:
es: Para crear un nuevo conjunto de transformaciones, usa **Agregar transformaciones numéricas**:

source: Name
es: Nombre

source: Use to reference this numeric transformation set
es: Usar para referenciar este conjunto de transformaciones numéricas

source: Description
es: Descripción

source: Additional information for each set
es: Información adicional para cada conjunto

source: Automatic creation of rules
es: Creación automática de reglas

source: If set, *Geographic Configuration* fields will be used to automatically configure the rules of the set.
es: Si se establece, los campos de *Configuración Geográfica* se usarán para configurar automáticamente las reglas del conjunto.

source: Geographic Configuration
es: Configuración Geográfica

source: International Code of the country, country code, trunk prefix if any, area code if any and national subscriber number length
es: Código Internacional del país, código de país, prefijo de troncal si lo hay, código de área si lo hay y longitud del número de suscriptor nacional

source: Example for Spain
es: Ejemplo para España

source: Fulfilling Geographic Configuration with:
es: Cumpliendo con la Configuración Geográfica con:

source: International Code: 00
es: Código Internacional: 00

source: Country Code: +34
es: Código de País: +34

source: Trunk Prefix: <empty>
es: Prefijo de Troncal: <vacío>

source: Area Code: <empty>
es: Código de Área: <vacío>

source: National number length: 9
es: Longitud del número nacional: 9

source: Auto-created rules will transform the numbers for spanish providers that follow these rules:
es: Las reglas creadas automáticamente transformarán los números para los proveedores españoles que sigan estas reglas:

source: A spanish number: Neither international nor calling code (34).
es: Un número español: Ni código internacional ni código de llamada (34).

source: Not a spanish number: International code (00) and calling code (34).
es: No es un número español: Código internacional (00) y código de llamada (34).

source: Let's check this *set* to understand what transformation rule does:
es: Vamos a revisar este *conjunto* para entender qué hace la regla de transformación:

source: The automatic rule generation will create 8 common rules based on the given parameters. This rules can be edited later to match the provider requirements.
es: La generación automática de reglas creará 8 reglas comunes basadas en los parámetros dados. Estas reglas se pueden editar más tarde para cumplir con los requisitos del proveedor.

source: Spanish incoming transformation
es: Transformación entrante española

source: Displayed in blue in the previous image:
es: Mostrado en azul en la imagen anterior:

source: Left called/destination
es: Llamado/destino a la izquierda

source: Right callee/origin
es: Llamado/origen a la derecha

source: The same rules will be applied for the origin and destination:
es: Las mismas reglas se aplicarán para el origen y el destino:

source: The **metric** field will be used to order the rules (smaller first).
es: El campo **métrica** se usará para ordenar las reglas (las más pequeñas primero).

source: If a rule doesn't *match*, the next rule is evaluated.
es: Si una regla no *coincide*, se evalúa la siguiente regla.

source: If a rule *matches*, no more rules are evaluated.
es: Si una regla *coincide*, no se evalúan más reglas.

source: If no rule *matches*, no change is applied.
es: Si ninguna regla *coincide*, no se aplica ningún cambio.

source: The **Search** field is evaluated against the number (depending of the transformation type it will be destination or origin).
es: El campo **Buscar** se evalúa contra el número (dependiendo del tipo de transformación será destino u origen).

source: The **Replace** field will use the capture groups that matched the Search field (displayed between brackets, \1 for the first one, \2 for the second one, and so on) to determine how the number will end.
es: El campo **Reemplazar** usará los grupos de captura que coincidieron con el campo Buscar (mostrados entre corchetes, \1 para el primero, \2 para el segundo, y así sucesivamente) para determinar cómo terminará el número.

source: Spanish outgoing transformation
es: Transformación saliente española

source: Following the same logic, this 2 rules make the change of the outgoing external destination numbers.
es: Siguiendo la misma lógica, estas 2 reglas realizan el cambio de los números de destino externos salientes.

source: **To sum up**: numeric transformation can adapt origin and destination numbers to E.164 for the platform, and to providers expected formats, based on regular expressions and metric that can be grouped in *sets* to be shared between multiple **Carriers**.
es: **En resumen**: la transformación numérica puede adaptar los números de origen y destino a E.164 para la plataforma, y a los formatos esperados por los proveedores, basado en expresiones regulares y métricas que se pueden agrupar en *conjuntos* para ser compartidos entre múltiples **Operadores**.

source: Conclusion
es: Conclusión

source: This is a key section that allows creating sets that will allow IvozProvider make needed numeric translations to 'talk' with all the external entities:
es: Esta es una sección clave que permite crear conjuntos que permitirán a IvozProvider realizar las traducciones numéricas necesarias para 'hablar' con todas las entidades externas:

source: Providers (carriers and DDI Providers)
es: Proveedores (operadores y proveedores DDI)

source: Client endpoints (Users, Friends, Retail accounts, Residential accounts, Wholesale clients)
es: Puntos finales del cliente (Usuarios, Amigos, Cuentas minoristas, Cuentas residenciales, Clientes mayoristas)

source: Those sets will:
es: Esos conjuntos:

source: Convert custom external format to E.164 for internal usage.
es: Convertirán el formato externo personalizado a E.164 para uso interno.

source: Convert E.164 to custom external format for external usage.
es: Convertirán E.164 a formato externo personalizado para uso externo.

source: Converted SIP headers:
es: Encabezados SIP convertidos:

source: Destination headers (R-URI/To/Refer-To)
es: Encabezados de destino (R-URI/To/Refer-To)

source: Source headers (From/RPID/PAI/Diversion)
es: Encabezados de origen (From/RPID/PAI/Diversion)

source: For all these transformations `Regular Expressions <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_ knowledge is needed, unless automatic created rules work out of the box.
es: Para todas estas transformaciones se necesita conocimiento de `Expresiones Regulares <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_, a menos que las reglas creadas automáticamente funcionen de inmediato.
