Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/conditional_routes.po
Languages: es

source: Conditional routes
es: Rutas condicionales

source: Conditional routes allows changing a call logic depending on:
es: Las rutas condicionales permiten cambiar la lógica de una llamada dependiendo de:

source: Who is calling.
es: Quién está llamando.

source: What time is calling.
es: A qué hora está llamando.

source: What day is calling.
es: Qué día está llamando.

source: Status of selected route locks.
es: Estado de los bloqueos de ruta seleccionados.

source: These routes are electable in three sections:
es: Estas rutas son elegibles en tres secciones:

source: Extensions
es: Extensiones

source: IVR custom options
es: Opciones personalizadas de IVR

source: Remaining sections could use conditional routes creating an extension that point to a conditional route first, and routing to this extension.
es: Las secciones restantes podrían usar rutas condicionales creando una extensión que apunte primero a una ruta condicional y enrutando a esta extensión.

source: Creating a conditional route
es: Creando una ruta condicional

source: First of all we create a conditional route in **Conditional routes** section.
es: Primero creamos una ruta condicional en la sección **Rutas condicionales**.

source: On creation we define what should be done with a call that does not satisfy any of the rules added bellow.
es: Al crearla definimos qué se debe hacer con una llamada que no cumpla con ninguna de las reglas agregadas a continuación.

source: Adding rules
es: Agregando reglas

source: Once created, we need to add rules, for example:
es: Una vez creada, necesitamos agregar reglas, por ejemplo:

source: Calls from Japan and Germany received in the morning to an specific user
es: Llamadas de Japón y Alemania recibidas por la mañana a un usuario específico

source: Calls from Japan and Germany received in the afternoon to another user
es: Llamadas de Japón y Alemania recibidas por la tarde a otro usuario

source: Override the reception IVR for summer days
es: Anular el IVR de recepción para los días de verano

source: Evaluating conditional routes
es: Evaluando rutas condicionales

source: Rules are evaluated following the metric parameter. Once a rule matches, its logic is applied.
es: Las reglas se evalúan siguiendo el parámetro métrico. Una vez que una regla coincide, se aplica su lógica.

source: Rules may have from 1 to 4 criteria:
es: Las reglas pueden tener de 1 a 4 criterios:

source: None, one or more matchlist (pre-created, see :ref:`match_lists`)
es: Ninguna, una o más listas de coincidencia (pre-creadas, ver :ref:`listas de coincidencia <match_lists>`)

source: None, one or more schedules (pre-created, see :ref:`schedules`)
es: Ninguna, uno o más horarios (pre-creados, ver :ref:`horarios <schedules>`)

source: None, one or more calendar (pre-created, see :ref:`calendars`)
es: Ninguno, uno o más calendarios (pre-creados, ver :ref:`calendarios <calendars>`)

source: None, one or more route locks (pre-created, see :ref:`route locks`)
es: Ninguno, uno o más bloqueos de ruta (pre-creados, ver :ref:`bloqueos de ruta <route locks>`)

source: These 4 criteria are combined (applying an AND logic).
es: Estos 4 criterios se combinan (aplicando una lógica AND).

source: If all used criterias in a rule are fulfilled, its logic is applied.
es: Si se cumplen todos los criterios utilizados en una regla, se aplica su lógica.

source: This is how each criteria is evaluated:
es: Así es como se evalúa cada criterio:

source: Matchlist criteria
es: Criterio de lista de coincidencia

source: If caller number matches any of selected matchlist(s), this criteria is considered fulfilled.
es: Si el número del llamante coincide con alguna de las listas de coincidencia seleccionadas, este criterio se considera cumplido.

source: Schedule criteria
es: Criterio de horario

source: If current time is included in any of selected schedules, this criteria is considered fulfilled.
es: Si la hora actual está incluida en alguno de los horarios seleccionados, este criterio se considera cumplido.

source: Calendar criteria
es: Criterio de calendario

source: If current day is marked as holiday in any of selected calendars, this criteria is considered fulfilled.
es: Si el día actual está marcado como festivo en alguno de los calendarios seleccionados, este criterio se considera cumplido.

source: If current day is marked as non-wholeday holiday in any of selected calendars and current time is included in its interval, this criteria is considered fulfilled.
es: Si el día actual está marcado como festivo parcial en alguno de los calendarios seleccionados y la hora actual está incluida en su intervalo, este criterio se considera cumplido.

source: Lock criteria
es: Criterio de bloqueo

source: If one of selected route locks is open, this criteria is considered fulfilled.
es: Si uno de los bloqueos de ruta seleccionados está abierto, este criterio se considera cumplido.

source: :ref:`Special Schedules` linked to selected calendars are not taken into account.
es: :ref:`Horarios especiales <Special Schedules>` vinculados a los calendarios seleccionados no se tienen en cuenta.

source: DDI routed to a conditional route
es: DDI enrutado a una ruta condicional

source: Imagine this scenario: DDI has an external call filter and is routed to the new conditional route.
es: Imagina este escenario: el DDI tiene un filtro de llamadas externas y está enrutado a la nueva ruta condicional.

source: When a call is received:
es: Cuando se recibe una llamada:

source: External call filter is evaluated:
es: Se evalúa el filtro de llamadas externas:

source: If current day is marked in any calendar, the holiday logic applies.
es: Si el día actual está marcado en algún calendario, se aplica la lógica de festivo.

source: If current time is not inside any time-gap, out-of-schedule logic applies.
es: Si la hora actual no está dentro de ningún intervalo de tiempo, se aplica la lógica fuera de horario.

source: If external call filter logics have not applied, conditional route is evaluated.
es: Si no se han aplicado las lógicas del filtro de llamadas externas, se evalúa la ruta condicional.

source: Conditional route is not intended as an external call filter replacement. Filter is evaluated first, conditional route afterwards.
es: La ruta condicional no está destinada a reemplazar el filtro de llamadas externas. Primero se evalúa el filtro, luego la ruta condicional.
