Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/conference_rooms.po
Languages: es

source: Conference rooms
es: Salas de conferencias

source: IvozProvider supports Conference rooms that can be configured in the section **Client configuration** > **Conference rooms**.
es: IvozProvider soporta salas de conferencias que pueden configurarse en la sección **Configuración del cliente** > **Salas de conferencias**.

source: **In distributed installations** using Conferences is only compatible with an static assignment or 'hash based' distribution (see **Distribute method** :ref:`here <Virtual PBX>`).
es: **En instalaciones distribuidas** el uso de conferencias solo es compatible con una asignación estática o distribución 'basada en hash' (ver **Método de distribución** :ref:`aquí <Virtual PBX>`).

source: Brand operators can choose which Clients have conferences (see **Features** in :ref:`Brand Configuration` and :ref:`Client Configuration`).
es: Los operadores de marca pueden elegir qué Clientes tienen conferencias (ver **Características** en :ref:`Configuración de Marca <Brand Configuration>` y :ref:`Configuración del Cliente <Client Configuration>`).

source: Create a new audio conference
es: Crear una nueva conferencia de audio

source: The following image shows the process of creating a new conference room:
es: La siguiente imagen muestra el proceso de creación de una nueva sala de conferencias:

source: Name
es: Nombre

source: Name that will used to identify this conference room in other sections
es: Nombre que se utilizará para identificar esta sala de conferencias en otras secciones

source: Max members
es: Miembros máximos

source: Maximum number of participants in the conference. When this limit is reached, join requests will be rejected.
es: Número máximo de participantes en la conferencia. Cuando se alcance este límite, las solicitudes de unión serán rechazadas.

source: Announce user count
es: Anunciar número de usuarios

source: First member or always. Play a locution when joining a conference telling how many users there are already participating. Options are: only to the first member of the conference or anybody joining.
es: Primer miembro o siempre. Reproducir una locución al unirse a una conferencia indicando cuántos usuarios ya están participando. Las opciones son: solo al primer miembro de la conferencia o a cualquiera que se una.

source: Pin protected
es: Protegido por pin

source: Conference rooms can be pin protected. The pin will be requested before entering and must be numeric.
es: Las salas de conferencias pueden estar protegidas por pin. El pin se solicitará antes de entrar y debe ser numérico.

source: Member limit can be disabled by setting it to 0.
es: El límite de miembros puede deshabilitarse configurándolo en 0.

source: Route an extension or DDI to the conference
es: Enrutar una extensión o DDI a la conferencia

source: In order to enter a conference there must be a number that is route to them:
es: Para ingresar a una conferencia debe haber un número que se enrute a ellas:

source: In the following section we will see how to configure a :ref:`external DDI <ddis>` to a conference room so it can be used by external callers.
es: En la siguiente sección veremos cómo configurar un :ref:`DDI externo <ddis>` a una sala de conferencias para que pueda ser utilizado por llamantes externos.

source: There are other ways to make external callers join a conference room without using a DDI: it can be assigned to an Extension. This way, any user can transfer the call to the conference extension, or can be routed, for example using an IVR entry.
es: Hay otras formas de hacer que los llamantes externos se unan a una sala de conferencias sin usar un DDI: se puede asignar a una Extensión. De esta manera, cualquier usuario puede transferir la llamada a la extensión de la conferencia, o puede ser enrutada, por ejemplo, usando una entrada IVR.
