Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/hunt_groups.po
Languages: es

source: Hunt groups
es: Grupos de búsqueda

source: The hunt groups allows configuring more complex *ringing* process than the traditional **call to a user**.
es: Los grupos de búsqueda permiten configurar un proceso de *llamada* más complejo que la tradicional **llamada a un usuario**.

source: These are the fields shown for new hunt groups:
es: Estos son los campos mostrados para nuevos grupos de búsqueda:

source: Basic configuration
es: Configuración básica

source: Name
es: Nombre

source: Used to reference this hunt group
es: Usado para referenciar este grupo de búsqueda

source: Description
es: Descripción

source: Additional information
es: Información adicional

source: Strategy
es: Estrategia

source: Describes how will the calls be delivered. See details in glossary below.
es: Describe cómo se entregarán las llamadas. Ver detalles en el glosario a continuación.

source: Ring all timeout
es: Tiempo de espera de llamada a todos

source: For *Ringall* strategy, defines for how long will the members be called.
es: Para la estrategia *Ringall*, define por cuánto tiempo serán llamados los miembros.

source: Prevent missed calls
es: Prevenir llamadas perdidas

source: When 'Yes', calls will never generate a missed call. When 'No', missed calls will be prevented only for RingAll hunt groups if someone answers.
es: Cuando 'Sí', las llamadas nunca generarán una llamada perdida. Cuando 'No', las llamadas perdidas se evitarán solo para los grupos de búsqueda RingAll si alguien responde.

source: Allow Call Forwards
es: Permitir desvíos de llamadas

source: When 'No', user's call forward settings (including DND and boss/assistant) and 3XX responses will be ignored. Otherwise, they will be followed.
es: Cuando 'No', se ignorarán las configuraciones de desvío de llamadas del usuario (incluyendo DND y jefe/asistente) y las respuestas 3XX. De lo contrario, se seguirán.

source: No answer configuration
es: Configuración de no respuesta

source: Policy when hunt group members do not answer the call after defined timeouts. A locution and a target can be set up.
es: Política cuando los miembros del grupo de búsqueda no responden la llamada después de los tiempos de espera definidos. Se puede configurar una locución y un destino.

source: When configuring a hunt group, you can prevent missed calls on called members with **Prevent missed calls** setting:
es: Al configurar un grupo de búsqueda, puede evitar llamadas perdidas en los miembros llamados con la configuración **Prevenir llamadas perdidas**:

source: **Yes**: calls generated by the hunt group will never generate missed calls on called members.
es: **Sí**: las llamadas generadas por el grupo de búsqueda nunca generarán llamadas perdidas en los miembros llamados.

source: **No**: The behaviour of this setting depends on the hunt group type:
es: **No**: El comportamiento de esta configuración depende del tipo de grupo de búsqueda:

source: **RingAll**: calls generated by the hunt group will generate missed calls on called members only if none of them answers the call.
es: **RingAll**: las llamadas generadas por el grupo de búsqueda generarán llamadas perdidas en los miembros llamados solo si ninguno de ellos responde la llamada.

source: **Remaining types**: calls generated by the hunt group will generate missed calls on every called member that does not answer the call.
es: **Tipos restantes**: las llamadas generadas por el grupo de búsqueda generarán llamadas perdidas en cada miembro llamado que no responda la llamada.

source: Enabling **Allow Call Forwards** may cause undesired behaviours:
es: Habilitar **Permitir desvíos de llamadas** puede causar comportamientos no deseados:

source: Member not being called as has DND enabled.
es: Miembro no llamado porque tiene DND habilitado.

source: Member marked as boss not being called (assistant will be called instead).
es: Miembro marcado como jefe no llamado (se llamará al asistente en su lugar).

source: Huntgroup's *No answer configuration* never applying (e.g. no answer timeout on called user that applies sooner than Ringall timeout).
es: La *Configuración de no respuesta* del grupo de búsqueda nunca se aplica (por ejemplo, tiempo de espera de no respuesta en el usuario llamado que se aplica antes que el tiempo de espera de Ringall).

source: Huntgroup's members not being called (e.g. sequential huntgroup, first member forwards call to its cell phone).
es: Los miembros del grupo de búsqueda no son llamados (por ejemplo, grupo de búsqueda secuencial, el primer miembro desvía la llamada a su teléfono móvil).

source: **Use this feature wisely**.
es: **Use esta función con prudencia**.

source: There are 4 strategies available:
es: Hay 4 estrategias disponibles:

source: The call will make all the terminals of the group during a predefined time.
es: La llamada hará sonar todos los terminales del grupo durante un tiempo predefinido.

source: Linear
es: Lineal

source: The call will *jump* from one user to another in a predefined order ringing during the configured time. If the call is not answered by any user of the group, it will be hung up (or will trigger the no answer logic).
es: La llamada *saltará* de un usuario a otro en un orden predefinido sonando durante el tiempo configurado. Si la llamada no es respondida por ningún usuario del grupo, se colgará (o activará la lógica de no respuesta).

source: The call will *jump* from one user to another in a predefined order ringing during the configured time. If the call is not answered by any user of the group, the call will *jump* again to the first member of the group and keep looping.
es: La llamada *saltará* de un usuario a otro en un orden predefinido sonando durante el tiempo configurado. Si la llamada no es respondida por ningún usuario del grupo, la llamada *saltará* nuevamente al primer miembro del grupo y seguirá en bucle.

source: Random
es: Aleatorio

source: The call will *jump* from one user to another in a random order, ringing during the configured time. If the call is not answered by any user of the group, it will be hung up (or will trigger the no answer logic).
es: La llamada *saltará* de un usuario a otro en un orden aleatorio, sonando durante el tiempo configurado. Si la llamada no es respondida por ningún usuario del grupo, se colgará (o activará la lógica de no respuesta).

source: Adding members to hunt group
es: Agregar miembros al grupo de búsqueda

source: **List of members** subsection allows adding users or external numbers to each group:
es: La subsección **Lista de miembros** permite agregar usuarios o números externos a cada grupo:

source: For *RingAll hunt groups*, members will be added without any additional parameters.
es: Para los grupos de búsqueda *RingAll*, los miembros se agregarán sin ningún parámetro adicional.

source: For remaining groups, priority and timeout will be specified for each member. Priority determines the order, timeout ring duration for each member.
es: Para los grupos restantes, se especificarán la prioridad y el tiempo de espera para cada miembro. La prioridad determina el orden, el tiempo de espera la duración de la llamada para cada miembro.

source: Section :ref:`Users` also allows adding member to existing hunt groups using **List of hunt groups** option.
es: La sección :ref:`Usuarios <Users>` también permite agregar miembros a grupos de búsqueda existentes usando la opción **Lista de grupos de búsqueda**.
