Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/ivrs.po
Languages: es

source: Interactive Voice Responses (IVRs)
es: Respuestas de Voz Interactivas (IVRs)

source: IVRs are the most common way to make **audio menus** where the caller must choose the destination of the call by **pressing codes** based on the locutions instructions that will be played.
es: Los IVRs son la forma más común de hacer **menús de audio** donde el llamante debe elegir el destino de la llamada **presionando códigos** basados en las instrucciones de las locuciones que se reproducirán.

source: IVRs support specifying actions for dialed digits, but also they can be also be used to route any existing client extension.
es: Los IVRs admiten especificar acciones para los dígitos marcados, pero también pueden usarse para enrutar cualquier extensión de cliente existente.

source: IVRs have the following fields:
es: Los IVRs tienen los siguientes campos:

source: Basic configuration
es: Configuración básica

source: Name
es: Nombre

source: Descriptive name of the IVR that will be used in other sections.
es: Nombre descriptivo del IVR que se utilizará en otras secciones.

source: Timeout
es: Tiempo de espera

source: Time that caller has to enter the digits of the target extension.
es: Tiempo que tiene el llamante para ingresar los dígitos de la extensión de destino.

source: Max digits
es: Máximo de dígitos

source: Maximum number of digits allowed in this IVR.
es: Número máximo de dígitos permitidos en este IVR.

source: Welcome locution
es: Locución de bienvenida

source: This locution will be played as soon as the caller enters the IVR.
es: Esta locución se reproducirá tan pronto como el llamante ingrese al IVR.

source: Success locution
es: Locución de éxito

source: In case the dialed number matches one of the IVR entries or extension exists in the client (and allow extensions is enabled), this locution will be played (usually something like 'Connecting, please wait...').
es: En caso de que el número marcado coincida con una de las entradas del IVR o la extensión exista en el cliente (y permitir extensiones esté habilitado), se reproducirá esta locución (generalmente algo como 'Conectando, por favor espere...').

source: Dialing extensions
es: Marcando extensiones

source: Allow dialing extensions
es: Permitir marcar extensiones

source: When this setting is enabled, the caller can directly press the extension that must previously know (or the welcome locution suggests) and the system will automatically connect with that extension.
es: Cuando esta configuración está habilitada, el llamante puede presionar directamente la extensión que debe conocer previamente (o la locución de bienvenida sugiere) y el sistema se conectará automáticamente con esa extensión.

source: Excluded Extensions
es: Extensiones excluidas

source: When Allow extensions is enabled, you can exclude some extensions to be directly dialed adding them to the exclusion list.
es: Cuando Permitir extensiones está habilitado, puedes excluir algunas extensiones para que se marquen directamente agregándolas a la lista de exclusión.

source: No input configuration
es: Configuración sin entrada

source: If the caller does not input any digit in the timeout value, the no input process will trigger, playing the configured locution and redirecting to another number, extension or voicemail.
es: Si el llamante no ingresa ningún dígito en el valor de tiempo de espera, se activará el proceso sin entrada, reproduciendo la locución configurada y redirigiendo a otro número, extensión o buzón de voz.

source: No input locution
es: Locución sin entrada

source: Locution that will be played.
es: Locución que se reproducirá.

source: No input target
es: Destino sin entrada

source: Number, extension or voicemail to redirect to after the locution is played. Additional fields are required depending on the selected value.
es: Número, extensión o buzón de voz al que redirigir después de que se reproduzca la locución. Se requieren campos adicionales dependiendo del valor seleccionado.

source: Error configuration
es: Configuración de error

source: If the dialed extension does not match any IVR entry, any client extensions (when allow extensions is enabled), or it matches one of the extensions in the excluded Extensions list, the error process will trigger, playing the configured locution and redirecting the call to another number, extension or voicemail.
es: Si la extensión marcada no coincide con ninguna entrada del IVR, ninguna extensión de cliente (cuando permitir extensiones está habilitado), o coincide con una de las extensiones en la lista de extensiones excluidas, se activará el proceso de error, reproduciendo la locución configurada y redirigiendo la llamada a otro número, extensión o buzón de voz.

source: Locution
es: Locución

source: Locution that will be played in case of error.
es: Locución que se reproducirá en caso de error.

source: Error target
es: Destino de error

source: IVR Entries
es: Entradas IVR

source: The most common usage for IVR is combining them with a welcome locution that says something like 'Press 1 to contact XXX, Press 2 to contact YYY, ..."
es: El uso más común de los IVR es combinarlos con una locución de bienvenida que diga algo como 'Presione 1 para contactar a XXX, Presione 2 para contactar a YYY, ..."

source: The process of each entry of the IVR can be defined in the following button:
es: El proceso de cada entrada del IVR se puede definir en el siguiente botón:

source: In this example, the caller can dial 1, 2 or 3 (the rest will be considered as an error and will trigger the **Error process**):
es: En este ejemplo, el llamante puede marcar 1, 2 o 3 (el resto se considerará un error y activará el **proceso de error**):

source: 1: Call to the internal extension 200, created in :ref:`previous section <huntgroups>` that routes to hunt group *Reception*.
es: 1: Llamada a la extensión interna 200, creada en :ref:`sección anterior <huntgroups>` que enruta al grupo de búsqueda *Recepción*.

source: 2: Call to the internal extension 101.
es: 2: Llamada a la extensión interna 101.

source: 3: Route this call to the external number 676 676 676.
es: 3: Enrutar esta llamada al número externo 676 676 676.

source: Each of the IVR entries supports a locution that, if set, will be played instead of the IVR **success locution**. This way, you can configure a generic locution (like 'Connecting....') or a custom one for a given entry (like 'Connecting reception department, please wait...').
es: Cada una de las entradas del IVR admite una locución que, si se establece, se reproducirá en lugar de la **locución de éxito** del IVR. De esta manera, puedes configurar una locución genérica (como 'Conectando....') o una personalizada para una entrada dada (como 'Conectando con el departamento de recepción, por favor espere...').

source: Entries are regular expressions
es: Las entradas son expresiones regulares

source: Entry information
es: Información de entrada

source: You can specify IVR entries as Regular Expressions. If entry is just a numeric value, it will be handled as a sequence of digits, otherwise it will be handled as a regular expression. This can be handy if you have the same behaviour for a group of dialed numbers.
es: Puedes especificar entradas IVR como Expresiones Regulares. Si la entrada es solo un valor numérico, se manejará como una secuencia de dígitos, de lo contrario se manejará como una expresión regular. Esto puede ser útil si tienes el mismo comportamiento para un grupo de números marcados.

source: Entry
es: Entrada

source: Regular expression.
es: Expresión regular.

source: Locution to be played in case of success.
es: Locución que se reproducirá en caso de éxito.

source: Display name
es: Nombre para mostrar

source: This value will be displayed in the called terminals
es: Este valor se mostrará en los terminales llamados

source: Routing configuration
es: Configuración de enrutamiento

source: Target type
es: Tipo de destino

source: Depending on the type chosen, additional parameters may be required.
es: Dependiendo del tipo elegido, se pueden requerir parámetros adicionales.
