Repository: elmathzen/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_endpoints/queues.po
Languages: es

source: Queues
es: Colas

source: Easy queue behaviour was included in IvozProvider in 1.3 version. It is a simple approach with **the unique goal to provide the capability to handle more calls than users attending them**.
es: El comportamiento de colas fácil se incluyó en IvozProvider en la versión 1.3. Es un enfoque simple con **el único objetivo de proporcionar la capacidad de manejar más llamadas que usuarios atendiéndolas**.

source: Queues and callcenter are close terms but different. **IvozProvider is not a suitable product for callcenters**, as it does not provide advanced features that are crucial to them (reports, RT visualization, queue related stat, etc.).
es: Colas y callcenter son términos cercanos pero diferentes. **IvozProvider no es un producto adecuado para callcenters**, ya que no proporciona características avanzadas que son cruciales para ellos (informes, visualización en tiempo real, estadísticas relacionadas con colas, etc.).

source: **In distributed installations** using Queues is only compatible with an static assignment or 'hash based' distribution (see **Distribute method** :ref:`here <Virtual PBX>`).
es: **En instalaciones distribuidas** el uso de Colas solo es compatible con una asignación estática o distribución 'basada en hash' (ver **Método de distribución** :ref:`aquí <Virtual PBX>`).

source: Brand operators can choose which Clients have queues (see **Features** in :ref:`Brand Configuration` and :ref:`Client Configuration`).
es: Los operadores de marca pueden elegir qué Clientes tienen colas (ver **Características** en :ref:`Configuración de Marca <Brand Configuration>` y :ref:`Configuración de Cliente <Client Configuration>`).

source: Queue configuration
es: Configuración de la cola

source: This are the settings related to a queue:
es: Estos son los ajustes relacionados con una cola:

source: Basic configuration
es: Configuración básica

source: Name
es: Nombre

source: Use to reference this queue. Allowed characters: a-z, A-Z, 0-9, underscore and '-'.
es: Usar para referenciar esta cola. Caracteres permitidos: a-z, A-Z, 0-9, guion bajo y '-'.

source: Weight
es: Peso

source: Prioritizes calls to an agent that attends calls in two (or more) queues. The higher, the more prioritized.
es: Prioriza las llamadas a un agente que atiende llamadas en dos (o más) colas. Cuanto mayor sea, más priorizado será.

source: Strategy
es: Estrategia

source: How will the queue deliver the calls? Calling to all agents, calling to a random one?
es: ¿Cómo entregará la cola las llamadas? ¿Llamando a todos los agentes, llamando a uno aleatorio?

source: Display name
es: Nombre para mostrar

source: This value will be displayed in the called terminals
es: Este valor se mostrará en los terminales llamados

source: Members configuration
es: Configuración de miembros

source: Member call seconds
es: Segundos de llamada del miembro

source: Defines how long will a call to an agent last.
es: Define cuánto durará una llamada a un agente.

source: Member rest seconds
es: Segundos de descanso del miembro

source: Seconds between calls for an agent.
es: Segundos entre llamadas para un agente.

source: Prevent missed calls
es: Prevenir llamadas perdidas

source: When 'Yes', calls will never generate a missed call. When 'No', missed calls will be prevented only for RingAll queues if someone answers.
es: Cuando 'Sí', las llamadas nunca generarán una llamada perdida. Cuando 'No', las llamadas perdidas se evitarán solo para colas RingAll si alguien responde.

source: Announce
es: Anunciar

source: Select a locution and its frequency. Caller waiting in the call will listen to this locution.
es: Seleccione una locución y su frecuencia. El llamante en espera escuchará esta locución.

source: Periodic Announce Locution
es: Locución de anuncio periódico

source: Locution periodically played to calls that are queued.
es: Locución reproducida periódicamente a las llamadas que están en cola.

source: Announce Position
es: Anunciar posición

source: Announce queue position to waiting users when they enter the queue and after defined frequency.
es: Anunciar la posición en la cola a los usuarios en espera cuando ingresan a la cola y después de la frecuencia definida.

source: Timeout configuration
es: Configuración de tiempo de espera

source: Limits the time that a call can wait in a queue and the following behaviour.
es: Limita el tiempo que una llamada puede esperar en una cola y el comportamiento siguiente.

source: Max wait time
es: Tiempo máximo de espera

source: If no queue member answers before this seconds, the timeout queue logic will be activated. Leave empty to disable.
es: Si ningún miembro de la cola responde antes de estos segundos, se activará la lógica de tiempo de espera de la cola. Dejar vacío para desactivar.

source: Locution
es: Locución

source: Full Queue configuration
es: Configuración completa de la cola

source: Limits the amount of people waiting in a call and the behaviour when this limit it reached.
es: Limita la cantidad de personas esperando en una llamada y el comportamiento cuando se alcanza este límite.

source: Apart from creating a queue, you have to assign users to it. This users will have a **penalty: a user will not be selected to deliver a call if any user with lower penalty is available**.
es: Aparte de crear una cola, tienes que asignar usuarios a ella. Estos usuarios tendrán una **penalización: un usuario no será seleccionado para entregar una llamada si cualquier usuario con una penalización menor está disponible**.

source: A call can be sent to a queue selecting it in the "Route type" selectors available in multiple sections of IvozProvider (extension to queue, DDI to queue, etc.)
es: Una llamada puede ser enviada a una cola seleccionándola en los selectores de "Tipo de ruta" disponibles en múltiples secciones de IvozProvider (extensión a cola, DDI a cola, etc.)

source: When configuring a queue, you can prevent missed calls on called members with **Prevent missed calls** setting:
es: Al configurar una cola, puedes prevenir llamadas perdidas en los miembros llamados con la configuración **Prevenir llamadas perdidas**:

source: **Yes**: calls generated by the queue will never generate missed calls on called members.
es: **Sí**: las llamadas generadas por la cola nunca generarán llamadas perdidas en los miembros llamados.

source: **No**: The behaviour of this setting depends on the queue strategy:
es: **No**: El comportamiento de esta configuración depende de la estrategia de la cola:

source: **RingAll**: calls generated by the queue will generate missed calls on called members only if none of them answers the call.
es: **RingAll**: las llamadas generadas por la cola generarán llamadas perdidas en los miembros llamados solo si ninguno de ellos responde la llamada.

source: **Remaining types**: calls generated by the queue will generate missed calls on every called member that does not answer the call.
es: **Tipos restantes**: las llamadas generadas por la cola generarán llamadas perdidas en cada miembro llamado que no responda la llamada.

source: Queue strategy
es: Estrategia de la cola

source: The queue strategy **always applies to current penalty members** starting with the smallest penalty value and only going to the next penalty if all members of current one are busy or unavailable.
es: La estrategia de la cola **siempre se aplica a los miembros con penalización actual** comenzando con el valor de penalización más pequeño y solo pasando a la siguiente penalización si todos los miembros de la actual están ocupados o no disponibles.

source: Ring all
es: Llamar a todos

source: The call will make all the members of the current priority during a predefined time.
es: La llamada hará que todos los miembros de la prioridad actual durante un tiempo predefinido.

source: Least recent
es: Menos reciente

source: The call will *jump* from one member to another in a predefined order based on the last time the member attended a call. Members whose latest call is older will be called first.
es: La llamada *saltará* de un miembro a otro en un orden predefinido basado en la última vez que el miembro atendió una llamada. Los miembros cuya última llamada sea más antigua serán llamados primero.

source: Fewer calls
es: Menos llamadas

source: The call will *jump* from one member to another in a predefined order based on the number of attended calls. Members that have attended less calls will be called first.
es: La llamada *saltará* de un miembro a otro en un orden predefinido basado en el número de llamadas atendidas. Los miembros que hayan atendido menos llamadas serán llamados primero.

source: Random
es: Aleatorio

source: The call will *jump* from one member to another in a random order, ringing during the configured time.
es: La llamada *saltará* de un miembro a otro en un orden aleatorio, sonando durante el tiempo configurado.

source: Round Robin memory
es: Memoria de Round Robin

source: The call will *jump* from one member to another in a predefined order starting past the last member that attended a call.
es: La llamada *saltará* de un miembro a otro en un orden predefinido comenzando después del último miembro que atendió una llamada.

source: Linear
es: Lineal

source: The call will *jump* from one member to another in a predefined order based on the creation time of the member.
es: La llamada *saltará* de un miembro a otro en un orden predefinido basado en el tiempo de creación del miembro.

source: A given penalty will never the called until all users with lower priority are on call.
es: Una penalización dada nunca será llamada hasta que todos los usuarios con menor prioridad estén en llamada.

source: *Linear* queues are special: a non-linear queue cannot be converted to linear.
es: Las colas *lineales* son especiales: una cola no lineal no puede convertirse en lineal.
